export const countryData = [
  {
    value: '410000',
    text: '河南省',
    center: '113.753094,34.767052',

    children: [
      {
        value: '410300',
        text: '洛阳市',
        center: '112.453895,34.619702',

        children: [
          {
            value: '410323',
            text: '新安县',
            center: '112.13246,34.728909',
          },
          {
            value: '410327',
            text: '宜阳县',
            center: '112.179187,34.51462',
          },
          {
            value: '410328',
            text: '洛宁县',
            center: '111.652958,34.389371',
          },
          {
            value: '410324',
            text: '栾川县',
            center: '111.615729,33.7857',
          },
          {
            value: '410303',
            text: '西工区',
            center: '112.428183,34.659959',
          },
          {
            value: '410302',
            text: '老城区',
            center: '112.469071,34.683645',
          },
          {
            value: '410329',
            text: '伊川县',
            center: '112.425751,34.421741',
          },
          {
            value: '410308',
            text: '孟津区',
            center: '112.44525,34.825587',
          },
          {
            value: '410307',
            text: '偃师区',
            center: '112.789375,34.72715',
          },
          {
            value: '410305',
            text: '涧西区',
            center: '112.395766,34.658177',
          },
          {
            value: '410304',
            text: '瀍河回族区',
            center: '112.500131,34.679773',
          },
          {
            value: '410311',
            text: '洛龙区',
            center: '112.463833,34.619711',
          },
          {
            value: '410325',
            text: '嵩县',
            center: '112.085432,34.134639',
          },
          {
            value: '410326',
            text: '汝阳县',
            center: '112.473013,34.154283',
          },
        ],
      },
      {
        value: '411200',
        text: '三门峡市',
        center: '111.200482,34.773196',

        children: [
          {
            value: '411202',
            text: '湖滨区',
            center: '111.188552,34.771296',
          },
          {
            value: '411221',
            text: '渑池县',
            center: '111.761753,34.767937',
          },
          {
            value: '411281',
            text: '义马市',
            center: '111.874726,34.747563',
          },
          {
            value: '411203',
            text: '陕州区',
            center: '111.103252,34.72066',
          },
          {
            value: '411224',
            text: '卢氏县',
            center: '111.04522,34.051866',
          },
          {
            value: '411282',
            text: '灵宝市',
            center: '110.894225,34.517734',
          },
        ],
      },
      {
        value: '411100',
        text: '漯河市',
        center: '114.0166,33.58038',

        children: [
          {
            value: '411122',
            text: '临颍县',
            center: '113.931121,33.828096',
          },
          {
            value: '411104',
            text: '召陵区',
            center: '114.093879,33.586509',
          },
          {
            value: '411102',
            text: '源汇区',
            center: '113.984164,33.572319',
          },
          {
            value: '411103',
            text: '郾城区',
            center: '114.006596,33.587697',
          },
          {
            value: '411121',
            text: '舞阳县',
            center: '113.609327,33.438259',
          },
        ],
      },
      {
        value: '411000',
        text: '许昌市',
        center: '113.852004,34.03732',

        children: [
          {
            value: '411003',
            text: '建安区',
            center: '113.822869,34.124729',
          },
          {
            value: '411025',
            text: '襄城县',
            center: '113.506904,33.851609',
          },
          {
            value: '411002',
            text: '魏都区',
            center: '113.830826,34.047189',
          },
          {
            value: '411024',
            text: '鄢陵县',
            center: '114.177329,34.102985',
          },
          {
            value: '411081',
            text: '禹州市',
            center: '113.488715,34.142442',
          },
          {
            value: '411082',
            text: '长葛市',
            center: '113.813972,34.195458',
          },
        ],
      },
      {
        value: '411300',
        text: '南阳市',
        center: '112.584753,33.016102',

        children: [
          {
            value: '411323',
            text: '西峡县',
            center: '111.473644,33.307272',
          },
          {
            value: '411303',
            text: '卧龙区',
            center: '112.528524,32.990313',
          },
          {
            value: '411321',
            text: '南召县',
            center: '112.429277,33.489804',
          },
          {
            value: '411328',
            text: '唐河县',
            center: '112.80829,32.682464',
          },
          {
            value: '411324',
            text: '镇平县',
            center: '112.234571,33.033826',
          },
          {
            value: '411326',
            text: '淅川县',
            center: '111.490902,33.137831',
          },
          {
            value: '411330',
            text: '桐柏县',
            center: '113.428702,32.379164',
          },
          {
            value: '411325',
            text: '内乡县',
            center: '111.849354,33.044698',
          },
          {
            value: '411329',
            text: '新野县',
            center: '112.3601,32.521282',
          },
          {
            value: '411327',
            text: '社旗县',
            center: '112.948183,33.056229',
          },
          {
            value: '411302',
            text: '宛城区',
            center: '112.539506,33.003564',
          },
          {
            value: '411322',
            text: '方城县',
            center: '113.012849,33.255387',
          },
          {
            value: '411381',
            text: '邓州市',
            center: '112.08745,32.687732',
          },
        ],
      },
      {
        value: '411500',
        text: '信阳市',
        center: '114.091058,32.148624',

        children: [
          {
            value: '411502',
            text: '浉河区',
            center: '114.05867,32.116885',
          },
          {
            value: '411525',
            text: '固始县',
            center: '115.654066,32.169239',
          },
          {
            value: '411527',
            text: '淮滨县',
            center: '115.420101,32.474772',
          },
          {
            value: '411522',
            text: '光山县',
            center: '114.91934,32.010736',
          },
          {
            value: '411528',
            text: '息县',
            center: '114.740392,32.34312',
          },
          {
            value: '411521',
            text: '罗山县',
            center: '114.512838,32.20436',
          },
          {
            value: '411503',
            text: '平桥区',
            center: '114.125595,32.101005',
          },
          {
            value: '411524',
            text: '商城县',
            center: '115.406894,31.79832',
          },
          {
            value: '411526',
            text: '潢川县',
            center: '115.051683,32.131426',
          },
          {
            value: '411523',
            text: '新县',
            center: '114.879309,31.643914',
          },
        ],
      },
      {
        value: '411700',
        text: '驻马店市',
        center: '114.021988,33.014038',

        children: [
          {
            value: '411728',
            text: '遂平县',
            center: '114.013323,33.146316',
          },
          {
            value: '411727',
            text: '汝南县',
            center: '114.362477,33.006808',
          },
          {
            value: '411723',
            text: '平舆县',
            center: '114.618537,32.96344',
          },
          {
            value: '411721',
            text: '西平县',
            center: '114.021492,33.387658',
          },
          {
            value: '411726',
            text: '泌阳县',
            center: '113.327144,32.723974',
          },
          {
            value: '411722',
            text: '上蔡县',
            center: '114.264381,33.262439',
          },
          {
            value: '411729',
            text: '新蔡县',
            center: '114.965519,32.74488',
          },
          {
            value: '411724',
            text: '正阳县',
            center: '114.392774,32.605697',
          },
          {
            value: '411725',
            text: '确山县',
            center: '114.016818,32.82134',
          },
          {
            value: '411702',
            text: '驿城区',
            center: '113.993753,32.97455',
          },
        ],
      },
      {
        value: '411600',
        text: '周口市',
        center: '114.701222,33.634652',

        children: [
          {
            value: '411602',
            text: '川汇区',
            center: '114.650551,33.647679',
          },
          {
            value: '411623',
            text: '商水县',
            center: '114.608135,33.562072',
          },
          {
            value: '411628',
            text: '鹿邑县',
            center: '115.484525,33.860698',
          },
          {
            value: '411622',
            text: '西华县',
            center: '114.529709,33.768277',
          },
          {
            value: '411603',
            text: '淮阳区',
            center: '114.852604,33.731543',
          },
          {
            value: '411627',
            text: '太康县',
            center: '114.837946,34.064513',
          },
          {
            value: '411624',
            text: '沈丘县',
            center: '115.098541,33.409805',
          },
          {
            value: '411681',
            text: '项城市',
            center: '114.875128,33.465609',
          },
          {
            value: '411621',
            text: '扶沟县',
            center: '114.394666,34.060062',
          },
          {
            value: '411625',
            text: '郸城县',
            center: '115.177141,33.64601',
          },
        ],
      },
      {
        value: '410500',
        text: '安阳市',
        center: '114.39248,36.098779',

        children: [
          {
            value: '410527',
            text: '内黄县',
            center: '114.90146,35.972016',
          },
          {
            value: '410503',
            text: '北关区',
            center: '114.355742,36.10766',
          },
          {
            value: '410523',
            text: '汤阴县',
            center: '114.357686,35.925155',
          },
          {
            value: '410526',
            text: '滑县',
            center: '114.517977,35.576128',
          },
          {
            value: '410522',
            text: '安阳县',
            center: '114.462953,36.09211',
          },
          {
            value: '410502',
            text: '文峰区',
            center: '114.356967,36.090593',
          },
          {
            value: '410506',
            text: '龙安区',
            center: '114.301037,36.076937',
          },
          {
            value: '410505',
            text: '殷都区',
            center: '114.303454,36.109938',
          },
          {
            value: '410581',
            text: '林州市',
            center: '113.819275,36.084127',
          },
        ],
      },
      {
        value: '410600',
        text: '鹤壁市',
        center: '114.297305,35.748329',

        children: [
          {
            value: '410622',
            text: '淇县',
            center: '114.208851,35.622571',
          },
          {
            value: '410602',
            text: '鹤山区',
            center: '114.163133,35.954647',
          },
          {
            value: '410603',
            text: '山城区',
            center: '114.184391,35.897862',
          },
          {
            value: '410611',
            text: '淇滨区',
            center: '114.298748,35.741763',
          },
          {
            value: '410621',
            text: '浚县',
            center: '114.550611,35.677249',
          },
        ],
      },
      {
        value: '410900',
        text: '濮阳市',
        center: '115.029246,35.762731',

        children: [
          {
            value: '410927',
            text: '台前县',
            center: '115.871671,35.970286',
          },
          {
            value: '410922',
            text: '清丰县',
            center: '115.104602,35.886694',
          },
          {
            value: '410926',
            text: '范县',
            center: '115.504081,35.85302',
          },
          {
            value: '410923',
            text: '南乐县',
            center: '115.205876,36.070219',
          },
          {
            value: '410902',
            text: '华龙区',
            center: '115.074453,35.778289',
          },
          {
            value: '410928',
            text: '濮阳县',
            center: '115.029165,35.713113',
          },
        ],
      },
      {
        value: '419001',
        text: '济源市',
        center: '112.602347,35.069057',

        children: [
          {
            value: '419001',
            text: '坡头镇',
            center: '112.580245,35.063381',
          },
          {
            value: '419001',
            text: '梨林镇',
            center: '112.753220,35.088183',
          },
          {
            value: '419001',
            text: '思礼镇',
            center: '112.388078,35.210276',
          },
          {
            value: '419001',
            text: '五龙口镇',
            center: '112.761264,35.195598',
          },
          {
            value: '419001',
            text: '王屋镇',
            center: '112.168531,35.124376',
          },
          {
            value: '419001',
            text: '玉泉街道',
            center: '112.623553,35.118882',
          },
          {
            value: '419001',
            text: '轵城镇',
            center: '112.622105,35.062530',
          },
          {
            value: '419001',
            text: '济水街道',
            center: '112.595477,35.094386',
          },
          {
            value: '419001',
            text: '沁园街道',
            center: '112.593210,35.082244',
          },
          {
            value: '419001',
            text: '下冶镇',
            center: '112.212297,35.113088',
          },
          {
            value: '419001',
            text: '克井镇',
            center: '112.634910,35.255031',
          },
          {
            value: '419001',
            text: '天坛街道',
            center: '112.566796,35.122905',
          },
          {
            value: '419001',
            text: '邵原镇',
            center: '112.114016,35.270480',
          },
          {
            value: '419001',
            text: '北海街道',
            center: '112.568975,35.111552',
          },
          {
            value: '419001',
            text: '承留镇',
            center: '112.508612,35.024328',
          },
          {
            value: '419001',
            text: '大峪镇',
            center: '112.318910,35.079253',
          },
        ],
      },
      {
        value: '410200',
        text: '开封市',
        center: '114.314278,34.798083',

        children: [
          {
            value: '410221',
            text: '杞县',
            center: '114.782629,34.549731',
          },
          {
            value: '410205',
            text: '禹王台区',
            center: '114.348105,34.777052',
          },
          {
            value: '410222',
            text: '通许县',
            center: '114.47315,34.502053',
          },
          {
            value: '410223',
            text: '尉氏县',
            center: '114.19305,34.411437',
          },
          {
            value: '410204',
            text: '鼓楼区',
            center: '114.348356,34.788473',
          },
          {
            value: '410225',
            text: '兰考县',
            center: '114.818228,34.856372',
          },
          {
            value: '410212',
            text: '祥符区',
            center: '114.441406,34.757546',
          },
          {
            value: '410203',
            text: '顺河回族区',
            center: '114.360824,34.795933',
          },
          {
            value: '410202',
            text: '龙亭区',
            center: '114.355378,34.815515',
          },
        ],
      },
      {
        value: '410400',
        text: '平顶山市',
        center: '113.192595,33.766554',

        children: [
          {
            value: '410403',
            text: '卫东区',
            center: '113.335316,33.735388',
          },
          {
            value: '410423',
            text: '鲁山县',
            center: '112.908052,33.738434',
          },
          {
            value: '410411',
            text: '湛河区',
            center: '113.3208727,33.72568115',
          },
          {
            value: '410481',
            text: '舞钢市',
            center: '113.516427,33.314147',
          },
          {
            value: '410402',
            text: '新华区',
            center: '113.293977,33.737251',
          },
          {
            value: '410482',
            text: '汝州市',
            center: '112.844696,34.16717',
          },
          {
            value: '410422',
            text: '叶县',
            center: '113.357476,33.627437',
          },
          {
            value: '410425',
            text: '郏县',
            center: '113.21261,33.971787',
          },
          {
            value: '410421',
            text: '宝丰县',
            center: '113.054538,33.869159',
          },
          {
            value: '410404',
            text: '石龙区',
            center: '112.898845,33.899247',
          },
        ],
      },
      {
        value: '410100',
        text: '郑州市',
        center: '113.625351,34.746303',

        children: [
          {
            value: '410185',
            text: '登封市',
            center: '113.05056,34.454877',
          },
          {
            value: '410102',
            text: '中原区',
            center: '113.612966,34.74828',
          },
          {
            value: '410108',
            text: '惠济区',
            center: '113.617055,34.867994',
          },
          {
            value: '410105',
            text: '金水区',
            center: '113.6603,34.800415',
          },
          {
            value: '410106',
            text: '上街区',
            center: '113.309185,34.803514',
          },
          {
            value: '410122',
            text: '中牟县',
            center: '113.975798,34.720535',
          },
          {
            value: '410103',
            text: '二七区',
            center: '113.640177,34.724138',
          },
          {
            value: '410181',
            text: '巩义市',
            center: '113.022354,34.748207',
          },
          {
            value: '410183',
            text: '新密市',
            center: '113.390932,34.540216',
          },
          {
            value: '410184',
            text: '新郑市',
            center: '113.74024,34.396479',
          },
          {
            value: '410182',
            text: '荥阳市',
            center: '113.383385,34.7866',
          },
          {
            value: '410104',
            text: '管城回族区',
            center: '113.677446,34.754436',
          },
        ],
      },
      {
        value: '411400',
        text: '商丘市',
        center: '115.656358,34.415165',

        children: [
          {
            value: '411421',
            text: '民权县',
            center: '115.175019,34.648384',
          },
          {
            value: '411423',
            text: '宁陵县',
            center: '115.314221,34.461226',
          },
          {
            value: '411402',
            text: '梁园区',
            center: '115.613609,34.444519',
          },
          {
            value: '411424',
            text: '柘城县',
            center: '115.305182,34.092015',
          },
          {
            value: '411422',
            text: '睢县',
            center: '115.071957,34.446572',
          },
          {
            value: '411481',
            text: '永城市',
            center: '116.449864,33.929927',
          },
          {
            value: '411426',
            text: '夏邑县',
            center: '116.131422,34.237801',
          },
          {
            value: '411403',
            text: '睢阳区',
            center: '115.653258,34.389048',
          },
          {
            value: '411425',
            text: '虞城县',
            center: '115.828519,34.400868',
          },
        ],
      },
      {
        value: '410700',
        text: '新乡市',
        center: '113.92679,35.303589',

        children: [
          {
            value: '410724',
            text: '获嘉县',
            center: '113.657551,35.260153',
          },
          {
            value: '410711',
            text: '牧野区',
            center: '113.908561,35.315614',
          },
          {
            value: '410703',
            text: '卫滨区',
            center: '113.865666,35.301796',
          },
          {
            value: '410783',
            text: '长垣市',
            center: '114.66885,35.201628',
          },
          {
            value: '410721',
            text: '新乡县',
            center: '113.813884,35.170066',
          },
          {
            value: '410726',
            text: '延津县',
            center: '114.205624,35.165876',
          },
          {
            value: '410702',
            text: '红旗区',
            center: '113.875211,35.302952',
          },
          {
            value: '410704',
            text: '凤泉区',
            center: '113.916183,35.384428',
          },
          {
            value: '410781',
            text: '卫辉市',
            center: '114.064584,35.398357',
          },
          {
            value: '410782',
            text: '辉县市',
            center: '113.80572,35.462964',
          },
          {
            value: '410725',
            text: '原阳县',
            center: '113.939829,35.066873',
          },
          {
            value: '410727',
            text: '封丘县',
            center: '114.418907,35.041237',
          },
        ],
      },
      {
        value: '410800',
        text: '焦作市',
        center: '113.241902,35.215726',

        children: [
          {
            value: '410803',
            text: '中站区',
            center: '113.182847,35.237227',
          },
          {
            value: '410802',
            text: '解放区',
            center: '113.230555,35.240403',
          },
          {
            value: '410804',
            text: '马村区',
            center: '113.32212,35.257084',
          },
          {
            value: '410821',
            text: '修武县',
            center: '113.447862,35.22286',
          },
          {
            value: '410811',
            text: '山阳区',
            center: '113.254581,35.215054',
          },
          {
            value: '410883',
            text: '孟州市',
            center: '112.791372,34.907229',
          },
          {
            value: '410825',
            text: '温县',
            center: '113.08067,34.93961',
          },
          {
            value: '410823',
            text: '武陟县',
            center: '113.401848,35.099458',
          },
          {
            value: '410882',
            text: '沁阳市',
            center: '112.950873,35.087569',
          },
          {
            value: '410822',
            text: '博爱县',
            center: '113.064701,35.170332',
          },
        ],
      },
    ],
  },
  {
    value: '440000',
    text: '广东省',
    center: '113.266887,23.133306',

    children: [
      {
        value: '440500',
        text: '汕头市',
        center: '116.681956,23.354152',

        children: [
          {
            value: '440515',
            text: '澄海区',
            center: '116.755945,23.466314',
          },
          {
            value: '440523',
            text: '南澳县',
            center: '117.023482,23.421658',
          },
          {
            value: '440512',
            text: '濠江区',
            center: '116.726701,23.286605',
          },
          {
            value: '440507',
            text: '龙湖区',
            center: '116.716464,23.372211',
          },
          {
            value: '440511',
            text: '金平区',
            center: '116.70341,23.365716',
          },
          {
            value: '440514',
            text: '潮南区',
            center: '116.439105,23.239196',
          },
          {
            value: '440513',
            text: '潮阳区',
            center: '116.601677,23.264923',
          },
        ],
      },
      {
        value: '440600',
        text: '佛山市',
        center: '113.121586,23.021351',

        children: [
          {
            value: '440608',
            text: '高明区',
            center: '112.892573,22.900047',
          },
          {
            value: '440607',
            text: '三水区',
            center: '112.897271,23.156675',
          },
          {
            value: '440606',
            text: '顺德区',
            center: '113.293197,22.805413',
          },
          {
            value: '440605',
            text: '南海区',
            center: '113.143246,23.028875',
          },
          {
            value: '440604',
            text: '禅城区',
            center: '113.122532,23.009475',
          },
        ],
      },
      {
        value: '441200',
        text: '肇庆市',
        center: '112.465245,23.047747',

        children: [
          {
            value: '441224',
            text: '怀集县',
            center: '112.166908,23.920806',
          },
          {
            value: '441226',
            text: '德庆县',
            center: '111.785544,23.145035',
          },
          {
            value: '441225',
            text: '封开县',
            center: '111.512177,23.423928',
          },
          {
            value: '441223',
            text: '广宁县',
            center: '112.440694,23.634808',
          },
          {
            value: '441284',
            text: '四会市',
            center: '112.734309,23.326991',
          },
          {
            value: '441203',
            text: '鼎湖区',
            center: '112.56738,23.159062',
          },
          {
            value: '441202',
            text: '端州区',
            center: '112.485577,23.051847',
          },
          {
            value: '441204',
            text: '高要区',
            center: '112.458055,23.02474',
          },
        ],
      },
      {
        value: '441300',
        text: '惠州市',
        center: '114.415587,23.112368',

        children: [
          {
            value: '441324',
            text: '龙门县',
            center: '114.254898,23.727873',
          },
          {
            value: '441322',
            text: '博罗县',
            center: '114.289602,23.172587',
          },
          {
            value: '441323',
            text: '惠东县',
            center: '114.720136,22.984831',
          },
          {
            value: '441303',
            text: '惠阳区',
            center: '114.456107,22.789431',
          },
          {
            value: '441302',
            text: '惠城区',
            center: '114.382526,23.084657',
          },
        ],
      },
      {
        value: '440300',
        text: '深圳市',
        center: '114.057939,22.543527',

        children: [
          {
            value: '440306',
            text: '宝安区',
            center: '113.883831,22.554986',
          },
          {
            value: '440305',
            text: '南山区',
            center: '113.930478,22.533191',
          },
          {
            value: '440304',
            text: '福田区',
            center: '114.055198,22.520922',
          },
          {
            value: '440307',
            text: '龙岗区',
            center: '114.246884,22.720889',
          },
          {
            value: '440311',
            text: '光明区',
            center: '113.936059,22.74875',
          },
          {
            value: '440308',
            text: '盐田区',
            center: '114.236739,22.557001',
          },
          {
            value: '440303',
            text: '罗湖区',
            center: '114.131611,22.548309',
          },
          {
            value: '440310',
            text: '坪山区',
            center: '114.350844,22.708786',
          },
          {
            value: '440309',
            text: '龙华区',
            center: '114.04491,22.696735',
          },
        ],
      },
      {
        value: '440400',
        text: '珠海市',
        center: '113.576892,22.271644',

        children: [
          {
            value: '440402',
            text: '香洲区',
            center: '113.543372,22.265635',
          },
          {
            value: '440403',
            text: '斗门区',
            center: '113.296228,22.209134',
          },
          {
            value: '440404',
            text: '金湾区',
            center: '113.363224,22.146717',
          },
          {
            value: '440499',
            text: '澳门大学横琴校区(由澳门实施管辖)',
            center: '113.548956,22.126197',
          },
        ],
      },
      {
        value: '440800',
        text: '湛江市',
        center: '110.357538,21.270108',

        children: [
          {
            value: '440881',
            text: '廉江市',
            center: '110.286109,21.609988',
          },
          {
            value: '440883',
            text: '吴川市',
            center: '110.779361,21.440763',
          },
          {
            value: '440882',
            text: '雷州市',
            center: '110.097011,20.914548',
          },
          {
            value: '440811',
            text: '麻章区',
            center: '110.333833,21.26437',
          },
          {
            value: '440825',
            text: '徐闻县',
            center: '110.17595,20.325969',
          },
          {
            value: '440804',
            text: '坡头区',
            center: '110.455192,21.244405',
          },
          {
            value: '440803',
            text: '霞山区',
            center: '110.397721,21.192463',
          },
          {
            value: '440823',
            text: '遂溪县',
            center: '110.25043,21.378371',
          },
          {
            value: '440802',
            text: '赤坎区',
            center: '110.365592,21.265948',
          },
        ],
      },
      {
        value: '440700',
        text: '江门市',
        center: '113.081548,22.578948',

        children: [
          {
            value: '440784',
            text: '鹤山市',
            center: '112.964203,22.765912',
          },
          {
            value: '440783',
            text: '开平市',
            center: '112.698113,22.377378',
          },
          {
            value: '440781',
            text: '台山市',
            center: '112.793812,22.251947',
          },
          {
            value: '440785',
            text: '恩平市',
            center: '112.304904,22.183743',
          },
          {
            value: '440705',
            text: '新会区',
            center: '113.034454,22.458519',
          },
          {
            value: '440704',
            text: '江海区',
            center: '113.111029,22.561301',
          },
          {
            value: '440703',
            text: '蓬江区',
            center: '113.078914,22.595285',
          },
        ],
      },
      {
        value: '441700',
        text: '阳江市',
        center: '111.98343,21.856853',

        children: [
          {
            value: '441781',
            text: '阳春市',
            center: '111.791587,22.17041',
          },
          {
            value: '441702',
            text: '江城区',
            center: '111.95486,21.862451',
          },
          {
            value: '441721',
            text: '阳西县',
            center: '111.617696,21.753935',
          },
          {
            value: '441704',
            text: '阳东区',
            center: '112.005586,21.869081',
          },
        ],
      },
      {
        value: '440900',
        text: '茂名市',
        center: '110.925533,21.662728',

        children: [
          {
            value: '440982',
            text: '化州市',
            center: '110.639581,21.664483',
          },
          {
            value: '440904',
            text: '电白区',
            center: '111.013368,21.513946',
          },
          {
            value: '440902',
            text: '茂南区',
            center: '110.918566,21.641661',
          },
          {
            value: '440983',
            text: '信宜市',
            center: '110.946866,22.354887',
          },
          {
            value: '440981',
            text: '高州市',
            center: '110.853169,21.918017',
          },
        ],
      },
      {
        value: '441500',
        text: '汕尾市',
        center: '115.375557,22.787204',

        children: [
          {
            value: '441523',
            text: '陆河县',
            center: '115.659978,23.301557',
          },
          {
            value: '441502',
            text: '城区',
            center: '115.36522,22.779204',
          },
          {
            value: '441581',
            text: '陆丰市',
            center: '115.652142,22.91874',
          },
          {
            value: '441521',
            text: '海丰县',
            center: '115.322974,22.967212',
          },
        ],
      },
      {
        value: '445300',
        text: '云浮市',
        center: '112.044524,22.915163',

        children: [
          {
            value: '445322',
            text: '郁南县',
            center: '111.535387,23.234561',
          },
          {
            value: '445381',
            text: '罗定市',
            center: '111.569788,22.768345',
          },
          {
            value: '445321',
            text: '新兴县',
            center: '112.225174,22.695915',
          },
          {
            value: '445303',
            text: '云安区',
            center: '112.002947,23.070334',
          },
          {
            value: '445302',
            text: '云城区',
            center: '112.043945,22.92815',
          },
        ],
      },
      {
        value: '441600',
        text: '河源市',
        center: '114.700215,23.744276',

        children: [
          {
            value: '441623',
            text: '连平县',
            center: '114.488358,24.369552',
          },
          {
            value: '441625',
            text: '东源县',
            center: '114.7466,23.790079',
          },
          {
            value: '441621',
            text: '紫金县',
            center: '115.183814,23.635597',
          },
          {
            value: '441602',
            text: '源城区',
            center: '114.703305,23.734055',
          },
          {
            value: '441622',
            text: '龙川县',
            center: '115.26002,24.100599',
          },
          {
            value: '441624',
            text: '和平县',
            center: '114.935634,24.469177',
          },
        ],
      },
      {
        value: '445100',
        text: '潮州市',
        center: '116.621901,23.657662',

        children: [
          {
            value: '445122',
            text: '饶平县',
            center: '117.0045,23.663294',
          },
          {
            value: '445102',
            text: '湘桥区',
            center: '116.628343,23.675104',
          },
          {
            value: '445103',
            text: '潮安区',
            center: '116.676971,23.463598',
          },
        ],
      },
      {
        value: '445200',
        text: '揭阳市',
        center: '116.372732,23.550968',

        children: [
          {
            value: '445224',
            text: '惠来县',
            center: '116.295038,23.033889',
          },
          {
            value: '445203',
            text: '揭东区',
            center: '116.411928,23.567252',
          },
          {
            value: '445202',
            text: '榕城区',
            center: '116.36714,23.525918',
          },
          {
            value: '445281',
            text: '普宁市',
            center: '116.165646,23.297742',
          },
          {
            value: '445222',
            text: '揭西县',
            center: '115.841742,23.431314',
          },
        ],
      },
      {
        value: '440200',
        text: '韶关市',
        center: '113.597324,24.810977',

        children: [
          {
            value: '440232',
            text: '乳源瑶族自治县',
            center: '113.275875,24.775856',
          },
          {
            value: '440204',
            text: '浈江区',
            center: '113.611077,24.804898',
          },
          {
            value: '440222',
            text: '始兴县',
            center: '114.061998,24.953908',
          },
          {
            value: '440282',
            text: '南雄市',
            center: '114.31184,25.117653',
          },
          {
            value: '440224',
            text: '仁化县',
            center: '113.749175,25.085764',
          },
          {
            value: '440203',
            text: '武江区',
            center: '113.58792,24.7929',
          },
          {
            value: '440229',
            text: '翁源县',
            center: '114.129986,24.350581',
          },
          {
            value: '440205',
            text: '曲江区',
            center: '113.604591,24.682826',
          },
          {
            value: '440233',
            text: '新丰县',
            center: '114.206641,24.059909',
          },
          {
            value: '440281',
            text: '乐昌市',
            center: '113.347669,25.129892',
          },
        ],
      },
      {
        value: '441800',
        text: '清远市',
        center: '113.056098,23.682064',

        children: [
          {
            value: '441882',
            text: '连州市',
            center: '112.377255,24.780873',
          },
          {
            value: '441826',
            text: '连南瑶族自治县',
            center: '112.287212,24.725953',
          },
          {
            value: '441881',
            text: '英德市',
            center: '113.401827,24.20716',
          },
          {
            value: '441825',
            text: '连山壮族瑶族自治县',
            center: '112.093726,24.570553',
          },
          {
            value: '441823',
            text: '阳山县',
            center: '112.641199,24.465234',
          },
          {
            value: '441821',
            text: '佛冈县',
            center: '113.531559,23.879455',
          },
          {
            value: '441803',
            text: '清新区',
            center: '113.017747,23.734677',
          },
          {
            value: '441802',
            text: '清城区',
            center: '113.062612,23.697889',
          },
        ],
      },
      {
        value: '440100',
        text: '广州市',
        center: '113.264499,23.130061',

        children: [
          {
            value: '440105',
            text: '海珠区',
            center: '113.317412,23.084003',
          },
          {
            value: '440114',
            text: '花都区',
            center: '113.220125,23.404326',
          },
          {
            value: '440117',
            text: '从化区',
            center: '113.586329,23.54915',
          },
          {
            value: '440112',
            text: '黄埔区',
            center: '113.480613,23.181355',
          },
          {
            value: '440118',
            text: '增城区',
            center: '113.810734,23.261452',
          },
          {
            value: '440115',
            text: '南沙区',
            center: '113.525178,22.801435',
          },
          {
            value: '440113',
            text: '番禺区',
            center: '113.383917,22.93756',
          },
          {
            value: '440106',
            text: '天河区',
            center: '113.361597,23.124817',
          },
          {
            value: '440103',
            text: '荔湾区',
            center: '113.218998,23.107123',
          },
          {
            value: '440104',
            text: '越秀区',
            center: '113.267065,23.128673',
          },
          {
            value: '440111',
            text: '白云区',
            center: '113.2732,23.157159',
          },
        ],
      },
      {
        value: '442000',
        text: '中山市',
        center: '113.392517,22.517024',

        children: [
          {
            value: '442000',
            text: '横栏镇',
            center: '113.223630,22.604755',
          },
          {
            value: '442000',
            text: '小榄镇',
            center: '113.320629,22.560691',
          },
          {
            value: '442000',
            text: '神湾镇',
            center: '113.376318,22.276818',
          },
          {
            value: '442000',
            text: '古镇镇',
            center: '113.221289,22.609652',
          },
          {
            value: '442000',
            text: '港口镇',
            center: '113.354019,22.602694',
          },
          {
            value: '442000',
            text: '石岐街道',
            center: '113.404120,22.548351',
          },
          {
            value: '442000',
            text: '三乡镇',
            center: '113.431869,22.387876',
          },
          {
            value: '442000',
            text: '大涌镇',
            center: '113.296691,22.483379',
          },
          {
            value: '442000',
            text: '阜沙镇',
            center: '113.340305,22.640609',
          },
          {
            value: '442000',
            text: '西区街道',
            center: '113.314421,22.564923',
          },
          {
            value: '442000',
            text: '沙溪镇',
            center: '113.343971,22.524791',
          },
          {
            value: '442000',
            text: '东凤镇',
            center: '113.307919,22.680266',
          },
          {
            value: '442000',
            text: '坦洲镇',
            center: '113.379236,22.286488',
          },
          {
            value: '442000',
            text: '黄圃镇',
            center: '113.359373,22.681261',
          },
          {
            value: '442000',
            text: '三角镇',
            center: '113.400593,22.640197',
          },
          {
            value: '442000',
            text: '五桂山街道',
            center: '113.476817,22.428448',
          },
          {
            value: '442000',
            text: '东区街道',
            center: '113.436188,22.514086',
          },
          {
            value: '442000',
            text: '板芙镇',
            center: '113.368695,22.406764',
          },
          {
            value: '442000',
            text: '民众街道',
            center: '113.472738,22.653889',
          },
          {
            value: '442000',
            text: '南朗街道',
            center: '113.486698,22.525740',
          },
          {
            value: '442000',
            text: '中山港街道',
            center: '113.418677,22.549913',
          },
          {
            value: '442000',
            text: '南头镇',
            center: '113.299916,22.683684',
          },
          {
            value: '442000',
            text: '南区街道',
            center: '113.367676,22.488858',
          },
        ],
      },
      {
        value: '441900',
        text: '东莞市',
        center: '113.751884,23.021016',

        children: [
          {
            value: '441900',
            text: '黄江镇',
            center: '113.983316,22.883915',
          },
          {
            value: '441900',
            text: '清溪镇',
            center: '114.109028,22.864049',
          },
          {
            value: '441900',
            text: '桥头镇',
            center: '114.065029,23.031536',
          },
          {
            value: '441900',
            text: '洪梅镇',
            center: '113.606888,23.015507',
          },
          {
            value: '441900',
            text: '石龙镇',
            center: '113.859537,23.089791',
          },
          {
            value: '441900',
            text: '高埗镇',
            center: '113.772920,23.100117',
          },
          {
            value: '441900',
            text: '石碣镇',
            center: '113.768285,23.088689',
          },
          {
            value: '441900',
            text: '麻涌镇',
            center: '113.616702,23.088653',
          },
          {
            value: '441900',
            text: '塘厦镇',
            center: '114.057782,22.833564',
          },
          {
            value: '441900',
            text: '望牛墩镇',
            center: '113.675238,23.067562',
          },
          {
            value: '441900',
            text: '道滘镇',
            center: '113.687246,23.004094',
          },
          {
            value: '441900',
            text: '万江街道',
            center: '113.714249,23.004871',
          },
          {
            value: '441900',
            text: '莞城街道',
            center: '113.756157,23.026359',
          },
          {
            value: '441900',
            text: '企石镇',
            center: '113.989933,23.054588',
          },
          {
            value: '441900',
            text: '东坑镇',
            center: '113.921005,22.989113',
          },
          {
            value: '441900',
            text: '大岭山镇',
            center: '113.806239,22.948285',
          },
          {
            value: '441900',
            text: '东城街道',
            center: '113.772060,22.941938',
          },
          {
            value: '441900',
            text: '南城街道',
            center: '113.768809,22.941355',
          },
          {
            value: '441900',
            text: '谢岗镇',
            center: '114.171775,22.984642',
          },
          {
            value: '441900',
            text: '樟木头镇',
            center: '114.015449,22.869270',
          },
          {
            value: '441900',
            text: '常平镇',
            center: '114.041069,23.007892',
          },
          {
            value: '441900',
            text: '凤岗镇',
            center: '114.139781,22.777948',
          },
          {
            value: '441900',
            text: '寮步镇',
            center: '113.917593,22.981271',
          },
          {
            value: '441900',
            text: '沙田镇',
            center: '113.582201,22.942601',
          },
          {
            value: '441900',
            text: '大朗镇',
            center: '113.947048,22.865074',
          },
          {
            value: '441900',
            text: '横沥镇',
            center: '114.030270,23.035086',
          },
          {
            value: '441900',
            text: '石排镇',
            center: '113.989827,23.069114',
          },
          {
            value: '441900',
            text: '茶山镇',
            center: '113.840966,23.092760',
          },
          {
            value: '441900',
            text: '中堂镇',
            center: '113.612748,23.042585',
          },
          {
            value: '441900',
            text: '厚街镇',
            center: '113.631616,22.934094',
          },
          {
            value: '441900',
            text: '长安镇',
            center: '113.802243,22.838519',
          },
          {
            value: '441900',
            text: '虎门镇',
            center: '113.631506,22.832134',
          },
        ],
      },
      {
        value: '441400',
        text: '梅州市',
        center: '116.122046,24.288832',

        children: [
          {
            value: '441426',
            text: '平远县',
            center: '115.891235,24.566928',
          },
          {
            value: '441481',
            text: '兴宁市',
            center: '115.731133,24.137296',
          },
          {
            value: '441427',
            text: '蕉岭县',
            center: '116.171477,24.658963',
          },
          {
            value: '441422',
            text: '大埔县',
            center: '116.694825,24.347037',
          },
          {
            value: '441424',
            text: '五华县',
            center: '115.775751,23.932568',
          },
          {
            value: '441403',
            text: '梅县区',
            center: '116.081395,24.266191',
          },
          {
            value: '441402',
            text: '梅江区',
            center: '116.116686,24.31065',
          },
          {
            value: '441423',
            text: '丰顺县',
            center: '116.181895,23.739364',
          },
        ],
      },
    ],
  },
  {
    value: '150000',
    text: '内蒙古自治区',
    center: '111.765226,40.818233',

    children: [
      {
        value: '150300',
        text: '乌海市',
        center: '106.79415,39.655048',

        children: [
          {
            value: '150304',
            text: '乌达区',
            center: '106.726043,39.505609',
          },
          {
            value: '150303',
            text: '海南区',
            center: '106.891472,39.441803',
          },
          {
            value: '150302',
            text: '海勃湾区',
            center: '106.8228,39.690873',
          },
        ],
      },
      {
        value: '150200',
        text: '包头市',
        center: '109.95315,40.621327',

        children: [
          {
            value: '150221',
            text: '土默特右旗',
            center: '110.527831,40.578253',
          },
          {
            value: '150223',
            text: '达尔罕茂明安联合旗',
            center: '110.432626,41.698992',
          },
          {
            value: '150206',
            text: '白云鄂博矿区',
            center: '109.973195,41.769956',
          },
          {
            value: '150203',
            text: '昆都仑区',
            center: '109.840249,40.658075',
          },
          {
            value: '150222',
            text: '固阳县',
            center: '110.060055,41.034757',
          },
          {
            value: '150205',
            text: '石拐区',
            center: '110.060783,40.676736',
          },
          {
            value: '150202',
            text: '东河区',
            center: '110.044008,40.57626',
          },
          {
            value: '150204',
            text: '青山区',
            center: '109.902157,40.644081',
          },
          {
            value: '150207',
            text: '九原区',
            center: '109.968082,40.611346',
          },
        ],
      },
      {
        value: '150800',
        text: '巴彦淖尔市',
        center: '107.387767,40.742987',

        children: [
          {
            value: '150824',
            text: '乌拉特中旗',
            center: '108.513653,41.58813',
          },
          {
            value: '150821',
            text: '五原县',
            center: '108.267466,41.088446',
          },
          {
            value: '150822',
            text: '磴口县',
            center: '107.008288,40.330534',
          },
          {
            value: '150823',
            text: '乌拉特前旗',
            center: '108.652114,40.737018',
          },
          {
            value: '150825',
            text: '乌拉特后旗',
            center: '107.074748,41.08412',
          },
          {
            value: '150826',
            text: '杭锦后旗',
            center: '107.151296,40.886596',
          },
          {
            value: '150802',
            text: '临河区',
            center: '107.363536,40.750969',
          },
        ],
      },
      {
        value: '150700',
        text: '呼伦贝尔市',
        center: '119.77845,49.166536',

        children: [
          {
            value: '150785',
            text: '根河市',
            center: '121.520165,50.779758',
          },
          {
            value: '150782',
            text: '牙克石市',
            center: '120.711639,49.285947',
          },
          {
            value: '150725',
            text: '陈巴尔虎旗',
            center: '119.424026,49.328916',
          },
          {
            value: '150702',
            text: '海拉尔区',
            center: '119.824542,49.234715',
          },
          {
            value: '150721',
            text: '阿荣旗',
            center: '123.458943,48.126553',
          },
          {
            value: '150783',
            text: '扎兰屯市',
            center: '122.708475,48.028396',
          },
          {
            value: '150724',
            text: '鄂温克族自治旗',
            center: '119.755253,49.146692',
          },
          {
            value: '150781',
            text: '满洲里市',
            center: '117.379134,49.59862',
          },
          {
            value: '150703',
            text: '扎赉诺尔区',
            center: '117.669939,49.511213',
          },
          {
            value: '150727',
            text: '新巴尔虎右旗',
            center: '116.8237,48.671865',
          },
          {
            value: '150723',
            text: '鄂伦春自治旗',
            center: '123.725643,50.591604',
          },
          {
            value: '150784',
            text: '额尔古纳市',
            center: '120.180506,50.243102',
          },
          {
            value: '150722',
            text: '莫力达瓦达斡尔族自治旗',
            center: '124.519023,48.477728',
          },
          {
            value: '150726',
            text: '新巴尔虎左旗',
            center: '118.269782,48.21827',
          },
        ],
      },
      {
        value: '152900',
        text: '阿拉善盟',
        center: '105.729135,38.851554',

        children: [
          {
            value: '152923',
            text: '额济纳旗',
            center: '101.055861,41.953963',
          },
          {
            value: '152922',
            text: '阿拉善右旗',
            center: '101.666917,39.216185',
          },
          {
            value: '152921',
            text: '阿拉善左旗',
            center: '105.666208,38.833589',
          },
        ],
      },
      {
        value: '152200',
        text: '兴安盟',
        center: '122.037796,46.082373',

        children: [
          {
            value: '152202',
            text: '阿尔山市',
            center: '119.943577,47.17744',
          },
          {
            value: '152222',
            text: '科尔沁右翼中旗',
            center: '121.476357,45.060728',
          },
          {
            value: '152224',
            text: '突泉县',
            center: '121.593972,45.381918',
          },
          {
            value: '152223',
            text: '扎赉特旗',
            center: '122.899627,46.723154',
          },
          {
            value: '152221',
            text: '科尔沁右翼前旗',
            center: '121.952638,46.079664',
          },
          {
            value: '152201',
            text: '乌兰浩特市',
            center: '122.093309,46.072233',
          },
        ],
      },
      {
        value: '150100',
        text: '呼和浩特市',
        center: '111.748814,40.842127',

        children: [
          {
            value: '150103',
            text: '回民区',
            center: '111.623485,40.808906',
          },
          {
            value: '150125',
            text: '武川县',
            center: '111.451226,41.096511',
          },
          {
            value: '150122',
            text: '托克托县',
            center: '111.193879,40.277703',
          },
          {
            value: '150121',
            text: '土默特左旗',
            center: '111.16373,40.729044',
          },
          {
            value: '150102',
            text: '新城区',
            center: '111.665325,40.858271',
          },
          {
            value: '150124',
            text: '清水河县',
            center: '111.647351,39.921224',
          },
          {
            value: '150123',
            text: '和林格尔县',
            center: '111.821695,40.379226',
          },
          {
            value: '150104',
            text: '玉泉区',
            center: '111.674157,40.753054',
          },
          {
            value: '150105',
            text: '赛罕区',
            center: '111.701166,40.792508',
          },
        ],
      },
      {
        value: '150900',
        text: '乌兰察布市',
        center: '113.132227,40.994526',

        children: [
          {
            value: '150929',
            text: '四子王旗',
            center: '111.706663,41.533542',
          },
          {
            value: '150923',
            text: '商都县',
            center: '113.577778,41.562176',
          },
          {
            value: '150922',
            text: '化德县',
            center: '114.01029,41.904123',
          },
          {
            value: '150928',
            text: '察哈尔右翼后旗',
            center: '113.191505,41.435937',
          },
          {
            value: '150927',
            text: '察哈尔右翼中旗',
            center: '112.635348,41.277449',
          },
          {
            value: '150924',
            text: '兴和县',
            center: '113.834176,40.8723',
          },
          {
            value: '150921',
            text: '卓资县',
            center: '112.577716,40.894618',
          },
          {
            value: '150981',
            text: '丰镇市',
            center: '113.109875,40.437022',
          },
          {
            value: '150902',
            text: '集宁区',
            center: '113.168973,41.000742',
          },
          {
            value: '150926',
            text: '察哈尔右翼前旗',
            center: '113.212409,40.783551',
          },
          {
            value: '150925',
            text: '凉城县',
            center: '112.504243,40.532358',
          },
        ],
      },
      {
        value: '150600',
        text: '鄂尔多斯市',
        center: '109.782473,39.608744',

        children: [
          {
            value: '150624',
            text: '鄂托克旗',
            center: '107.975948,39.089549',
          },
          {
            value: '150625',
            text: '杭锦旗',
            center: '108.736011,39.833243',
          },
          {
            value: '150621',
            text: '达拉特旗',
            center: '110.034133,40.412766',
          },
          {
            value: '150626',
            text: '乌审旗',
            center: '108.819485,38.60453',
          },
          {
            value: '150623',
            text: '鄂托克前旗',
            center: '107.47733,38.182402',
          },
          {
            value: '150627',
            text: '伊金霍洛旗',
            center: '109.747435,39.565064',
          },
          {
            value: '150603',
            text: '康巴什区',
            center: '109.858586,39.60793',
          },
          {
            value: '150602',
            text: '东胜区',
            center: '109.963403,39.823066',
          },
          {
            value: '150622',
            text: '准格尔旗',
            center: '111.239436,39.864923',
          },
        ],
      },
      {
        value: '150500',
        text: '通辽市',
        center: '122.243309,43.653566',

        children: [
          {
            value: '150581',
            text: '霍林郭勒市',
            center: '119.681242,45.533598',
          },
          {
            value: '150525',
            text: '奈曼旗',
            center: '120.657813,42.867433',
          },
          {
            value: '150523',
            text: '开鲁县',
            center: '121.319216,43.601446',
          },
          {
            value: '150524',
            text: '库伦旗',
            center: '121.810629,42.735556',
          },
          {
            value: '150526',
            text: '扎鲁特旗',
            center: '120.917953,44.567093',
          },
          {
            value: '150521',
            text: '科尔沁左翼中旗',
            center: '123.312202,44.126606',
          },
          {
            value: '150522',
            text: '科尔沁左翼后旗',
            center: '122.35677,42.935105',
          },
          {
            value: '150502',
            text: '科尔沁区',
            center: '122.25545,43.623133',
          },
        ],
      },
      {
        value: '150400',
        text: '赤峰市',
        center: '118.887613,42.256876',

        children: [
          {
            value: '150422',
            text: '巴林左旗',
            center: '119.362832,43.961547',
          },
          {
            value: '150423',
            text: '巴林右旗',
            center: '118.664235,43.534171',
          },
          {
            value: '150424',
            text: '林西县',
            center: '118.05545,43.61812',
          },
          {
            value: '150430',
            text: '敖汉旗',
            center: '119.921413,42.290731',
          },
          {
            value: '150402',
            text: '红山区',
            center: '118.953989,42.296317',
          },
          {
            value: '150404',
            text: '松山区',
            center: '118.916156,42.299795',
          },
          {
            value: '150426',
            text: '翁牛特旗',
            center: '119.006187,42.936529',
          },
          {
            value: '150425',
            text: '克什克腾旗',
            center: '117.545413,43.265057',
          },
          {
            value: '150429',
            text: '宁城县',
            center: '119.320056,41.600193',
          },
          {
            value: '150421',
            text: '阿鲁科尔沁旗',
            center: '120.065533,43.872398',
          },
          {
            value: '150403',
            text: '元宝山区',
            center: '119.288475,42.039602',
          },
          {
            value: '150428',
            text: '喀喇沁旗',
            center: '118.701934,41.927103',
          },
        ],
      },
      {
        value: '152500',
        text: '锡林郭勒盟',
        center: '116.047387,43.933212',

        children: [
          {
            value: '152525',
            text: '东乌珠穆沁旗',
            center: '116.97526,45.497329',
          },
          {
            value: '152502',
            text: '锡林浩特市',
            center: '116.085814,43.933417',
          },
          {
            value: '152526',
            text: '西乌珠穆沁旗',
            center: '117.608668,44.587746',
          },
          {
            value: '152523',
            text: '苏尼特左旗',
            center: '113.667171,43.859718',
          },
          {
            value: '152522',
            text: '阿巴嘎旗',
            center: '114.950185,44.022831',
          },
          {
            value: '152524',
            text: '苏尼特右旗',
            center: '112.641806,42.742417',
          },
          {
            value: '152501',
            text: '二连浩特市',
            center: '111.949594,43.64285',
          },
          {
            value: '152530',
            text: '正蓝旗',
            center: '115.991648,42.241815',
          },
          {
            value: '152529',
            text: '正镶白旗',
            center: '115.029748,42.287493',
          },
          {
            value: '152528',
            text: '镶黄旗',
            center: '113.847287,42.232371',
          },
          {
            value: '152531',
            text: '多伦县',
            center: '116.485549,42.203454',
          },
          {
            value: '152527',
            text: '太仆寺旗',
            center: '115.283173,41.876889',
          },
        ],
      },
    ],
  },
  {
    value: '230000',
    text: '黑龙江省',
    center: '126.661998,45.742253',

    children: [
      {
        value: '232700',
        text: '大兴安岭地区',
        center: '124.11786,50.41129',

        children: [
          {
            value: '232701',
            text: '漠河市',
            center: '122.539313,52.972465',
          },
          {
            value: '232722',
            text: '塔河县',
            center: '124.709733,52.334512',
          },
          {
            value: '232721',
            text: '呼玛县',
            center: '126.651856,51.725924',
          },
          {
            value: '232718',
            text: '加格达奇区',
            center: '124.139742,50.408822',
          },
        ],
      },
      {
        value: '230900',
        text: '七台河市',
        center: '131.003015,45.771178',

        children: [
          {
            value: '230903',
            text: '桃山区',
            center: '131.020046,45.765733',
          },
          {
            value: '230921',
            text: '勃利县',
            center: '130.592009,45.755856',
          },
          {
            value: '230904',
            text: '茄子河区',
            center: '131.067545,45.785755',
          },
          {
            value: '230902',
            text: '新兴区',
            center: '130.93226,45.816579',
          },
        ],
      },
      {
        value: '230400',
        text: '鹤岗市',
        center: '130.297687,47.350659',

        children: [
          {
            value: '230422',
            text: '绥滨县',
            center: '131.852863,47.289522',
          },
          {
            value: '230403',
            text: '工农区',
            center: '130.27472,47.318971',
          },
          {
            value: '230407',
            text: '兴山区',
            center: '130.303598,47.357698',
          },
          {
            value: '230402',
            text: '向阳区',
            center: '130.294331,47.342478',
          },
          {
            value: '230404',
            text: '南山区',
            center: '130.285991,47.315121',
          },
          {
            value: '230406',
            text: '东山区',
            center: '130.317151,47.338571',
          },
          {
            value: '230405',
            text: '兴安区',
            center: '130.239289,47.252805',
          },
          {
            value: '230421',
            text: '萝北县',
            center: '130.820566,47.578979',
          },
        ],
      },
      {
        value: '230100',
        text: '哈尔滨市',
        center: '126.53505,45.802981',

        children: [
          {
            value: '230126',
            text: '巴彦县',
            center: '127.403521,46.086182',
          },
          {
            value: '230123',
            text: '依兰县',
            center: '129.567777,46.325536',
          },
          {
            value: '230128',
            text: '通河县',
            center: '128.74629,45.990214',
          },
          {
            value: '230127',
            text: '木兰县',
            center: '128.043194,45.950649',
          },
          {
            value: '230124',
            text: '方正县',
            center: '128.829513,45.851673',
          },
          {
            value: '230125',
            text: '宾县',
            center: '127.466372,45.746313',
          },
          {
            value: '230129',
            text: '延寿县',
            center: '128.311071,45.445956',
          },
          {
            value: '230108',
            text: '平房区',
            center: '126.63675,45.597529',
          },
          {
            value: '230183',
            text: '尚志市',
            center: '128.009218,45.209199',
          },
          {
            value: '230184',
            text: '五常市',
            center: '127.167501,44.932164',
          },
          {
            value: '230112',
            text: '阿城区',
            center: '126.957984,45.548671',
          },
          {
            value: '230111',
            text: '呼兰区',
            center: '126.587704,45.889557',
          },
          {
            value: '230109',
            text: '松北区',
            center: '126.516602,45.794991',
          },
          {
            value: '230113',
            text: '双城区',
            center: '126.31279,45.382873',
          },
          {
            value: '230110',
            text: '香坊区',
            center: '126.662959,45.707871',
          },
          {
            value: '230104',
            text: '道外区',
            center: '126.649094,45.792351',
          },
          {
            value: '230102',
            text: '道里区',
            center: '126.616912,45.755832',
          },
          {
            value: '230103',
            text: '南岗区',
            center: '126.66882,45.759967',
          },
        ],
      },
      {
        value: '230800',
        text: '佳木斯市',
        center: '130.318916,46.800002',

        children: [
          {
            value: '230826',
            text: '桦川县',
            center: '130.71908,47.023001',
          },
          {
            value: '230828',
            text: '汤原县',
            center: '129.904747,46.730623',
          },
          {
            value: '230803',
            text: '向阳区',
            center: '130.365263,46.807808',
          },
          {
            value: '230804',
            text: '前进区',
            center: '130.375254,46.81405',
          },
          {
            value: '230805',
            text: '东风区',
            center: '130.403588,46.822609',
          },
          {
            value: '230811',
            text: '郊区',
            center: '130.327182,46.809596',
          },
          {
            value: '230822',
            text: '桦南县',
            center: '130.553472,46.239314',
          },
          {
            value: '230882',
            text: '富锦市',
            center: '132.037659,47.250144',
          },
          {
            value: '230881',
            text: '同江市',
            center: '132.510113,47.642475',
          },
          {
            value: '230883',
            text: '抚远市',
            center: '134.30786,48.365027',
          },
        ],
      },
      {
        value: '230500',
        text: '双鸭山市',
        center: '131.141563,46.676157',

        children: [
          {
            value: '230522',
            text: '友谊县',
            center: '131.807815,46.767299',
          },
          {
            value: '230502',
            text: '尖山区',
            center: '131.158372,46.646083',
          },
          {
            value: '230503',
            text: '岭东区',
            center: '131.165067,46.592663',
          },
          {
            value: '230506',
            text: '宝山区',
            center: '131.401589,46.577167',
          },
          {
            value: '230523',
            text: '宝清县',
            center: '132.196907,46.327335',
          },
          {
            value: '230505',
            text: '四方台区',
            center: '131.337636,46.597143',
          },
          {
            value: '230521',
            text: '集贤县',
            center: '131.141452,46.728448',
          },
          {
            value: '230524',
            text: '饶河县',
            center: '134.014125,46.79726',
          },
        ],
      },
      {
        value: '231100',
        text: '黑河市',
        center: '127.528226,50.244887',

        children: [
          {
            value: '231102',
            text: '爱辉区',
            center: '127.500703,50.252361',
          },
          {
            value: '231181',
            text: '北安市',
            center: '126.490989,48.241168',
          },
          {
            value: '231124',
            text: '孙吴县',
            center: '127.336163,49.425645',
          },
          {
            value: '231123',
            text: '逊克县',
            center: '128.478698,49.56429',
          },
          {
            value: '231182',
            text: '五大连池市',
            center: '126.205446,48.517342',
          },
          {
            value: '231183',
            text: '嫩江市',
            center: '125.221192,49.185766',
          },
        ],
      },
      {
        value: '231000',
        text: '牡丹江市',
        center: '129.632928,44.551486',

        children: [
          {
            value: '231004',
            text: '爱民区',
            center: '129.591227,44.595897',
          },
          {
            value: '231002',
            text: '东安区',
            center: '129.626651,44.58125',
          },
          {
            value: '231081',
            text: '绥芬河市',
            center: '131.151805,44.412487',
          },
          {
            value: '231003',
            text: '阳明区',
            center: '129.635836,44.595851',
          },
          {
            value: '231085',
            text: '穆棱市',
            center: '130.52446,44.918842',
          },
          {
            value: '231025',
            text: '林口县',
            center: '130.282286,45.279754',
          },
          {
            value: '231083',
            text: '海林市',
            center: '129.380756,44.594017',
          },
          {
            value: '231086',
            text: '东宁市',
            center: '131.124839,44.090361',
          },
          {
            value: '231084',
            text: '宁安市',
            center: '129.482505,44.340617',
          },
          {
            value: '231005',
            text: '西安区',
            center: '129.616021,44.577611',
          },
        ],
      },
      {
        value: '231200',
        text: '绥化市',
        center: '126.968714,46.654147',

        children: [
          {
            value: '231226',
            text: '绥棱县',
            center: '127.114928,47.235814',
          },
          {
            value: '231283',
            text: '海伦市',
            center: '126.930191,47.450661',
          },
          {
            value: '231224',
            text: '庆安县',
            center: '127.507586,46.880628',
          },
          {
            value: '231202',
            text: '北林区',
            center: '126.984995,46.638114',
          },
          {
            value: '231221',
            text: '望奎县',
            center: '126.486333,46.832185',
          },
          {
            value: '231223',
            text: '青冈县',
            center: '126.099314,46.70398',
          },
          {
            value: '231225',
            text: '明水县',
            center: '125.90601,47.173649',
          },
          {
            value: '231222',
            text: '兰西县',
            center: '126.287734,46.252966',
          },
          {
            value: '231282',
            text: '肇东市',
            center: '125.962419,46.050664',
          },
          {
            value: '231281',
            text: '安达市',
            center: '125.307629,46.451882',
          },
        ],
      },
      {
        value: '230700',
        text: '伊春市',
        center: '128.840863,47.728332',

        children: [
          {
            value: '230722',
            text: '嘉荫县',
            center: '130.402406,48.888613',
          },
          {
            value: '230723',
            text: '汤旺县',
            center: '129.570935,48.454639',
          },
          {
            value: '230717',
            text: '伊美区',
            center: '128.907156,47.728257',
          },
          {
            value: '230724',
            text: '丰林县',
            center: '129.533661,48.290566',
          },
          {
            value: '230718',
            text: '乌翠区',
            center: '128.669458,47.726499',
          },
          {
            value: '230719',
            text: '友好区',
            center: '128.836341,47.840801',
          },
          {
            value: '230751',
            text: '金林区',
            center: '129.428839,47.413019',
          },
          {
            value: '230781',
            text: '铁力市',
            center: '128.032554,46.986604',
          },
          {
            value: '230725',
            text: '大箐山县',
            center: '129.020519,47.028313',
          },
          {
            value: '230726',
            text: '南岔县',
            center: '129.283584,47.139009',
          },
        ],
      },
      {
        value: '230600',
        text: '大庆市',
        center: '125.104078,46.589498',

        children: [
          {
            value: '230605',
            text: '红岗区',
            center: '124.891041,46.398567',
          },
          {
            value: '230606',
            text: '大同区',
            center: '124.812221,46.039972',
          },
          {
            value: '230623',
            text: '林甸县',
            center: '124.863628,47.171677',
          },
          {
            value: '230621',
            text: '肇州县',
            center: '125.268449,45.699543',
          },
          {
            value: '230604',
            text: '让胡路区',
            center: '124.889858,46.642567',
          },
          {
            value: '230624',
            text: '杜尔伯特蒙古族自治县',
            center: '124.442829,46.862348',
          },
          {
            value: '230622',
            text: '肇源县',
            center: '125.078311,45.518982',
          },
          {
            value: '230602',
            text: '萨尔图区',
            center: '125.135269,46.629281',
          },
          {
            value: '230603',
            text: '龙凤区',
            center: '125.135093,46.562369',
          },
        ],
      },
      {
        value: '230300',
        text: '鸡西市',
        center: '130.969385,45.295087',

        children: [
          {
            value: '230304',
            text: '滴道区',
            center: '130.844193,45.349068',
          },
          {
            value: '230307',
            text: '麻山区',
            center: '130.477691,45.211863',
          },
          {
            value: '230306',
            text: '城子河区',
            center: '131.011504,45.338342',
          },
          {
            value: '230305',
            text: '梨树区',
            center: '130.69699,45.092046',
          },
          {
            value: '230302',
            text: '鸡冠区',
            center: '130.981342,45.303892',
          },
          {
            value: '230303',
            text: '恒山区',
            center: '130.90466,45.21119',
          },
          {
            value: '230321',
            text: '鸡东县',
            center: '131.124083,45.260413',
          },
          {
            value: '230381',
            text: '虎林市',
            center: '132.937002,45.763262',
          },
          {
            value: '230382',
            text: '密山市',
            center: '131.846824,45.529482',
          },
        ],
      },
      {
        value: '230200',
        text: '齐齐哈尔市',
        center: '123.918193,47.354892',

        children: [
          {
            value: '230229',
            text: '克山县',
            center: '125.875103,48.037748',
          },
          {
            value: '230225',
            text: '甘南县',
            center: '123.507935,47.921698',
          },
          {
            value: '230230',
            text: '克东县',
            center: '126.249124,48.041562',
          },
          {
            value: '230223',
            text: '依安县',
            center: '125.306161,47.893442',
          },
          {
            value: '230227',
            text: '富裕县',
            center: '124.474411,47.774038',
          },
          {
            value: '230208',
            text: '梅里斯达斡尔族区',
            center: '123.752482,47.309755',
          },
          {
            value: '230207',
            text: '碾子山区',
            center: '122.887548,47.516614',
          },
          {
            value: '230221',
            text: '龙江县',
            center: '123.204953,47.338512',
          },
          {
            value: '230203',
            text: '建华区',
            center: '123.95555,47.354212',
          },
          {
            value: '230204',
            text: '铁锋区',
            center: '123.978079,47.340719',
          },
          {
            value: '230206',
            text: '富拉尔基区',
            center: '123.628926,47.20873',
          },
          {
            value: '230202',
            text: '龙沙区',
            center: '123.958447,47.317103',
          },
          {
            value: '230205',
            text: '昂昂溪区',
            center: '123.822137,47.154806',
          },
          {
            value: '230224',
            text: '泰来县',
            center: '123.416631,46.393694',
          },
          {
            value: '230231',
            text: '拜泉县',
            center: '126.09905,47.59586',
          },
          {
            value: '230281',
            text: '讷河市',
            center: '124.88293,48.466829',
          },
        ],
      },
    ],
  },
  {
    value: '650000',
    text: '新疆维吾尔自治区',
    center: '87.628579,43.793301',

    children: [
      {
        value: '659005',
        text: '北屯市',
        center: '87.834419,47.326733',

        children: [
          {
            value: '659005',
            text: '海川镇',
            center: '87.518571,47.409865',
          },
          {
            value: '659005',
            text: '丰庆镇',
            center: '87.927121,47.333864',
          },
          {
            value: '659005',
            text: '北屯镇',
            center: '87.868844,47.355513',
          },
          {
            value: '659005',
            text: '双渠镇',
            center: '88.122468,47.126579',
          },
        ],
      },
      {
        value: '659006',
        text: '铁门关市',
        center: '85.670291,41.862997',

        children: [
          {
            value: '659006',
            text: '博古其镇',
            center: '85.584894,41.882542',
          },
          {
            value: '659006',
            text: '双丰镇',
            center: '85.635217,41.880304',
          },
        ],
      },
      {
        value: '659007',
        text: '双河市',
        center: '82.35365587,44.84052409',

        children: [
          {
            value: '659007',
            text: '兵团八十九团',
            center: '82.455805,44.812134',
          },
          {
            value: '659007',
            text: '博河镇',
            center: '82.158974,44.796350',
          },
          {
            value: '659007',
            text: '双桥镇',
            center: '82.490803,44.746864',
          },
          {
            value: '659007',
            text: '石峪镇',
            center: '82.066675,45.040830',
          },
          {
            value: '659007',
            text: '双乐镇',
            center: '82.473143,44.826624',
          },
        ],
      },
      {
        value: '652700',
        text: '博尔塔拉蒙古自治州',
        center: '82.066363,44.906039',

        children: [
          {
            value: '652723',
            text: '温泉县',
            center: '81.024827,44.968857',
          },
          {
            value: '652702',
            text: '阿拉山口市',
            center: '82.554609,45.173274',
          },
          {
            value: '652701',
            text: '博乐市',
            center: '82.051433,44.853882',
          },
          {
            value: '652722',
            text: '精河县',
            center: '82.890709,44.599202',
          },
        ],
      },
      {
        value: '659008',
        text: '可克达拉市',
        center: '80.994153,43.940381',

        children: [
          {
            value: '659008',
            text: '长丰镇',
            center: '80.990266,43.889725',
          },
          {
            value: '659008',
            text: '金屯镇',
            center: '80.606773,43.765174',
          },
          {
            value: '659008',
            text: '都拉塔口岸',
            center: '80.661467,43.706479',
          },
          {
            value: '659008',
            text: '苇湖镇',
            center: '80.648370,44.180308',
          },
          {
            value: '659008',
            text: '榆树庄镇',
            center: '80.484243,43.931223',
          },
          {
            value: '659008',
            text: '金梁镇',
            center: '81.021339,43.908278',
          },
        ],
      },
      {
        value: '654200',
        text: '塔城地区',
        center: '82.980316,46.745364',

        children: [
          {
            value: '654201',
            text: '塔城市',
            center: '82.986923,46.751669',
          },
          {
            value: '654226',
            text: '和布克赛尔蒙古自治县',
            center: '85.728328,46.793235',
          },
          {
            value: '654221',
            text: '额敏县',
            center: '83.628303,46.524673',
          },
          {
            value: '654225',
            text: '裕民县',
            center: '82.982252,46.201049',
          },
          {
            value: '654224',
            text: '托里县',
            center: '83.606372,45.948935',
          },
          {
            value: '654203',
            text: '沙湾市',
            center: '85.619483,44.326267',
          },
          {
            value: '654202',
            text: '乌苏市',
            center: '84.713762,44.418693',
          },
        ],
      },
      {
        value: '659009',
        text: '昆玉市',
        center: '79.270193,37.215372',

        children: [
          {
            value: '659009',
            text: '老兵镇',
            center: '79.603916,37.366638',
          },
          {
            value: '659009',
            text: '昆牧镇',
            center: '81.029494,36.315217',
          },
          {
            value: '659009',
            text: '昆泉镇',
            center: '78.514768,37.566112',
          },
          {
            value: '659009',
            text: '兵团二二四团',
            center: '79.341040,37.380043',
          },
        ],
      },
      {
        value: '653200',
        text: '和田地区',
        center: '79.921646,37.114406',

        children: [
          {
            value: '653227',
            text: '民丰县',
            center: '82.695946,37.064428',
          },
          {
            value: '653226',
            text: '于田县',
            center: '81.677417,36.85708',
          },
          {
            value: '653201',
            text: '和田市',
            center: '79.912881,37.112246',
          },
          {
            value: '653224',
            text: '洛浦县',
            center: '80.179911,37.066226',
          },
          {
            value: '653222',
            text: '墨玉县',
            center: '79.728434,37.277518',
          },
          {
            value: '653223',
            text: '皮山县',
            center: '78.28548,37.578264',
          },
          {
            value: '653225',
            text: '策勒县',
            center: '80.801433,36.99785',
          },
          {
            value: '653221',
            text: '和田县',
            center: '79.81906982,37.12003092',
          },
        ],
      },
      {
        value: '659001',
        text: '石河子市',
        center: '86.080397,44.305368',

        children: [
          {
            value: '659001',
            text: '兵团一五二团',
            center: '86.070393,44.282700',
          },
          {
            value: '659001',
            text: '向阳街道',
            center: '86.039719,44.342873',
          },
          {
            value: '659001',
            text: '红山街道',
            center: '86.048043,44.268209',
          },
          {
            value: '659001',
            text: '东城街道',
            center: '86.068708,44.287316',
          },
          {
            value: '659001',
            text: '老街街道',
            center: '85.990921,44.349559',
          },
          {
            value: '659001',
            text: '石河子镇',
            center: '86.102202,44.135229',
          },
          {
            value: '659001',
            text: '北泉镇',
            center: '86.098308,44.434587',
          },
          {
            value: '659001',
            text: '新城街道',
            center: '85.982288,44.289311',
          },
        ],
      },
      {
        value: '654300',
        text: '阿勒泰地区',
        center: '88.141253,47.844924',

        children: [
          {
            value: '654321',
            text: '布尔津县',
            center: '86.875043,47.701892',
          },
          {
            value: '654324',
            text: '哈巴河县',
            center: '86.418621,48.060846',
          },
          {
            value: '654322',
            text: '富蕴县',
            center: '89.525463,46.994046',
          },
          {
            value: '654326',
            text: '吉木乃县',
            center: '85.874096,47.443101',
          },
          {
            value: '654325',
            text: '青河县',
            center: '90.375159,46.678532',
          },
          {
            value: '654323',
            text: '福海县',
            center: '87.486703,47.111918',
          },
          {
            value: '654301',
            text: '阿勒泰市',
            center: '88.131842,47.827308',
          },
        ],
      },
      {
        value: '652300',
        text: '昌吉回族自治州',
        center: '87.308995,44.011044',

        children: [
          {
            value: '652325',
            text: '奇台县',
            center: '89.593879,44.022001',
          },
          {
            value: '652324',
            text: '玛纳斯县',
            center: '86.20488,44.284601',
          },
          {
            value: '652323',
            text: '呼图壁县',
            center: '86.871532,44.179362',
          },
          {
            value: '652328',
            text: '木垒哈萨克自治县',
            center: '90.286013,43.834631',
          },
          {
            value: '652302',
            text: '阜康市',
            center: '87.953826,44.164525',
          },
          {
            value: '652327',
            text: '吉木萨尔县',
            center: '89.179698,44.000404',
          },
          {
            value: '652301',
            text: '昌吉市',
            center: '87.267432,44.014468',
          },
        ],
      },
      {
        value: '652800',
        text: '巴音郭楞蒙古自治州',
        center: '86.145298,41.764115',

        children: [
          {
            value: '652827',
            text: '和静县',
            center: '86.384065,42.323625',
          },
          {
            value: '652828',
            text: '和硕县',
            center: '86.877688,42.28361',
          },
          {
            value: '652826',
            text: '焉耆回族自治县',
            center: '86.57434,42.059509',
          },
          {
            value: '652829',
            text: '博湖县',
            center: '86.632116,41.980745',
          },
          {
            value: '652824',
            text: '若羌县',
            center: '88.167226,39.022626',
          },
          {
            value: '652825',
            text: '且末县',
            center: '85.529619,38.145749',
          },
          {
            value: '652801',
            text: '库尔勒市',
            center: '86.174633,41.725891',
          },
          {
            value: '652822',
            text: '轮台县',
            center: '84.251508,41.778043',
          },
          {
            value: '652823',
            text: '尉犁县',
            center: '86.261613,41.343871',
          },
        ],
      },
      {
        value: '654000',
        text: '伊犁哈萨克自治州',
        center: '81.323691,43.917106',

        children: [
          {
            value: '654021',
            text: '伊宁县',
            center: '81.52745,43.977119',
          },
          {
            value: '654028',
            text: '尼勒克县',
            center: '82.511884,43.798627',
          },
          {
            value: '654024',
            text: '巩留县',
            center: '82.231219,43.48313',
          },
          {
            value: '654025',
            text: '新源县',
            center: '83.233002,43.434803',
          },
          {
            value: '654027',
            text: '特克斯县',
            center: '81.835732,43.218435',
          },
          {
            value: '654026',
            text: '昭苏县',
            center: '81.130974,43.157293',
          },
          {
            value: '654023',
            text: '霍城县',
            center: '80.878845,44.056329',
          },
          {
            value: '654022',
            text: '察布查尔锡伯自治县',
            center: '81.151337,43.840726',
          },
          {
            value: '654004',
            text: '霍尔果斯市',
            center: '80.414614,44.218381',
          },
          {
            value: '654002',
            text: '伊宁市',
            center: '81.277715,43.908021',
          },
          {
            value: '654003',
            text: '奎屯市',
            center: '84.903216,44.426452',
          },
        ],
      },
      {
        value: '659002',
        text: '阿拉尔市',
        center: '81.280532,40.547205',

        children: [
          {
            value: '659002',
            text: '玛滩镇',
            center: '80.654296,40.656858',
          },
          {
            value: '659002',
            text: '花桥镇',
            center: '81.561898,40.627686',
          },
          {
            value: '659002',
            text: '沙河镇',
            center: '80.734788,41.289273',
          },
          {
            value: '659002',
            text: '青松路街道',
            center: '81.254474,40.542004',
          },
          {
            value: '659002',
            text: '托喀依乡',
            center: '81.354140,40.581819',
          },
          {
            value: '659002',
            text: '塔门镇',
            center: '80.799573,40.597311',
          },
          {
            value: '659002',
            text: '南口街道',
            center: '81.298804,40.515367',
          },
          {
            value: '659002',
            text: '金杨镇',
            center: '81.873439,40.928322',
          },
          {
            value: '659002',
            text: '双城镇',
            center: '80.404393,41.039323',
          },
          {
            value: '659002',
            text: '新井子镇',
            center: '80.027429,40.565638',
          },
          {
            value: '659002',
            text: '兵团农一师沙井子水利管理处',
            center: '79.726734,40.436977',
          },
          {
            value: '659002',
            text: '金银川镇',
            center: '80.086552,40.691135',
          },
          {
            value: '659002',
            text: '甘泉镇',
            center: '79.814651,40.477280',
          },
          {
            value: '659002',
            text: '金银川路街道',
            center: '81.262521,40.536818',
          },
          {
            value: '659002',
            text: '新开岭镇',
            center: '80.616820,40.429603',
          },
          {
            value: '659002',
            text: '幸福镇',
            center: '81.665359,40.707751',
          },
          {
            value: '659002',
            text: '昌安镇',
            center: '81.281049,40.575570',
          },
          {
            value: '659002',
            text: '幸福路街道',
            center: '81.270919,40.577037',
          },
          {
            value: '659002',
            text: '塔南镇',
            center: '81.360828,40.548449',
          },
        ],
      },
      {
        value: '653100',
        text: '喀什地区',
        center: '75.989746,39.470492',

        children: [
          {
            value: '653122',
            text: '疏勒县',
            center: '76.047169,39.401173',
          },
          {
            value: '653129',
            text: '伽师县',
            center: '76.723719,39.488181',
          },
          {
            value: '653127',
            text: '麦盖提县',
            center: '77.609099,38.898986',
          },
          {
            value: '653125',
            text: '莎车县',
            center: '77.223197,38.390881',
          },
          {
            value: '653131',
            text: '塔什库尔干塔吉克自治县',
            center: '75.229889,37.772094',
          },
          {
            value: '653126',
            text: '叶城县',
            center: '77.413669,37.882994',
          },
          {
            value: '653124',
            text: '泽普县',
            center: '77.260375,38.184639',
          },
          {
            value: '653130',
            text: '巴楚县',
            center: '78.54799,39.79923',
          },
          {
            value: '653123',
            text: '英吉沙县',
            center: '76.175729,38.930381',
          },
          {
            value: '653128',
            text: '岳普湖县',
            center: '76.821269,39.219857',
          },
          {
            value: '653121',
            text: '疏附县',
            center: '75.862839,39.375052',
          },
          {
            value: '653101',
            text: '喀什市',
            center: '75.993936,39.46823',
          },
        ],
      },
      {
        value: '653000',
        text: '克孜勒苏柯尔克孜自治州',
        center: '76.167327,39.714734',

        children: [
          {
            value: '653001',
            text: '阿图什市',
            center: '76.167538,39.716586',
          },
          {
            value: '653024',
            text: '乌恰县',
            center: '75.259228,39.7205',
          },
          {
            value: '653023',
            text: '阿合奇县',
            center: '78.402073,40.937581',
          },
          {
            value: '653022',
            text: '阿克陶县',
            center: '75.947396,39.147785',
          },
        ],
      },
      {
        value: '650200',
        text: '克拉玛依市',
        center: '84.889239,45.577712',

        children: [
          {
            value: '650205',
            text: '乌尔禾区',
            center: '85.692518,46.085819',
          },
          {
            value: '650202',
            text: '独山子区',
            center: '84.886973,44.328096',
          },
          {
            value: '650204',
            text: '白碱滩区',
            center: '85.119047,45.685416',
          },
          {
            value: '650203',
            text: '克拉玛依区',
            center: '84.867862,45.602347',
          },
        ],
      },
      {
        value: '650400',
        text: '吐鲁番市',
        center: '89.190374,42.950736',

        children: [
          {
            value: '650402',
            text: '高昌区',
            center: '89.185891,42.942728',
          },
          {
            value: '650421',
            text: '鄯善县',
            center: '90.242843,42.900575',
          },
          {
            value: '650422',
            text: '托克逊县',
            center: '88.643739,42.802585',
          },
        ],
      },
      {
        value: '650500',
        text: '哈密市',
        center: '93.515053,42.819346',

        children: [
          {
            value: '650521',
            text: '巴里坤哈萨克自治县',
            center: '93.016563,43.598756',
          },
          {
            value: '650522',
            text: '伊吾县',
            center: '94.697074,43.254978',
          },
          {
            value: '650502',
            text: '伊州区',
            center: '93.515085,42.827376',
          },
        ],
      },
      {
        value: '659011',
        text: '新星市',
        center: '93.74831,42.797043',

        children: [
          {
            value: '659011',
            text: '兵团红星四场',
            center: '94.068557,42.529865',
          },
          {
            value: '659011',
            text: '兵团黄田农场',
            center: '93.719461,42.567696',
          },
          {
            value: '659011',
            text: '兵团红星一场',
            center: '93.645240,42.686620',
          },
        ],
      },
      {
        value: '659003',
        text: '图木舒克市',
        center: '79.074965,39.867776',

        children: [
          {
            value: '659003',
            text: '海安镇',
            center: '78.756041,39.822379',
          },
          {
            value: '659003',
            text: '唐驿镇',
            center: '79.290232,39.988845',
          },
          {
            value: '659003',
            text: '前海街道',
            center: '79.077771,39.855038',
          },
          {
            value: '659003',
            text: '喀拉拜勒镇',
            center: '79.011211,39.852615',
          },
          {
            value: '659003',
            text: '齐干却勒街道',
            center: '79.090585,39.875314',
          },
          {
            value: '659003',
            text: '金胡杨镇',
            center: '79.321433,40.031839',
          },
          {
            value: '659003',
            text: '夏河镇',
            center: '79.231481,39.954869',
          },
          {
            value: '659003',
            text: '永安镇',
            center: '79.192620,39.916764',
          },
          {
            value: '659003',
            text: '永安坝街道',
            center: '79.025712,39.850697',
          },
        ],
      },
      {
        value: '652900',
        text: '阿克苏地区',
        center: '80.265068,41.170712',

        children: [
          {
            value: '652926',
            text: '拜城县',
            center: '81.851289,41.795289',
          },
          {
            value: '652902',
            text: '库车市',
            center: '82.998544,41.719073',
          },
          {
            value: '652925',
            text: '新和县',
            center: '82.620371,41.552097',
          },
          {
            value: '652924',
            text: '沙雅县',
            center: '82.781774,41.221413',
          },
          {
            value: '652901',
            text: '阿克苏市',
            center: '80.263387,41.16755',
          },
          {
            value: '652927',
            text: '乌什县',
            center: '79.22118,41.222706',
          },
          {
            value: '652928',
            text: '阿瓦提县',
            center: '80.375053,40.643647',
          },
          {
            value: '652929',
            text: '柯坪县',
            center: '79.054019,40.501645',
          },
          {
            value: '652922',
            text: '温宿县',
            center: '80.243273,41.272995',
          },
        ],
      },
      {
        value: '650100',
        text: '乌鲁木齐市',
        center: '87.616824,43.825377',

        children: [
          {
            value: '650107',
            text: '达坂城区',
            center: '88.311099,43.363668',
          },
          {
            value: '650102',
            text: '天山区',
            center: '87.631986,43.794312',
          },
          {
            value: '650105',
            text: '水磨沟区',
            center: '87.64208,43.832714',
          },
          {
            value: '650109',
            text: '米东区',
            center: '87.655122,43.97444',
          },
          {
            value: '650121',
            text: '乌鲁木齐县',
            center: '87.464257,43.509016',
          },
          {
            value: '650103',
            text: '沙依巴克区',
            center: '87.598043,43.800994',
          },
          {
            value: '650106',
            text: '头屯河区',
            center: '87.42582303,43.87605225',
          },
          {
            value: '650104',
            text: '新市区',
            center: '87.592684,43.893023',
          },
        ],
      },
      {
        value: '659010',
        text: '胡杨河市',
        center: '84.827592,44.692894',

        children: [
          {
            value: '659010',
            text: '兵团一三零团',
            center: '84.642314,44.754040',
          },
          {
            value: '659010',
            text: '兵团一二九团',
            center: '84.733352,44.711517',
          },
        ],
      },
      {
        value: '659004',
        text: '五家渠市',
        center: '87.542852,44.166489',

        children: [
          {
            value: '659004',
            text: '梧桐镇',
            center: '87.592476,44.269442',
          },
          {
            value: '659004',
            text: '人民路街道',
            center: '87.572823,44.182157',
          },
          {
            value: '659004',
            text: '兵团一零一团',
            center: '87.556234,44.175160',
          },
          {
            value: '659004',
            text: '蔡家湖镇',
            center: '87.407474,44.531659',
          },
          {
            value: '659004',
            text: '青湖路街道',
            center: '87.524481,44.176392',
          },
          {
            value: '659004',
            text: '军垦路街道',
            center: '87.508160,44.188534',
          },
        ],
      },
    ],
  },
  {
    value: '420000',
    text: '湖北省',
    center: '114.341552,30.546222',

    children: [
      {
        value: '420600',
        text: '襄阳市',
        center: '112.121743,32.010161',

        children: [
          {
            value: '420625',
            text: '谷城县',
            center: '111.653077,32.26339',
          },
          {
            value: '420683',
            text: '枣阳市',
            center: '112.772723,32.128968',
          },
          {
            value: '420684',
            text: '宜城市',
            center: '112.256486,31.720278',
          },
          {
            value: '420626',
            text: '保康县',
            center: '111.261308,31.87831',
          },
          {
            value: '420624',
            text: '南漳县',
            center: '111.838997,31.774649',
          },
          {
            value: '420607',
            text: '襄州区',
            center: '112.211365,32.088651',
          },
          {
            value: '420602',
            text: '襄城区',
            center: '112.134025,32.009932',
          },
          {
            value: '420606',
            text: '樊城区',
            center: '112.135241,32.045065',
          },
          {
            value: '420682',
            text: '老河口市',
            center: '111.683861,32.359068',
          },
        ],
      },
      {
        value: '420300',
        text: '十堰市',
        center: '110.798921,32.629057',

        children: [
          {
            value: '420304',
            text: '郧阳区',
            center: '110.812101,32.834847',
          },
          {
            value: '420303',
            text: '张湾区',
            center: '110.769132,32.652297',
          },
          {
            value: '420302',
            text: '茅箭区',
            center: '110.813478,32.591847',
          },
          {
            value: '420324',
            text: '竹溪县',
            center: '109.715322,32.318257',
          },
          {
            value: '420325',
            text: '房县',
            center: '110.726754,32.04017',
          },
          {
            value: '420323',
            text: '竹山县',
            center: '110.229696,32.225039',
          },
          {
            value: '420322',
            text: '郧西县',
            center: '110.426005,32.993095',
          },
          {
            value: '420381',
            text: '丹江口市',
            center: '111.513318,32.540287',
          },
        ],
      },
      {
        value: '420500',
        text: '宜昌市',
        center: '111.286962,30.69217',

        children: [
          {
            value: '420526',
            text: '兴山县',
            center: '110.746831,31.348065',
          },
          {
            value: '420527',
            text: '秭归县',
            center: '110.97793,30.825882',
          },
          {
            value: '420504',
            text: '点军区',
            center: '111.268338,30.69343',
          },
          {
            value: '420582',
            text: '当阳市',
            center: '111.78836,30.820893',
          },
          {
            value: '420581',
            text: '宜都市',
            center: '111.450128,30.378444',
          },
          {
            value: '420525',
            text: '远安县',
            center: '111.640329,31.060904',
          },
          {
            value: '420503',
            text: '伍家岗区',
            center: '111.360882,30.644048',
          },
          {
            value: '420505',
            text: '猇亭区',
            center: '111.434378,30.531133',
          },
          {
            value: '420583',
            text: '枝江市',
            center: '111.760616,30.425758',
          },
          {
            value: '420529',
            text: '五峰土家族自治县',
            center: '111.07374,30.156741',
          },
          {
            value: '420506',
            text: '夷陵区',
            center: '111.326371,30.769875',
          },
          {
            value: '420502',
            text: '西陵区',
            center: '111.285696,30.710765',
          },
          {
            value: '420528',
            text: '长阳土家族自治县',
            center: '111.20697,30.473038',
          },
        ],
      },
      {
        value: '420100',
        text: '武汉市',
        center: '114.304569,30.593354',

        children: [
          {
            value: '420116',
            text: '黄陂区',
            center: '114.375698,30.882305',
          },
          {
            value: '420117',
            text: '新洲区',
            center: '114.801284,30.841304',
          },
          {
            value: '420114',
            text: '蔡甸区',
            center: '114.087279,30.536395',
          },
          {
            value: '420113',
            text: '汉南区',
            center: '114.084582,30.308776',
          },
          {
            value: '420115',
            text: '江夏区',
            center: '114.320884,30.37558',
          },
          {
            value: '420106',
            text: '武昌区',
            center: '114.316464,30.55418',
          },
          {
            value: '420102',
            text: '江岸区',
            center: '114.309317,30.600008',
          },
          {
            value: '420112',
            text: '东西湖区',
            center: '114.136295,30.620079',
          },
          {
            value: '420107',
            text: '青山区',
            center: '114.385424,30.639842',
          },
          {
            value: '420111',
            text: '洪山区',
            center: '114.342664,30.500642',
          },
          {
            value: '420105',
            text: '汉阳区',
            center: '114.21859,30.554287',
          },
          {
            value: '420103',
            text: '江汉区',
            center: '114.270763,30.601129',
          },
          {
            value: '420104',
            text: '硚口区',
            center: '114.214746,30.582559',
          },
        ],
      },
      {
        value: '421100',
        text: '黄冈市',
        center: '114.872425,30.453722',

        children: [
          {
            value: '421181',
            text: '麻城市',
            center: '115.008011,31.172917',
          },
          {
            value: '421102',
            text: '黄州区',
            center: '114.880104,30.434354',
          },
          {
            value: '421124',
            text: '英山县',
            center: '115.680953,30.734989',
          },
          {
            value: '421121',
            text: '团风县',
            center: '114.872364,30.643225',
          },
          {
            value: '421126',
            text: '蕲春县',
            center: '115.436423,30.226146',
          },
          {
            value: '421123',
            text: '罗田县',
            center: '115.399149,30.783047',
          },
          {
            value: '421182',
            text: '武穴市',
            center: '115.595451,29.869602',
          },
          {
            value: '421127',
            text: '黄梅县',
            center: '115.944219,30.070453',
          },
          {
            value: '421122',
            text: '红安县',
            center: '114.618134,31.288167',
          },
          {
            value: '421125',
            text: '浠水县',
            center: '115.265155,30.452212',
          },
        ],
      },
      {
        value: '429006',
        text: '天门市',
        center: '113.166545,30.663706',

        children: [
          {
            value: '429006',
            text: '胡市镇',
            center: '113.422187,30.802027',
          },
          {
            value: '429006',
            text: '黄潭镇',
            center: '113.038506,30.692160',
          },
          {
            value: '429006',
            text: '多祥镇',
            center: '113.357891,30.423413',
          },
          {
            value: '429006',
            text: '沉湖管委会',
            center: '113.398615,30.458799',
          },
          {
            value: '429006',
            text: '干驿镇',
            center: '113.450967,30.502984',
          },
          {
            value: '429006',
            text: '横林镇',
            center: '113.214590,30.564294',
          },
          {
            value: '429006',
            text: '马湾镇',
            center: '113.312283,30.599323',
          },
          {
            value: '429006',
            text: '蒋湖农场',
            center: '112.779827,30.630562',
          },
          {
            value: '429006',
            text: '小板镇',
            center: '113.263987,30.615139',
          },
          {
            value: '429006',
            text: '岳口镇',
            center: '113.105000,30.586764',
          },
          {
            value: '429006',
            text: '蒋场镇',
            center: '112.927266,30.646031',
          },
          {
            value: '429006',
            text: '石家河镇',
            center: '113.076431,30.821122',
          },
          {
            value: '429006',
            text: '彭市镇',
            center: '113.157308,30.431522',
          },
          {
            value: '429006',
            text: '佛子山镇',
            center: '113.067782,30.689228',
          },
          {
            value: '429006',
            text: '九真镇',
            center: '113.206379,30.824523',
          },
          {
            value: '429006',
            text: '竟陵街道',
            center: '113.182938,30.706618',
          },
          {
            value: '429006',
            text: '侯口街道',
            center: '113.133899,30.652014',
          },
          {
            value: '429006',
            text: '麻洋镇',
            center: '113.309397,30.524900',
          },
          {
            value: '429006',
            text: '杨林街道',
            center: '113.265467,30.685636',
          },
          {
            value: '429006',
            text: '汪场镇',
            center: '112.978692,30.638003',
          },
          {
            value: '429006',
            text: '白茅湖农场',
            center: '113.063412,30.586804',
          },
          {
            value: '429006',
            text: '皂市镇',
            center: '113.223245,30.795738',
          },
          {
            value: '429006',
            text: '拖市镇',
            center: '112.841174,30.729303',
          },
          {
            value: '429006',
            text: '净潭乡',
            center: '113.450669,30.646405',
          },
          {
            value: '429006',
            text: '卢市镇',
            center: '113.396655,30.659558',
          },
          {
            value: '429006',
            text: '多宝镇',
            center: '112.705302,30.627076',
          },
          {
            value: '429006',
            text: '张港镇',
            center: '112.911875,30.578584',
          },
          {
            value: '429006',
            text: '渔薪镇',
            center: '112.889649,30.668912',
          },
        ],
      },
      {
        value: '420900',
        text: '孝感市',
        center: '113.956962,30.918311',

        children: [
          {
            value: '420923',
            text: '云梦县',
            center: '113.752958,31.021736',
          },
          {
            value: '420981',
            text: '应城市',
            center: '113.571864,30.928592',
          },
          {
            value: '420902',
            text: '孝南区',
            center: '113.910769,30.91695',
          },
          {
            value: '420984',
            text: '汉川市',
            center: '113.838068,30.673219',
          },
          {
            value: '420982',
            text: '安陆市',
            center: '113.688955,31.25565',
          },
          {
            value: '420922',
            text: '大悟县',
            center: '114.127122,31.561179',
          },
          {
            value: '420921',
            text: '孝昌县',
            center: '113.997794,31.258225',
          },
        ],
      },
      {
        value: '420800',
        text: '荆门市',
        center: '112.199009,31.035445',

        children: [
          {
            value: '420882',
            text: '京山市',
            center: '113.119561,31.018414',
          },
          {
            value: '420822',
            text: '沙洋县',
            center: '112.588675,30.709167',
          },
          {
            value: '420804',
            text: '掇刀区',
            center: '112.2079,30.973397',
          },
          {
            value: '420802',
            text: '东宝区',
            center: '112.201657,31.05187',
          },
          {
            value: '420881',
            text: '钟祥市',
            center: '112.588032,31.167933',
          },
        ],
      },
      {
        value: '429005',
        text: '潜江市',
        center: '112.900279,30.401954',

        children: [
          {
            value: '429005',
            text: '泰丰街道',
            center: '112.980898,30.416671',
          },
          {
            value: '429005',
            text: '广华寺街道',
            center: '112.666286,30.463319',
          },
          {
            value: '429005',
            text: '周矶管理区',
            center: '112.785657,30.463577',
          },
          {
            value: '429005',
            text: '高场街道',
            center: '112.774574,30.407577',
          },
          {
            value: '429005',
            text: '总口管理区',
            center: '112.890449,30.258095',
          },
          {
            value: '429005',
            text: '运粮湖管理区',
            center: '112.581820,30.252044',
          },
          {
            value: '429005',
            text: '王场镇',
            center: '112.818521,30.490597',
          },
          {
            value: '429005',
            text: '园林街道',
            center: '112.910007,30.376965',
          },
          {
            value: '429005',
            text: '白鹭湖管理区',
            center: '112.715593,30.178757',
          },
          {
            value: '429005',
            text: '竹根滩镇',
            center: '112.979245,30.471601',
          },
          {
            value: '429005',
            text: '渔洋镇',
            center: '112.966486,30.239237',
          },
          {
            value: '429005',
            text: '熊口镇',
            center: '112.724425,30.340363',
          },
          {
            value: '429005',
            text: '熊口管理区',
            center: '112.806208,30.256835',
          },
          {
            value: '429005',
            text: '后湖管理区',
            center: '112.767709,30.404874',
          },
          {
            value: '429005',
            text: '张金镇',
            center: '112.577250,30.238919',
          },
          {
            value: '429005',
            text: '杨市街道',
            center: '112.914959,30.383464',
          },
          {
            value: '429005',
            text: '周矶街道',
            center: '112.781398,30.391044',
          },
          {
            value: '429005',
            text: '高石碑镇',
            center: '112.625570,30.620340',
          },
          {
            value: '429005',
            text: '积玉口镇',
            center: '112.634123,30.398499',
          },
          {
            value: '429005',
            text: '泽口街道',
            center: '112.915656,30.488160',
          },
          {
            value: '429005',
            text: '浩口镇',
            center: '112.566899,30.307792',
          },
          {
            value: '429005',
            text: '老新镇',
            center: '112.887009,30.215033',
          },
          {
            value: '429005',
            text: '龙湾镇',
            center: '112.780855,30.253634',
          },
        ],
      },
      {
        value: '422800',
        text: '恩施土家族苗族自治州',
        center: '109.488076,30.272104',

        children: [
          {
            value: '422822',
            text: '建始县',
            center: '109.722333,30.602195',
          },
          {
            value: '422801',
            text: '恩施市',
            center: '109.479572,30.295148',
          },
          {
            value: '422802',
            text: '利川市',
            center: '108.936456,30.290974',
          },
          {
            value: '422825',
            text: '宣恩县',
            center: '109.489918,29.986856',
          },
          {
            value: '422826',
            text: '咸丰县',
            center: '109.140163,29.665215',
          },
          {
            value: '422827',
            text: '来凤县',
            center: '109.407697,29.493474',
          },
          {
            value: '422828',
            text: '鹤峰县',
            center: '110.034011,29.890073',
          },
          {
            value: '422823',
            text: '巴东县',
            center: '110.340921,31.042854',
          },
        ],
      },
      {
        value: '429004',
        text: '仙桃市',
        center: '113.442973,30.328407',

        children: [
          {
            value: '429004',
            text: '通海口镇',
            center: '113.205730,30.272193',
          },
          {
            value: '429004',
            text: '胡场镇',
            center: '113.290392,30.427800',
          },
          {
            value: '429004',
            text: '干河街道',
            center: '113.451023,30.375391',
          },
          {
            value: '429004',
            text: '杨林尾镇',
            center: '113.561091,30.201430',
          },
          {
            value: '429004',
            text: '彭场镇',
            center: '113.445865,30.251787',
          },
          {
            value: '429004',
            text: '沔城回族镇',
            center: '113.200597,30.192111',
          },
          {
            value: '429004',
            text: '龙华山街道',
            center: '113.460323,30.364932',
          },
          {
            value: '429004',
            text: '沙湖原种场',
            center: '113.642513,30.148174',
          },
          {
            value: '429004',
            text: '郑场镇',
            center: '112.978652,30.470679',
          },
          {
            value: '429004',
            text: '沙嘴街道',
            center: '113.441389,30.359636',
          },
          {
            value: '429004',
            text: '郭河镇',
            center: '113.303624,30.302698',
          },
          {
            value: '429004',
            text: '排湖风景区',
            center: '113.223499,30.298659',
          },
          {
            value: '429004',
            text: '毛嘴镇',
            center: '113.045359,30.418813',
          },
          {
            value: '429004',
            text: '张沟镇',
            center: '113.438252,30.296766',
          },
          {
            value: '429004',
            text: '三伏潭镇',
            center: '113.206929,30.339491',
          },
          {
            value: '429004',
            text: '五湖渔场',
            center: '113.768784,30.187345',
          },
          {
            value: '429004',
            text: '西流河镇',
            center: '113.762133,30.296361',
          },
          {
            value: '429004',
            text: '长埫口镇',
            center: '113.744972,30.356683',
          },
          {
            value: '429004',
            text: '杜湖街道',
            center: '113.364736,30.306324',
          },
          {
            value: '429004',
            text: '剅河镇',
            center: '112.987670,30.375691',
          },
          {
            value: '429004',
            text: '沙湖镇',
            center: '113.719820,30.118003',
          },
          {
            value: '429004',
            text: '陈场镇',
            center: '113.059900,30.294262',
          },
        ],
      },
      {
        value: '421000',
        text: '荆州市',
        center: '112.24143,30.336282',

        children: [
          {
            value: '421024',
            text: '江陵县',
            center: '112.424581,30.042227',
          },
          {
            value: '421083',
            text: '洪湖市',
            center: '113.475984,29.827256',
          },
          {
            value: '421088',
            text: '监利市',
            center: '112.904634,29.840229',
          },
          {
            value: '421087',
            text: '松滋市',
            center: '111.756455,30.174717',
          },
          {
            value: '421022',
            text: '公安县',
            center: '112.229742,30.058519',
          },
          {
            value: '421003',
            text: '荆州区',
            center: '112.190282,30.352984',
          },
          {
            value: '421002',
            text: '沙市区',
            center: '112.251975,30.326693',
          },
          {
            value: '421081',
            text: '石首市',
            center: '112.42538,29.720944',
          },
        ],
      },
      {
        value: '421200',
        text: '咸宁市',
        center: '114.322601,29.84135',

        children: [
          {
            value: '421221',
            text: '嘉鱼县',
            center: '113.939249,29.970575',
          },
          {
            value: '421281',
            text: '赤壁市',
            center: '113.900385,29.725122',
          },
          {
            value: '421224',
            text: '通山县',
            center: '114.482832,29.606468',
          },
          {
            value: '421202',
            text: '咸安区',
            center: '114.299002,29.852726',
          },
          {
            value: '421222',
            text: '通城县',
            center: '113.816811,29.2454',
          },
          {
            value: '421223',
            text: '崇阳县',
            center: '114.039484,29.556866',
          },
        ],
      },
      {
        value: '429021',
        text: '神农架林区',
        center: '110.675879,31.745103',

        children: [
          {
            value: '429021',
            text: '木鱼镇',
            center: '110.566502,31.366101',
          },
          {
            value: '429021',
            text: '新华镇',
            center: '110.842423,31.621763',
          },
          {
            value: '429021',
            text: '宋洛乡',
            center: '110.589789,31.730290',
          },
          {
            value: '429021',
            text: '松柏镇',
            center: '110.609207,31.704132',
          },
          {
            value: '429021',
            text: '红坪镇',
            center: '110.196111,31.471819',
          },
          {
            value: '429021',
            text: '阳日镇',
            center: '110.763336,31.676979',
          },
          {
            value: '429021',
            text: '大九湖镇',
            center: '110.106251,31.408207',
          },
          {
            value: '429021',
            text: '下谷坪土家族乡',
            center: '110.124191,31.394918',
          },
        ],
      },
      {
        value: '421300',
        text: '随州市',
        center: '113.382324,31.690275',

        children: [
          {
            value: '421321',
            text: '随县',
            center: '113.29097,31.883233',
          },
          {
            value: '421303',
            text: '曾都区',
            center: '113.371052,31.716423',
          },
          {
            value: '421381',
            text: '广水市',
            center: '113.825977,31.617015',
          },
        ],
      },
      {
        value: '420200',
        text: '黄石市',
        center: '115.038999,30.201082',

        children: [
          {
            value: '420203',
            text: '西塞山区',
            center: '115.110067,30.205114',
          },
          {
            value: '420204',
            text: '下陆区',
            center: '114.960914,30.174148',
          },
          {
            value: '420205',
            text: '铁山区',
            center: '114.891603,30.203152',
          },
          {
            value: '420202',
            text: '黄石港区',
            center: '115.065653,30.223194',
          },
          {
            value: '420222',
            text: '阳新县',
            center: '115.215211,29.830236',
          },
          {
            value: '420281',
            text: '大冶市',
            center: '114.98046,30.096263',
          },
        ],
      },
      {
        value: '420700',
        text: '鄂州市',
        center: '114.894909,30.391461',

        children: [
          {
            value: '420703',
            text: '华容区',
            center: '114.729945,30.53515',
          },
          {
            value: '420702',
            text: '梁子湖区',
            center: '114.684805,30.100146',
          },
          {
            value: '420704',
            text: '鄂城区',
            center: '114.89157,30.400535',
          },
        ],
      },
    ],
  },
  {
    value: '210000',
    text: '辽宁省',
    center: '123.435093,41.836743',

    children: [
      {
        value: '211400',
        text: '葫芦岛市',
        center: '120.836783,40.710974',

        children: [
          {
            value: '211422',
            text: '建昌县',
            center: '119.836669,40.824484',
          },
          {
            value: '211403',
            text: '龙港区',
            center: '120.894054,40.735717',
          },
          {
            value: '211481',
            text: '兴城市',
            center: '120.756661,40.60999',
          },
          {
            value: '211421',
            text: '绥中县',
            center: '120.34432,40.325576',
          },
          {
            value: '211404',
            text: '南票区',
            center: '120.74971,41.10721',
          },
          {
            value: '211402',
            text: '连山区',
            center: '120.869157,40.774784',
          },
        ],
      },
      {
        value: '210200',
        text: '大连市',
        center: '121.614786,38.913962',

        children: [
          {
            value: '210281',
            text: '瓦房店市',
            center: '121.979463,39.62701',
          },
          {
            value: '210283',
            text: '庄河市',
            center: '122.965881,39.680825',
          },
          {
            value: '210214',
            text: '普兰店区',
            center: '121.938299,39.391565',
          },
          {
            value: '210213',
            text: '金州区',
            center: '121.782513,39.050211',
          },
          {
            value: '210224',
            text: '长海县',
            center: '122.588487,39.272779',
          },
          {
            value: '210211',
            text: '甘井子区',
            center: '121.525469,38.952998',
          },
          {
            value: '210202',
            text: '中山区',
            center: '121.644996,38.918357',
          },
          {
            value: '210212',
            text: '旅顺口区',
            center: '121.261982,38.851742',
          },
          {
            value: '210204',
            text: '沙河口区',
            center: '121.594201,38.904771',
          },
          {
            value: '210203',
            text: '西岗区',
            center: '121.612461,38.914751',
          },
        ],
      },
      {
        value: '210600',
        text: '丹东市',
        center: '124.354419,40.000646',

        children: [
          {
            value: '210682',
            text: '凤城市',
            center: '124.066873,40.45218',
          },
          {
            value: '210604',
            text: '振安区',
            center: '124.470005,40.20154',
          },
          {
            value: '210681',
            text: '东港市',
            center: '124.152581,39.863193',
          },
          {
            value: '210603',
            text: '振兴区',
            center: '124.383382,40.129706',
          },
          {
            value: '210624',
            text: '宽甸满族自治县',
            center: '124.783674,40.731319',
          },
          {
            value: '210602',
            text: '元宝区',
            center: '124.395577,40.136549',
          },
        ],
      },
      {
        value: '210700',
        text: '锦州市',
        center: '121.126859,41.096114',

        children: [
          {
            value: '210781',
            text: '凌海市',
            center: '121.35499,41.160636',
          },
          {
            value: '210711',
            text: '太和区',
            center: '121.103445,41.109232',
          },
          {
            value: '210782',
            text: '北镇市',
            center: '121.777503,41.588657',
          },
          {
            value: '210702',
            text: '古塔区',
            center: '121.128414,41.117481',
          },
          {
            value: '210703',
            text: '凌河区',
            center: '121.151069,41.115058',
          },
          {
            value: '210726',
            text: '黑山县',
            center: '122.126645,41.653552',
          },
          {
            value: '210727',
            text: '义县',
            center: '121.239558,41.533553',
          },
        ],
      },
      {
        value: '210100',
        text: '沈阳市',
        center: '123.464675,41.677576',

        children: [
          {
            value: '210114',
            text: '于洪区',
            center: '123.308062,41.793925',
          },
          {
            value: '210123',
            text: '康平县',
            center: '123.343701,42.727249',
          },
          {
            value: '210106',
            text: '铁西区',
            center: '123.334781,41.821721',
          },
          {
            value: '210115',
            text: '辽中区',
            center: '122.766159,41.517449',
          },
          {
            value: '210113',
            text: '沈北新区',
            center: '123.584209,41.913071',
          },
          {
            value: '210105',
            text: '皇姑区',
            center: '123.441468,41.824574',
          },
          {
            value: '210102',
            text: '和平区',
            center: '123.420401,41.789766',
          },
          {
            value: '210181',
            text: '新民市',
            center: '122.835964,41.985757',
          },
          {
            value: '210124',
            text: '法库县',
            center: '123.440294,42.50108',
          },
          {
            value: '210112',
            text: '浑南区',
            center: '123.449597,41.714729',
          },
          {
            value: '210111',
            text: '苏家屯区',
            center: '123.343937,41.665153',
          },
          {
            value: '210103',
            text: '沈河区',
            center: '123.45884,41.795688',
          },
          {
            value: '210104',
            text: '大东区',
            center: '123.469828,41.805292',
          },
        ],
      },
      {
        value: '211200',
        text: '铁岭市',
        center: '123.726008,42.223709',

        children: [
          {
            value: '211282',
            text: '开原市',
            center: '124.051886,42.577645',
          },
          {
            value: '211204',
            text: '清河区',
            center: '124.159232,42.54714',
          },
          {
            value: '211281',
            text: '调兵山市',
            center: '123.567039,42.468007',
          },
          {
            value: '211221',
            text: '铁岭县',
            center: '123.728933,42.223395',
          },
          {
            value: '211202',
            text: '银州区',
            center: '123.842472,42.286575',
          },
          {
            value: '211223',
            text: '西丰县',
            center: '124.727491,42.738178',
          },
          {
            value: '211224',
            text: '昌图县',
            center: '124.086628,42.779333',
          },
        ],
      },
      {
        value: '210900',
        text: '阜新市',
        center: '121.670052,42.022028',

        children: [
          {
            value: '210904',
            text: '太平区',
            center: '121.678637,42.010689',
          },
          {
            value: '210905',
            text: '清河门区',
            center: '121.416105,41.7831',
          },
          {
            value: '210903',
            text: '新邱区',
            center: '121.792067,42.087549',
          },
          {
            value: '210921',
            text: '阜新蒙古族自治县',
            center: '121.757901,42.065175',
          },
          {
            value: '210922',
            text: '彰武县',
            center: '122.538563,42.386264',
          },
          {
            value: '210902',
            text: '海州区',
            center: '121.662594,42.017794',
          },
          {
            value: '210911',
            text: '细河区',
            center: '121.680157,42.025412',
          },
        ],
      },
      {
        value: '210500',
        text: '本溪市',
        center: '123.684984,41.486834',

        children: [
          {
            value: '210522',
            text: '桓仁满族自治县',
            center: '125.361061,41.267048',
          },
          {
            value: '210505',
            text: '南芬区',
            center: '123.744822,41.100273',
          },
          {
            value: '210504',
            text: '明山区',
            center: '123.861747,41.343624',
          },
          {
            value: '210521',
            text: '本溪满族自治县',
            center: '124.119545,41.301553',
          },
          {
            value: '210503',
            text: '溪湖区',
            center: '123.767817,41.32931',
          },
          {
            value: '210502',
            text: '平山区',
            center: '123.769081,41.299658',
          },
        ],
      },
      {
        value: '211000',
        text: '辽阳市',
        center: '123.239669,41.267396',

        children: [
          {
            value: '211003',
            text: '文圣区',
            center: '123.231262,41.282378',
          },
          {
            value: '211011',
            text: '太子河区',
            center: '123.1814403,41.29502257',
          },
          {
            value: '211005',
            text: '弓长岭区',
            center: '123.419567,41.151787',
          },
          {
            value: '211081',
            text: '灯塔市',
            center: '123.339398,41.426537',
          },
          {
            value: '211021',
            text: '辽阳县',
            center: '123.106426,41.206246',
          },
          {
            value: '211002',
            text: '白塔区',
            center: '123.174347,41.270397',
          },
          {
            value: '211004',
            text: '宏伟区',
            center: '123.196725,41.217852',
          },
        ],
      },
      {
        value: '210400',
        text: '抚顺市',
        center: '123.957053,41.881311',

        children: [
          {
            value: '210422',
            text: '新宾满族自治县',
            center: '125.039994,41.734031',
          },
          {
            value: '210402',
            text: '新抚区',
            center: '123.91293,41.861922',
          },
          {
            value: '210404',
            text: '望花区',
            center: '123.784235,41.853484',
          },
          {
            value: '210421',
            text: '抚顺县',
            center: '123.8999229,41.73009376',
          },
          {
            value: '210403',
            text: '东洲区',
            center: '124.038491,41.853001',
          },
          {
            value: '210411',
            text: '顺城区',
            center: '123.94504,41.883375',
          },
          {
            value: '210423',
            text: '清原满族自治县',
            center: '124.924028,42.100804',
          },
        ],
      },
      {
        value: '210800',
        text: '营口市',
        center: '122.219148,40.625027',

        children: [
          {
            value: '210803',
            text: '西市区',
            center: '122.206431,40.666707',
          },
          {
            value: '210882',
            text: '大石桥市',
            center: '122.509006,40.644482',
          },
          {
            value: '210804',
            text: '鲅鱼圈区',
            center: '122.121764,40.226708',
          },
          {
            value: '210881',
            text: '盖州市',
            center: '122.34845,40.400259',
          },
          {
            value: '210802',
            text: '站前区',
            center: '122.259058,40.673063',
          },
          {
            value: '210811',
            text: '老边区',
            center: '122.307956,40.671279',
          },
        ],
      },
      {
        value: '211300',
        text: '朝阳市',
        center: '120.488801,41.601855',

        children: [
          {
            value: '211382',
            text: '凌源市',
            center: '119.401574,41.245445',
          },
          {
            value: '211324',
            text: '喀喇沁左翼蒙古族自治县',
            center: '119.741223,41.12815',
          },
          {
            value: '211381',
            text: '北票市',
            center: '120.771389,41.801117',
          },
          {
            value: '211303',
            text: '龙城区',
            center: '120.4133759,41.57674859',
          },
          {
            value: '211322',
            text: '建平县',
            center: '119.64328,41.402891',
          },
          {
            value: '211321',
            text: '朝阳县',
            center: '120.390001,41.497923',
          },
          {
            value: '211302',
            text: '双塔区',
            center: '120.453717,41.565814',
          },
        ],
      },
      {
        value: '210300',
        text: '鞍山市',
        center: '122.994183,41.108239',

        children: [
          {
            value: '210323',
            text: '岫岩满族自治县',
            center: '123.280933,40.290995',
          },
          {
            value: '210302',
            text: '铁东区',
            center: '122.990888,41.089578',
          },
          {
            value: '210311',
            text: '千山区',
            center: '122.9447506,41.0689014',
          },
          {
            value: '210303',
            text: '铁西区',
            center: '122.969531,41.119719',
          },
          {
            value: '210304',
            text: '立山区',
            center: '123.029091,41.150401',
          },
          {
            value: '210381',
            text: '海城市',
            center: '122.685176,40.882548',
          },
          {
            value: '210321',
            text: '台安县',
            center: '122.436037,41.412866',
          },
        ],
      },
      {
        value: '211100',
        text: '盘锦市',
        center: '122.170729,40.71956',

        children: [
          {
            value: '211122',
            text: '盘山县',
            center: '121.996408,41.243367',
          },
          {
            value: '211103',
            text: '兴隆台区',
            center: '122.070685,41.120261',
          },
          {
            value: '211102',
            text: '双台子区',
            center: '122.07597,41.212401',
          },
          {
            value: '211104',
            text: '大洼区',
            center: '122.082227,41.002679',
          },
        ],
      },
    ],
  },
  {
    value: '370000',
    text: '山东省',
    center: '117.020725,36.670201',

    children: [
      {
        value: '370300',
        text: '淄博市',
        center: '118.054994,36.813787',

        children: [
          {
            value: '370321',
            text: '桓台县',
            center: '118.097923,36.959794',
          },
          {
            value: '370303',
            text: '张店区',
            center: '118.017877,36.807011',
          },
          {
            value: '370322',
            text: '高青县',
            center: '117.826743,37.171042',
          },
          {
            value: '370305',
            text: '临淄区',
            center: '118.309398,36.826882',
          },
          {
            value: '370304',
            text: '博山区',
            center: '117.8627,36.495014',
          },
          {
            value: '370302',
            text: '淄川区',
            center: '117.966978,36.644211',
          },
          {
            value: '370323',
            text: '沂源县',
            center: '118.170856,36.185402',
          },
          {
            value: '370306',
            text: '周村区',
            center: '117.869686,36.80309',
          },
        ],
      },
      {
        value: '370500',
        text: '东营市',
        center: '118.674633,37.433992',

        children: [
          {
            value: '370522',
            text: '利津县',
            center: '118.255084,37.490919',
          },
          {
            value: '370523',
            text: '广饶县',
            center: '118.419437,37.053915',
          },
          {
            value: '370503',
            text: '河口区',
            center: '118.525519,37.886217',
          },
          {
            value: '370502',
            text: '东营区',
            center: '118.582182,37.449035',
          },
          {
            value: '370505',
            text: '垦利区',
            center: '118.575234,37.573412',
          },
        ],
      },
      {
        value: '371600',
        text: '滨州市',
        center: '117.970731,37.382687',

        children: [
          {
            value: '371602',
            text: '滨城区',
            center: '118.019567,37.431997',
          },
          {
            value: '371625',
            text: '博兴县',
            center: '118.110715,37.154529',
          },
          {
            value: '371603',
            text: '沾化区',
            center: '118.098962,37.698952',
          },
          {
            value: '371623',
            text: '无棣县',
            center: '117.625846,37.770579',
          },
          {
            value: '371621',
            text: '惠民县',
            center: '117.593744,37.47528',
          },
          {
            value: '371622',
            text: '阳信县',
            center: '117.603407,37.632773',
          },
          {
            value: '371681',
            text: '邹平市',
            center: '117.74313,36.863393',
          },
        ],
      },
      {
        value: '371000',
        text: '威海市',
        center: '122.120519,37.513315',

        children: [
          {
            value: '371082',
            text: '荣成市',
            center: '122.487036,37.165698',
          },
          {
            value: '371003',
            text: '文登区',
            center: '122.08832,37.196032',
          },
          {
            value: '371083',
            text: '乳山市',
            center: '121.539557,36.920329',
          },
          {
            value: '371002',
            text: '环翠区',
            center: '122.123115,37.501735',
          },
        ],
      },
      {
        value: '371500',
        text: '聊城市',
        center: '115.985238,36.455857',

        children: [
          {
            value: '371503',
            text: '茌平区',
            center: '116.254865,36.580814',
          },
          {
            value: '371526',
            text: '高唐县',
            center: '116.230126,36.84715',
          },
          {
            value: '371525',
            text: '冠县',
            center: '115.441684,36.484011',
          },
          {
            value: '371522',
            text: '莘县',
            center: '115.669843,36.233711',
          },
          {
            value: '371581',
            text: '临清市',
            center: '115.704982,36.83828',
          },
          {
            value: '371502',
            text: '东昌府区',
            center: '116.006399,36.412737',
          },
          {
            value: '371524',
            text: '东阿县',
            center: '116.247655,36.335198',
          },
          {
            value: '371521',
            text: '阳谷县',
            center: '115.791822,36.114392',
          },
        ],
      },
      {
        value: '371100',
        text: '日照市',
        center: '119.52685,35.416912',

        children: [
          {
            value: '371121',
            text: '五莲县',
            center: '119.213673,35.760154',
          },
          {
            value: '371102',
            text: '东港区',
            center: '119.462287,35.426037',
          },
          {
            value: '371122',
            text: '莒县',
            center: '118.869059,35.59125',
          },
          {
            value: '371103',
            text: '岚山区',
            center: '119.31881,35.121985',
          },
        ],
      },
      {
        value: '370700',
        text: '潍坊市',
        center: '119.161721,36.707668',

        children: [
          {
            value: '370702',
            text: '潍城区',
            center: '119.02491,36.728077',
          },
          {
            value: '370783',
            text: '寿光市',
            center: '118.791062,36.857133',
          },
          {
            value: '370782',
            text: '诸城市',
            center: '119.410051,35.996404',
          },
          {
            value: '370786',
            text: '昌邑市',
            center: '119.403185,36.843256',
          },
          {
            value: '370785',
            text: '高密市',
            center: '119.755271,36.382973',
          },
          {
            value: '370781',
            text: '青州市',
            center: '118.479637,36.685178',
          },
          {
            value: '370703',
            text: '寒亭区',
            center: '119.211251,36.755925',
          },
          {
            value: '370705',
            text: '奎文区',
            center: '119.132288,36.707459',
          },
          {
            value: '370784',
            text: '安丘市',
            center: '119.21892,36.479642',
          },
          {
            value: '370704',
            text: '坊子区',
            center: '119.166343,36.653671',
          },
          {
            value: '370725',
            text: '昌乐县',
            center: '118.841035,36.688035',
          },
          {
            value: '370724',
            text: '临朐县',
            center: '118.543274,36.51246',
          },
        ],
      },
      {
        value: '371700',
        text: '菏泽市',
        center: '115.479646,35.234309',

        children: [
          {
            value: '371724',
            text: '巨野县',
            center: '116.062585,35.388543',
          },
          {
            value: '371723',
            text: '成武县',
            center: '115.889775,34.95278',
          },
          {
            value: '371728',
            text: '东明县',
            center: '115.107402,35.275664',
          },
          {
            value: '371726',
            text: '鄄城县',
            center: '115.544507,35.534088',
          },
          {
            value: '371722',
            text: '单县',
            center: '116.106396,34.779282',
          },
          {
            value: '371725',
            text: '郓城县',
            center: '115.938939,35.575276',
          },
          {
            value: '371721',
            text: '曹县',
            center: '115.556393,34.85875',
          },
          {
            value: '371702',
            text: '牡丹区',
            center: '115.417021,35.251911',
          },
          {
            value: '371703',
            text: '定陶区',
            center: '115.583172,35.105742',
          },
        ],
      },
      {
        value: '370600',
        text: '烟台市',
        center: '121.447755,37.464551',

        children: [
          {
            value: '370683',
            text: '莱州市',
            center: '119.942057,37.178187',
          },
          {
            value: '370602',
            text: '芝罘区',
            center: '121.400303,37.541312',
          },
          {
            value: '370681',
            text: '龙口市',
            center: '120.47614,37.645281',
          },
          {
            value: '370614',
            text: '蓬莱区',
            center: '120.829141,37.795697',
          },
          {
            value: '370612',
            text: '牟平区',
            center: '121.601015,37.387454',
          },
          {
            value: '370613',
            text: '莱山区',
            center: '121.444949,37.511322',
          },
          {
            value: '370686',
            text: '栖霞市',
            center: '120.849595,37.335993',
          },
          {
            value: '370685',
            text: '招远市',
            center: '120.433904,37.354517',
          },
          {
            value: '370687',
            text: '海阳市',
            center: '121.173506,36.688316',
          },
          {
            value: '370682',
            text: '莱阳市',
            center: '120.711555,36.979757',
          },
          {
            value: '370611',
            text: '福山区',
            center: '121.267638,37.49833',
          },
        ],
      },
      {
        value: '370200',
        text: '青岛市',
        center: '120.382665,36.066938',

        children: [
          {
            value: '370285',
            text: '莱西市',
            center: '120.517581,36.889167',
          },
          {
            value: '370211',
            text: '黄岛区',
            center: '120.19777,35.960688',
          },
          {
            value: '370283',
            text: '平度市',
            center: '119.970192,36.753895',
          },
          {
            value: '370213',
            text: '李沧区',
            center: '120.432652,36.145987',
          },
          {
            value: '370214',
            text: '城阳区',
            center: '120.396255,36.307624',
          },
          {
            value: '370215',
            text: '即墨区',
            center: '120.447691,36.390217',
          },
          {
            value: '370212',
            text: '崂山区',
            center: '120.469282,36.107069',
          },
          {
            value: '370202',
            text: '市南区',
            center: '120.412002,36.075867',
          },
          {
            value: '370203',
            text: '市北区',
            center: '120.374675,36.08765',
          },
          {
            value: '370281',
            text: '胶州市',
            center: '120.033382,36.26468',
          },
        ],
      },
      {
        value: '370800',
        text: '济宁市',
        center: '116.587116,35.415117',

        children: [
          {
            value: '370826',
            text: '微山县',
            center: '117.129188,34.806657',
          },
          {
            value: '370827',
            text: '鱼台县',
            center: '116.650526,35.012706',
          },
          {
            value: '370832',
            text: '梁山县',
            center: '116.131779,35.765957',
          },
          {
            value: '370811',
            text: '任城区',
            center: '116.605763,35.444226',
          },
          {
            value: '370881',
            text: '曲阜市',
            center: '116.986212,35.581933',
          },
          {
            value: '370883',
            text: '邹城市',
            center: '117.007406,35.402536',
          },
          {
            value: '370828',
            text: '金乡县',
            center: '116.311549,35.06658',
          },
          {
            value: '370829',
            text: '嘉祥县',
            center: '116.342308,35.40794',
          },
          {
            value: '370831',
            text: '泗水县',
            center: '117.250824,35.664719',
          },
          {
            value: '370812',
            text: '兖州区',
            center: '116.78365,35.551938',
          },
          {
            value: '370830',
            text: '汶上县',
            center: '116.497277,35.711891',
          },
        ],
      },
      {
        value: '370400',
        text: '枣庄市',
        center: '117.323759,34.810858',

        children: [
          {
            value: '370405',
            text: '台儿庄区',
            center: '117.734287,34.563103',
          },
          {
            value: '370402',
            text: '市中区',
            center: '117.556125,34.863791',
          },
          {
            value: '370404',
            text: '峄城区',
            center: '117.590738,34.772931',
          },
          {
            value: '370406',
            text: '山亭区',
            center: '117.461866,35.099638',
          },
          {
            value: '370403',
            text: '薛城区',
            center: '117.286371,34.783282',
          },
          {
            value: '370481',
            text: '滕州市',
            center: '117.165881,35.11412',
          },
        ],
      },
      {
        value: '371300',
        text: '临沂市',
        center: '118.356464,35.103771',

        children: [
          {
            value: '371321',
            text: '沂南县',
            center: '118.465259,35.550078',
          },
          {
            value: '371312',
            text: '河东区',
            center: '118.403073,35.088936',
          },
          {
            value: '371324',
            text: '兰陵县',
            center: '118.070912,34.858235',
          },
          {
            value: '371329',
            text: '临沭县',
            center: '118.650828,34.920171',
          },
          {
            value: '371322',
            text: '郯城县',
            center: '118.36727,34.614077',
          },
          {
            value: '371323',
            text: '沂水县',
            center: '118.628142,35.790919',
          },
          {
            value: '371328',
            text: '蒙阴县',
            center: '117.953367,35.720128',
          },
          {
            value: '371327',
            text: '莒南县',
            center: '118.835166,35.206252',
          },
          {
            value: '371326',
            text: '平邑县',
            center: '117.615201,35.516849',
          },
          {
            value: '371311',
            text: '罗庄区',
            center: '118.284693,34.997061',
          },
          {
            value: '371302',
            text: '兰山区',
            center: '118.347332,35.052797',
          },
          {
            value: '371325',
            text: '费县',
            center: '117.9776,35.265851',
          },
        ],
      },
      {
        value: '371400',
        text: '德州市',
        center: '116.359244,37.436492',

        children: [
          {
            value: '371422',
            text: '宁津县',
            center: '116.800279,37.652456',
          },
          {
            value: '371481',
            text: '乐陵市',
            center: '117.232085,37.729769',
          },
          {
            value: '371402',
            text: '德城区',
            center: '116.299558,37.451051',
          },
          {
            value: '371428',
            text: '武城县',
            center: '116.069312,37.213398',
          },
          {
            value: '371426',
            text: '平原县',
            center: '116.434016,37.165453',
          },
          {
            value: '371403',
            text: '陵城区',
            center: '116.576148,37.336444',
          },
          {
            value: '371423',
            text: '庆云县',
            center: '117.384163,37.774376',
          },
          {
            value: '371427',
            text: '夏津县',
            center: '116.001796,36.948013',
          },
          {
            value: '371482',
            text: '禹城市',
            center: '116.638558,36.934198',
          },
          {
            value: '371424',
            text: '临邑县',
            center: '116.866568,37.190139',
          },
          {
            value: '371425',
            text: '齐河县',
            center: '116.762767,36.784164',
          },
        ],
      },
      {
        value: '370100',
        text: '济南市',
        center: '117.120128,36.652069',

        children: [
          {
            value: '370117',
            text: '钢城区',
            center: '117.811604,36.059393',
          },
          {
            value: '370115',
            text: '济阳区',
            center: '117.173722,36.978299',
          },
          {
            value: '370113',
            text: '长清区',
            center: '116.752101,36.554251',
          },
          {
            value: '370116',
            text: '莱芜区',
            center: '117.675828,36.214895',
          },
          {
            value: '370124',
            text: '平阴县',
            center: '116.455865,36.289813',
          },
          {
            value: '370103',
            text: '市中区',
            center: '116.997472,36.651121',
          },
          {
            value: '370126',
            text: '商河县',
            center: '117.157165,37.309694',
          },
          {
            value: '370105',
            text: '天桥区',
            center: '116.987106,36.678665',
          },
          {
            value: '370104',
            text: '槐荫区',
            center: '116.901057,36.652264',
          },
          {
            value: '370112',
            text: '历城区',
            center: '117.065233,36.680731',
          },
          {
            value: '370102',
            text: '历下区',
            center: '117.07632,36.666395',
          },
          {
            value: '370114',
            text: '章丘区',
            center: '117.526228,36.681258',
          },
        ],
      },
      {
        value: '370900',
        text: '泰安市',
        center: '117.086963,36.201784',

        children: [
          {
            value: '370902',
            text: '泰山区',
            center: '117.135215,36.192833',
          },
          {
            value: '370982',
            text: '新泰市',
            center: '117.768069,35.90953',
          },
          {
            value: '370911',
            text: '岱岳区',
            center: '117.041651,36.188088',
          },
          {
            value: '370983',
            text: '肥城市',
            center: '116.769098,36.181975',
          },
          {
            value: '370923',
            text: '东平县',
            center: '116.470211,35.937049',
          },
          {
            value: '370921',
            text: '宁阳县',
            center: '116.805578,35.758919',
          },
        ],
      },
    ],
  },
  {
    value: '610000',
    text: '陕西省',
    center: '108.953939,34.266611',

    children: [
      {
        value: '611000',
        text: '商洛市',
        center: '109.918646,33.873358',

        children: [
          {
            value: '611022',
            text: '丹凤县',
            center: '110.327542,33.696254',
          },
          {
            value: '611023',
            text: '商南县',
            center: '110.881741,33.531071',
          },
          {
            value: '611021',
            text: '洛南县',
            center: '110.148526,34.090815',
          },
          {
            value: '611002',
            text: '商州区',
            center: '109.941452,33.862979',
          },
          {
            value: '611026',
            text: '柞水县',
            center: '109.114006,33.686048',
          },
          {
            value: '611025',
            text: '镇安县',
            center: '109.152833,33.423764',
          },
          {
            value: '611024',
            text: '山阳县',
            center: '109.882289,33.532172',
          },
        ],
      },
      {
        value: '610700',
        text: '汉中市',
        center: '107.02319,33.066373',

        children: [
          {
            value: '610729',
            text: '留坝县',
            center: '106.920781,33.617637',
          },
          {
            value: '610723',
            text: '洋县',
            center: '107.545678,33.222808',
          },
          {
            value: '610727',
            text: '略阳县',
            center: '106.15658,33.327293',
          },
          {
            value: '610726',
            text: '宁强县',
            center: '106.257636,32.830032',
          },
          {
            value: '610725',
            text: '勉县',
            center: '106.673217,33.153636',
          },
          {
            value: '610702',
            text: '汉台区',
            center: '107.03201,33.067523',
          },
          {
            value: '610703',
            text: '南郑区',
            center: '106.936235,33.000034',
          },
          {
            value: '610728',
            text: '镇巴县',
            center: '107.895015,32.536706',
          },
          {
            value: '610722',
            text: '城固县',
            center: '107.333787,33.156937',
          },
          {
            value: '610724',
            text: '西乡县',
            center: '107.766477,32.983282',
          },
          {
            value: '610730',
            text: '佛坪县',
            center: '107.990551,33.524261',
          },
        ],
      },
      {
        value: '610600',
        text: '延安市',
        center: '109.49468,36.650109',

        children: [
          {
            value: '610681',
            text: '子长市',
            center: '109.675284,37.142462',
          },
          {
            value: '610622',
            text: '延川县',
            center: '110.193503,36.878324',
          },
          {
            value: '610626',
            text: '吴起县',
            center: '108.176501,36.92746',
          },
          {
            value: '610603',
            text: '安塞区',
            center: '109.329236,36.864571',
          },
          {
            value: '610602',
            text: '宝塔区',
            center: '109.489726,36.585138',
          },
          {
            value: '610625',
            text: '志丹县',
            center: '108.767816,36.822232',
          },
          {
            value: '610621',
            text: '延长县',
            center: '110.012455,36.579354',
          },
          {
            value: '610627',
            text: '甘泉县',
            center: '109.351046,36.276645',
          },
          {
            value: '610628',
            text: '富县',
            center: '109.37884,35.988111',
          },
          {
            value: '610629',
            text: '洛川县',
            center: '109.43249,35.762626',
          },
          {
            value: '610632',
            text: '黄陵县',
            center: '109.262919,35.579421',
          },
          {
            value: '610630',
            text: '宜川县',
            center: '110.168963,36.050178',
          },
          {
            value: '610631',
            text: '黄龙县',
            center: '109.84029,35.584655',
          },
        ],
      },
      {
        value: '610100',
        text: '西安市',
        center: '108.939645,34.343207',

        children: [
          {
            value: '610115',
            text: '临潼区',
            center: '109.214249,34.367181',
          },
          {
            value: '610111',
            text: '灞桥区',
            center: '109.064675,34.273111',
          },
          {
            value: '610116',
            text: '长安区',
            center: '108.906944,34.158668',
          },
          {
            value: '610122',
            text: '蓝田县',
            center: '109.323473,34.151256',
          },
          {
            value: '610118',
            text: '鄠邑区',
            center: '108.604772,34.108707',
          },
          {
            value: '610124',
            text: '周至县',
            center: '108.222219,34.163592',
          },
          {
            value: '610114',
            text: '阎良区',
            center: '109.226124,34.662232',
          },
          {
            value: '610113',
            text: '雁塔区',
            center: '108.948592,34.222517',
          },
          {
            value: '610103',
            text: '碑林区',
            center: '108.940681,34.256727',
          },
          {
            value: '610117',
            text: '高陵区',
            center: '109.088269,34.53502',
          },
          {
            value: '610104',
            text: '莲湖区',
            center: '108.944161,34.26535',
          },
          {
            value: '610112',
            text: '未央区',
            center: '108.946665,34.293109',
          },
          {
            value: '610102',
            text: '新城区',
            center: '108.960707,34.266601',
          },
        ],
      },
      {
        value: '610400',
        text: '咸阳市',
        center: '108.708837,34.329896',

        children: [
          {
            value: '610424',
            text: '乾县',
            center: '108.239316,34.528262',
          },
          {
            value: '610422',
            text: '三原县',
            center: '108.940754,34.617282',
          },
          {
            value: '610430',
            text: '淳化县',
            center: '108.580164,34.798596',
          },
          {
            value: '610403',
            text: '杨陵区',
            center: '108.084661,34.272084',
          },
          {
            value: '610481',
            text: '兴平市',
            center: '108.490497,34.299199',
          },
          {
            value: '610431',
            text: '武功县',
            center: '108.200275,34.261026',
          },
          {
            value: '610429',
            text: '旬邑县',
            center: '108.333815,35.111787',
          },
          {
            value: '610428',
            text: '长武县',
            center: '107.79906,35.206273',
          },
          {
            value: '610402',
            text: '秦都区',
            center: '108.706347,34.329478',
          },
          {
            value: '610426',
            text: '永寿县',
            center: '108.142197,34.69188',
          },
          {
            value: '610482',
            text: '彬州市',
            center: '108.081892,35.035702',
          },
          {
            value: '610404',
            text: '渭城区',
            center: '108.737062,34.36202',
          },
          {
            value: '610425',
            text: '礼泉县',
            center: '108.424682,34.481875',
          },
          {
            value: '610423',
            text: '泾阳县',
            center: '108.843029,34.526557',
          },
        ],
      },
      {
        value: '610300',
        text: '宝鸡市',
        center: '107.237682,34.362862',

        children: [
          {
            value: '610327',
            text: '陇县',
            center: '106.864404,34.892985',
          },
          {
            value: '610328',
            text: '千阳县',
            center: '107.132421,34.642374',
          },
          {
            value: '610303',
            text: '金台区',
            center: '107.232733,34.397071',
          },
          {
            value: '610302',
            text: '渭滨区',
            center: '107.155344,34.355068',
          },
          {
            value: '610330',
            text: '凤县',
            center: '106.515841,33.910797',
          },
          {
            value: '610331',
            text: '太白县',
            center: '107.318932,34.058299',
          },
          {
            value: '610326',
            text: '眉县',
            center: '107.750039,34.274774',
          },
          {
            value: '610324',
            text: '扶风县',
            center: '107.900157,34.375636',
          },
          {
            value: '610304',
            text: '陈仓区',
            center: '107.368993,34.35073',
          },
          {
            value: '610305',
            text: '凤翔区',
            center: '107.401029,34.522167',
          },
          {
            value: '610323',
            text: '岐山县',
            center: '107.621397,34.44373',
          },
          {
            value: '610329',
            text: '麟游县',
            center: '107.793524,34.677902',
          },
        ],
      },
      {
        value: '610200',
        text: '铜川市',
        center: '108.945116,34.897133',

        children: [
          {
            value: '610203',
            text: '印台区',
            center: '109.099848,35.11454',
          },
          {
            value: '610222',
            text: '宜君县',
            center: '109.117063,35.398624',
          },
          {
            value: '610202',
            text: '王益区',
            center: '109.075615,35.068925',
          },
          {
            value: '610204',
            text: '耀州区',
            center: '108.980095,34.909685',
          },
        ],
      },
      {
        value: '610500',
        text: '渭南市',
        center: '109.470962,34.520632',

        children: [
          {
            value: '610581',
            text: '韩城市',
            center: '110.44295,35.477145',
          },
          {
            value: '610527',
            text: '白水县',
            center: '109.590501,35.177497',
          },
          {
            value: '610522',
            text: '潼关县',
            center: '110.246105,34.544294',
          },
          {
            value: '610525',
            text: '澄城县',
            center: '109.932439,35.190256',
          },
          {
            value: '610526',
            text: '蒲城县',
            center: '109.586263,34.955755',
          },
          {
            value: '610524',
            text: '合阳县',
            center: '110.149412,35.237881',
          },
          {
            value: '610582',
            text: '华阴市',
            center: '110.092286,34.566552',
          },
          {
            value: '610523',
            text: '大荔县',
            center: '109.941784,34.797073',
          },
          {
            value: '610502',
            text: '临渭区',
            center: '109.510051,34.498902',
          },
          {
            value: '610503',
            text: '华州区',
            center: '109.775765,34.497019',
          },
          {
            value: '610528',
            text: '富平县',
            center: '109.179903,34.751599',
          },
        ],
      },
      {
        value: '610900',
        text: '安康市',
        center: '109.029017,32.685435',

        children: [
          {
            value: '610924',
            text: '紫阳县',
            center: '108.534291,32.520209',
          },
          {
            value: '610922',
            text: '石泉县',
            center: '108.248061,33.03805',
          },
          {
            value: '610927',
            text: '镇坪县',
            center: '109.526873,31.883672',
          },
          {
            value: '610925',
            text: '岚皋县',
            center: '108.902049,32.307001',
          },
          {
            value: '610981',
            text: '旬阳市',
            center: '109.361783,32.832213',
          },
          {
            value: '610929',
            text: '白河县',
            center: '110.112608,32.80901',
          },
          {
            value: '610926',
            text: '平利县',
            center: '109.361919,32.389061',
          },
          {
            value: '610923',
            text: '宁陕县',
            center: '108.314299,33.310284',
          },
          {
            value: '610902',
            text: '汉滨区',
            center: '109.026928,32.695436',
          },
          {
            value: '610921',
            text: '汉阴县',
            center: '108.508792,32.893057',
          },
        ],
      },
      {
        value: '610800',
        text: '榆林市',
        center: '109.734104,38.28576',

        children: [
          {
            value: '610802',
            text: '榆阳区',
            center: '109.72054,38.277078',
          },
          {
            value: '610881',
            text: '神木市',
            center: '110.466867,38.899742',
          },
          {
            value: '610827',
            text: '米脂县',
            center: '110.183984,37.755134',
          },
          {
            value: '610824',
            text: '靖边县',
            center: '108.794153,37.600351',
          },
          {
            value: '610831',
            text: '子洲县',
            center: '110.035124,37.610554',
          },
          {
            value: '610826',
            text: '绥德县',
            center: '110.263226,37.502984',
          },
          {
            value: '610829',
            text: '吴堡县',
            center: '110.739726,37.452179',
          },
          {
            value: '610830',
            text: '清涧县',
            center: '110.121181,37.088921',
          },
          {
            value: '610825',
            text: '定边县',
            center: '107.601048,37.594976',
          },
          {
            value: '610828',
            text: '佳县',
            center: '110.491345,38.01951',
          },
          {
            value: '610803',
            text: '横山区',
            center: '109.294144,37.962477',
          },
          {
            value: '610822',
            text: '府谷县',
            center: '111.016431,39.015658',
          },
        ],
      },
    ],
  },
  {
    value: '310000',
    text: '上海市',
    center: '121.473667,31.230525',

    children: [
      {
        value: '310100',
        text: '上海城区',
        center: '121.472644,31.231706',

        children: [
          {
            value: '310151',
            text: '崇明区',
            center: '121.397662,31.623863',
          },
          {
            value: '310120',
            text: '奉贤区',
            center: '121.473945,30.918406',
          },
          {
            value: '310115',
            text: '浦东新区',
            center: '121.544346,31.221461',
          },
          {
            value: '310116',
            text: '金山区',
            center: '121.341774,30.742769',
          },
          {
            value: '310107',
            text: '普陀区',
            center: '121.39547,31.249618',
          },
          {
            value: '310101',
            text: '黄浦区',
            center: '121.48442,31.231661',
          },
          {
            value: '310110',
            text: '杨浦区',
            center: '121.525409,31.259588',
          },
          {
            value: '310109',
            text: '虹口区',
            center: '121.504994,31.264917',
          },
          {
            value: '310104',
            text: '徐汇区',
            center: '121.436307,31.188334',
          },
          {
            value: '310106',
            text: '静安区',
            center: '121.447348,31.227718',
          },
          {
            value: '310113',
            text: '宝山区',
            center: '121.489431,31.405242',
          },
          {
            value: '310114',
            text: '嘉定区',
            center: '121.265276,31.375566',
          },
          {
            value: '310118',
            text: '青浦区',
            center: '121.124249,31.15098',
          },
          {
            value: '310117',
            text: '松江区',
            center: '121.227676,31.03257',
          },
          {
            value: '310105',
            text: '长宁区',
            center: '121.424751,31.220537',
          },
          {
            value: '310112',
            text: '闵行区',
            center: '121.380857,31.112834',
          },
        ],
      },
    ],
  },
  {
    value: '520000',
    text: '贵州省',
    center: '106.705251,26.600328',

    children: [
      {
        value: '520300',
        text: '遵义市',
        center: '107.031922,27.721931',

        children: [
          {
            value: '520329',
            text: '余庆县',
            center: '107.906043,27.21513',
          },
          {
            value: '520323',
            text: '绥阳县',
            center: '107.191326,27.946049',
          },
          {
            value: '520325',
            text: '道真仡佬族苗族自治县',
            center: '107.613076,28.862548',
          },
          {
            value: '520326',
            text: '务川仡佬族苗族自治县',
            center: '107.899353,28.562921',
          },
          {
            value: '520324',
            text: '正安县',
            center: '107.454463,28.553507',
          },
          {
            value: '520330',
            text: '习水县',
            center: '106.19715,28.332923',
          },
          {
            value: '520302',
            text: '红花岗区',
            center: '106.893598,27.644793',
          },
          {
            value: '520382',
            text: '仁怀市',
            center: '106.401322,27.791883',
          },
          {
            value: '520381',
            text: '赤水市',
            center: '105.697501,28.590474',
          },
          {
            value: '520328',
            text: '湄潭县',
            center: '107.465492,27.748942',
          },
          {
            value: '520327',
            text: '凤冈县',
            center: '107.71646,27.954424',
          },
          {
            value: '520322',
            text: '桐梓县',
            center: '106.824661,28.132991',
          },
          {
            value: '520303',
            text: '汇川区',
            center: '106.933727,27.749716',
          },
          {
            value: '520304',
            text: '播州区',
            center: '106.829081,27.535735',
          },
        ],
      },
      {
        value: '520600',
        text: '铜仁市',
        center: '109.189528,27.731555',

        children: [
          {
            value: '520623',
            text: '石阡县',
            center: '108.223686,27.513499',
          },
          {
            value: '520626',
            text: '德江县',
            center: '108.120773,28.264028',
          },
          {
            value: '520624',
            text: '思南县',
            center: '108.253798,27.937464',
          },
          {
            value: '520621',
            text: '江口县',
            center: '108.843993,27.704883',
          },
          {
            value: '520628',
            text: '松桃苗族自治县',
            center: '109.202877,28.15427',
          },
          {
            value: '520625',
            text: '印江土家族苗族自治县',
            center: '108.409638,27.994442',
          },
          {
            value: '520602',
            text: '碧江区',
            center: '109.264271,27.815244',
          },
          {
            value: '520603',
            text: '万山区',
            center: '109.153685,27.671268',
          },
          {
            value: '520627',
            text: '沿河土家族自治县',
            center: '108.503152,28.564083',
          },
          {
            value: '520622',
            text: '玉屏侗族自治县',
            center: '108.906415,27.235816',
          },
        ],
      },
      {
        value: '520200',
        text: '六盘水市',
        center: '104.830357,26.592538',

        children: [
          {
            value: '520201',
            text: '钟山区',
            center: '104.843723,26.574699',
          },
          {
            value: '520204',
            text: '水城区',
            center: '104.957871,26.547604',
          },
          {
            value: '520281',
            text: '盘州市',
            center: '104.471554,25.709878',
          },
          {
            value: '520203',
            text: '六枝特区',
            center: '105.477199,26.214356',
          },
        ],
      },
      {
        value: '522700',
        text: '黔南布依族苗族自治州',
        center: '107.522303,26.253136',

        children: [
          {
            value: '522727',
            text: '平塘县',
            center: '107.322635,25.822395',
          },
          {
            value: '522722',
            text: '荔波县',
            center: '107.88057,25.402528',
          },
          {
            value: '522728',
            text: '罗甸县',
            center: '106.751724,25.42616',
          },
          {
            value: '522731',
            text: '惠水县',
            center: '106.656993,26.132045',
          },
          {
            value: '522729',
            text: '长顺县',
            center: '106.44057,26.003187',
          },
          {
            value: '522702',
            text: '福泉市',
            center: '107.520371,26.686773',
          },
          {
            value: '522725',
            text: '瓮安县',
            center: '107.471307,27.07838',
          },
          {
            value: '522732',
            text: '三都水族自治县',
            center: '107.869489,25.983572',
          },
          {
            value: '522701',
            text: '都匀市',
            center: '107.518628,26.259456',
          },
          {
            value: '522726',
            text: '独山县',
            center: '107.557591,25.865418',
          },
          {
            value: '522723',
            text: '贵定县',
            center: '107.232208,26.557205',
          },
          {
            value: '522730',
            text: '龙里县',
            center: '106.979177,26.453546',
          },
        ],
      },
      {
        value: '520400',
        text: '安顺市',
        center: '105.9476,26.253103',

        children: [
          {
            value: '520402',
            text: '西秀区',
            center: '105.966086,26.243928',
          },
          {
            value: '520425',
            text: '紫云苗族布依族自治县',
            center: '106.084441,25.751047',
          },
          {
            value: '520424',
            text: '关岭布依族苗族自治县',
            center: '105.538335,25.953518',
          },
          {
            value: '520403',
            text: '平坝区',
            center: '106.255768,26.405968',
          },
          {
            value: '520422',
            text: '普定县',
            center: '105.743156,26.301876',
          },
          {
            value: '520423',
            text: '镇宁布依族苗族自治县',
            center: '105.770543,26.057248',
          },
        ],
      },
      {
        value: '522300',
        text: '黔西南布依族苗族自治州',
        center: '104.906419,25.087733',

        children: [
          {
            value: '522302',
            text: '兴仁市',
            center: '105.186132,25.43509',
          },
          {
            value: '522328',
            text: '安龙县',
            center: '105.442702,25.099014',
          },
          {
            value: '522327',
            text: '册亨县',
            center: '105.811592,24.983663',
          },
          {
            value: '522324',
            text: '晴隆县',
            center: '105.218956,25.834729',
          },
          {
            value: '522325',
            text: '贞丰县',
            center: '105.64976,25.38558',
          },
          {
            value: '522326',
            text: '望谟县',
            center: '106.094864,25.174204',
          },
          {
            value: '522301',
            text: '兴义市',
            center: '104.895503,25.09196',
          },
          {
            value: '522323',
            text: '普安县',
            center: '104.953289,25.784225',
          },
        ],
      },
      {
        value: '522600',
        text: '黔东南苗族侗族自治州',
        center: '107.982838,26.583759',

        children: [
          {
            value: '522634',
            text: '雷山县',
            center: '108.078217,26.378892',
          },
          {
            value: '522632',
            text: '榕江县',
            center: '108.52188,25.931893',
          },
          {
            value: '522627',
            text: '天柱县',
            center: '109.207826,26.909548',
          },
          {
            value: '522623',
            text: '施秉县',
            center: '108.124531,27.033107',
          },
          {
            value: '522625',
            text: '镇远县',
            center: '108.429536,27.049033',
          },
          {
            value: '522601',
            text: '凯里市',
            center: '107.981409,26.5662',
          },
          {
            value: '522636',
            text: '丹寨县',
            center: '107.789301,26.19857',
          },
          {
            value: '522631',
            text: '黎平县',
            center: '109.125826,26.213304',
          },
          {
            value: '522633',
            text: '从江县',
            center: '108.904998,25.754638',
          },
          {
            value: '522628',
            text: '锦屏县',
            center: '109.200808,26.675919',
          },
          {
            value: '522630',
            text: '台江县',
            center: '108.321244,26.667525',
          },
          {
            value: '522622',
            text: '黄平县',
            center: '107.916651,26.905278',
          },
          {
            value: '522635',
            text: '麻江县',
            center: '107.589455,26.49129',
          },
          {
            value: '522629',
            text: '剑河县',
            center: '108.441501,26.728274',
          },
          {
            value: '522624',
            text: '三穗县',
            center: '108.675265,26.953359',
          },
          {
            value: '522626',
            text: '岑巩县',
            center: '108.815855,27.174124',
          },
        ],
      },
      {
        value: '520100',
        text: '贵阳市',
        center: '106.628201,26.646694',

        children: [
          {
            value: '520121',
            text: '开阳县',
            center: '106.964716,27.057823',
          },
          {
            value: '520113',
            text: '白云区',
            center: '106.623069,26.677932',
          },
          {
            value: '520123',
            text: '修文县',
            center: '106.591958,26.836048',
          },
          {
            value: '520181',
            text: '清镇市',
            center: '106.468686,26.570435',
          },
          {
            value: '520112',
            text: '乌当区',
            center: '106.75069,26.630911',
          },
          {
            value: '520102',
            text: '南明区',
            center: '106.714305,26.568055',
          },
          {
            value: '520103',
            text: '云岩区',
            center: '106.724394,26.604604',
          },
          {
            value: '520115',
            text: '观山湖区',
            center: '106.598978,26.616134',
          },
          {
            value: '520111',
            text: '花溪区',
            center: '106.67026,26.409817',
          },
          {
            value: '520122',
            text: '息烽县',
            center: '106.740407,27.090479',
          },
        ],
      },
      {
        value: '520500',
        text: '毕节市',
        center: '105.291544,27.283615',

        children: [
          {
            value: '520581',
            text: '黔西市',
            center: '106.032277,27.008681',
          },
          {
            value: '520523',
            text: '金沙县',
            center: '106.220112,27.458601',
          },
          {
            value: '520524',
            text: '织金县',
            center: '105.770249,26.663649',
          },
          {
            value: '520521',
            text: '大方县',
            center: '105.601963,27.14443',
          },
          {
            value: '520525',
            text: '纳雍县',
            center: '105.414578,26.779344',
          },
          {
            value: '520502',
            text: '七星关区',
            center: '105.305219,27.298304',
          },
          {
            value: '520527',
            text: '赫章县',
            center: '104.728011,27.117933',
          },
          {
            value: '520526',
            text: '威宁彝族回族苗族自治县',
            center: '104.252787,26.873872',
          },
        ],
      },
    ],
  },
  {
    value: '500000',
    text: '重庆市',
    center: '106.550483,29.563707',

    children: [
      {
        value: '500200',
        text: '重庆郊县',
        center: '108.170255,29.291965',

        children: [
          {
            value: '500238',
            text: '巫溪县',
            center: '109.570038,31.398619',
          },
          {
            value: '500236',
            text: '奉节县',
            center: '109.401056,31.018505',
          },
          {
            value: '500243',
            text: '彭水苗族土家族自治县',
            center: '108.165571,29.293748',
          },
          {
            value: '500241',
            text: '秀山土家族苗族自治县',
            center: '109.007096,28.448248',
          },
          {
            value: '500235',
            text: '云阳县',
            center: '108.6975,30.930628',
          },
          {
            value: '500240',
            text: '石柱土家族自治县',
            center: '108.114251,29.999066',
          },
          {
            value: '500237',
            text: '巫山县',
            center: '109.878995,31.07478',
          },
          {
            value: '500230',
            text: '丰都县',
            center: '107.731056,29.863785',
          },
          {
            value: '500229',
            text: '城口县',
            center: '108.664349,31.947319',
          },
          {
            value: '500242',
            text: '酉阳土家族苗族自治县',
            center: '108.76726,28.841409',
          },
          {
            value: '500233',
            text: '忠县',
            center: '108.038073,30.299817',
          },
          {
            value: '500231',
            text: '垫江县',
            center: '107.332511,30.327548',
          },
        ],
      },
      {
        value: '500100',
        text: '重庆城区',
        center: '106.504962,29.533155',

        children: [
          {
            value: '500152',
            text: '潼南区',
            center: '105.840487,30.191077',
          },
          {
            value: '500117',
            text: '合川区',
            center: '106.27617,29.971968',
          },
          {
            value: '500115',
            text: '长寿区',
            center: '107.080945,29.857916',
          },
          {
            value: '500111',
            text: '大足区',
            center: '105.721825,29.707555',
          },
          {
            value: '500104',
            text: '大渡口区',
            center: '106.482299,29.484464',
          },
          {
            value: '500107',
            text: '九龙坡区',
            center: '106.510515,29.502325',
          },
          {
            value: '500151',
            text: '铜梁区',
            center: '106.056265,29.845248',
          },
          {
            value: '500114',
            text: '黔江区',
            center: '108.770677,29.533609',
          },
          {
            value: '500108',
            text: '南岸区',
            center: '106.644254,29.50109',
          },
          {
            value: '500156',
            text: '武隆区',
            center: '107.759955,29.325707',
          },
          {
            value: '500110',
            text: '綦江区',
            center: '106.651213,29.028117',
          },
          {
            value: '500113',
            text: '巴南区',
            center: '106.540603,29.402348',
          },
          {
            value: '500116',
            text: '江津区',
            center: '106.264435,29.319984',
          },
          {
            value: '500154',
            text: '开州区',
            center: '108.39336,31.160416',
          },
          {
            value: '500102',
            text: '涪陵区',
            center: '107.246521,29.752475',
          },
          {
            value: '500109',
            text: '北碚区',
            center: '106.395593,29.805197',
          },
          {
            value: '500106',
            text: '沙坪坝区',
            center: '106.456939,29.541017',
          },
          {
            value: '500119',
            text: '南川区',
            center: '107.099147,29.157879',
          },
          {
            value: '500118',
            text: '永川区',
            center: '105.926951,29.356384',
          },
          {
            value: '500120',
            text: '璧山区',
            center: '106.204885,29.577455',
          },
          {
            value: '500101',
            text: '万州区',
            center: '108.408591,30.807621',
          },
          {
            value: '500155',
            text: '梁平区',
            center: '107.769568,30.654233',
          },
          {
            value: '500153',
            text: '荣昌区',
            center: '105.6118,29.416892',
          },
          {
            value: '500103',
            text: '渝中区',
            center: '106.568955,29.552642',
          },
          {
            value: '500112',
            text: '渝北区',
            center: '106.631155,29.718087',
          },
          {
            value: '500105',
            text: '江北区',
            center: '106.574395,29.606224',
          },
        ],
      },
    ],
  },
  {
    value: '340000',
    text: '安徽省',
    center: '117.330139,31.734559',

    children: [
      {
        value: '341700',
        text: '池州市',
        center: '117.495663,30.674264',

        children: [
          {
            value: '341702',
            text: '贵池区',
            center: '117.568432,30.687389',
          },
          {
            value: '341723',
            text: '青阳县',
            center: '117.847366,30.639006',
          },
          {
            value: '341721',
            text: '东至县',
            center: '117.027533,30.111182',
          },
          {
            value: '341722',
            text: '石台县',
            center: '117.486211,30.210218',
          },
        ],
      },
      {
        value: '340700',
        text: '铜陵市',
        center: '117.811298,30.945214',

        children: [
          {
            value: '340711',
            text: '郊区',
            center: '117.767919,30.821699',
          },
          {
            value: '340705',
            text: '铜官区',
            center: '117.856541,30.936772',
          },
          {
            value: '340722',
            text: '枞阳县',
            center: '117.250191,30.705466',
          },
          {
            value: '340706',
            text: '义安区',
            center: '117.937405,30.950619',
          },
        ],
      },
      {
        value: '340800',
        text: '安庆市',
        center: '117.115349,30.531828',

        children: [
          {
            value: '340828',
            text: '岳西县',
            center: '116.359732,30.849716',
          },
          {
            value: '340882',
            text: '潜山市',
            center: '116.581224,30.631022',
          },
          {
            value: '340811',
            text: '宜秀区',
            center: '116.987469,30.613189',
          },
          {
            value: '340802',
            text: '迎江区',
            center: '117.090878,30.512768',
          },
          {
            value: '340881',
            text: '桐城市',
            center: '116.936588,31.035476',
          },
          {
            value: '340803',
            text: '大观区',
            center: '117.013469,30.553697',
          },
          {
            value: '340825',
            text: '太湖县',
            center: '116.30881,30.454198',
          },
          {
            value: '340827',
            text: '望江县',
            center: '116.70641,30.128404',
          },
          {
            value: '340826',
            text: '宿松县',
            center: '116.134485,30.171663',
          },
          {
            value: '340822',
            text: '怀宁县',
            center: '116.829612,30.73484',
          },
        ],
      },
      {
        value: '340600',
        text: '淮北市',
        center: '116.798362,33.956264',

        children: [
          {
            value: '340602',
            text: '杜集区',
            center: '116.827949,33.991412',
          },
          {
            value: '340603',
            text: '相山区',
            center: '116.795233,33.959927',
          },
          {
            value: '340621',
            text: '濉溪县',
            center: '116.76616,33.915612',
          },
          {
            value: '340604',
            text: '烈山区',
            center: '116.813221,33.895407',
          },
        ],
      },
      {
        value: '340500',
        text: '马鞍山市',
        center: '118.50685,31.668765',

        children: [
          {
            value: '340504',
            text: '雨山区',
            center: '118.498675,31.682374',
          },
          {
            value: '340522',
            text: '含山县',
            center: '118.101448,31.735559',
          },
          {
            value: '340506',
            text: '博望区',
            center: '118.818276,31.55117',
          },
          {
            value: '340503',
            text: '花山区',
            center: '118.511366,31.700127',
          },
          {
            value: '340523',
            text: '和县',
            center: '118.353668,31.74248',
          },
          {
            value: '340521',
            text: '当涂县',
            center: '118.497873,31.570857',
          },
        ],
      },
      {
        value: '341600',
        text: '亳州市',
        center: '115.778588,33.846285',

        children: [
          {
            value: '341622',
            text: '蒙城县',
            center: '116.56434,33.265671',
          },
          {
            value: '341621',
            text: '涡阳县',
            center: '116.21665,33.494134',
          },
          {
            value: '341602',
            text: '谯城区',
            center: '115.779081,33.876436',
          },
          {
            value: '341623',
            text: '利辛县',
            center: '116.206396,33.158424',
          },
        ],
      },
      {
        value: '341000',
        text: '黄山市',
        center: '118.337643,29.714886',

        children: [
          {
            value: '341003',
            text: '黄山区',
            center: '118.141632,30.272991',
          },
          {
            value: '341023',
            text: '黟县',
            center: '117.938139,29.92477',
          },
          {
            value: '341002',
            text: '屯溪区',
            center: '118.315012,29.69655',
          },
          {
            value: '341022',
            text: '休宁县',
            center: '118.193533,29.784532',
          },
          {
            value: '341024',
            text: '祁门县',
            center: '117.717452,29.854179',
          },
          {
            value: '341021',
            text: '歙县',
            center: '118.415258,29.861354',
          },
          {
            value: '341004',
            text: '徽州区',
            center: '118.336799,29.827291',
          },
        ],
      },
      {
        value: '340300',
        text: '蚌埠市',
        center: '117.388566,32.91682',

        children: [
          {
            value: '340311',
            text: '淮上区',
            center: '117.359352,32.96557',
          },
          {
            value: '340322',
            text: '五河县',
            center: '117.881312,33.126532',
          },
          {
            value: '340304',
            text: '禹会区',
            center: '117.34186,32.929715',
          },
          {
            value: '340303',
            text: '蚌山区',
            center: '117.373347,32.916393',
          },
          {
            value: '340302',
            text: '龙子湖区',
            center: '117.454544,32.90863',
          },
          {
            value: '340321',
            text: '怀远县',
            center: '117.205083,32.971543',
          },
          {
            value: '340323',
            text: '固镇县',
            center: '117.316585,33.318371',
          },
        ],
      },
      {
        value: '341100',
        text: '滁州市',
        center: '118.333439,32.255904',

        children: [
          {
            value: '341181',
            text: '天长市',
            center: '119.004838,32.667409',
          },
          {
            value: '341126',
            text: '凤阳县',
            center: '117.531791,32.875714',
          },
          {
            value: '341125',
            text: '定远县',
            center: '117.698528,32.530741',
          },
          {
            value: '341124',
            text: '全椒县',
            center: '118.274149,32.08593',
          },
          {
            value: '341182',
            text: '明光市',
            center: '118.018197,32.78193',
          },
          {
            value: '341103',
            text: '南谯区',
            center: '118.416715,32.200084',
          },
          {
            value: '341122',
            text: '来安县',
            center: '118.432581,32.423072',
          },
          {
            value: '341102',
            text: '琅琊区',
            center: '118.32115,32.334475',
          },
        ],
      },
      {
        value: '341200',
        text: '阜阳市',
        center: '115.814252,32.891032',

        children: [
          {
            value: '341202',
            text: '颍州区',
            center: '115.806916,32.883322',
          },
          {
            value: '341221',
            text: '临泉县',
            center: '115.26312,33.038884',
          },
          {
            value: '341204',
            text: '颍泉区',
            center: '115.807415,32.925461',
          },
          {
            value: '341282',
            text: '界首市',
            center: '115.374688,33.257799',
          },
          {
            value: '341222',
            text: '太和县',
            center: '115.621941,33.160327',
          },
          {
            value: '341226',
            text: '颍上县',
            center: '116.256772,32.653211',
          },
          {
            value: '341203',
            text: '颍东区',
            center: '115.856728,32.91173',
          },
          {
            value: '341225',
            text: '阜南县',
            center: '115.596003,32.659681',
          },
        ],
      },
      {
        value: '340400',
        text: '淮南市',
        center: '117.018603,32.585384',

        children: [
          {
            value: '340406',
            text: '潘集区',
            center: '116.834715,32.77208',
          },
          {
            value: '340405',
            text: '八公山区',
            center: '116.832979,32.630922',
          },
          {
            value: '340404',
            text: '谢家集区',
            center: '116.860026,32.599173',
          },
          {
            value: '340421',
            text: '凤台县',
            center: '116.710947,32.710536',
          },
          {
            value: '340402',
            text: '大通区',
            center: '117.053314,32.631519',
          },
          {
            value: '340422',
            text: '寿县',
            center: '116.798203,32.545027',
          },
          {
            value: '340403',
            text: '田家庵区',
            center: '117.017263,32.647456',
          },
        ],
      },
      {
        value: '341300',
        text: '宿州市',
        center: '116.96419,33.647726',

        children: [
          {
            value: '341324',
            text: '泗县',
            center: '117.910277,33.483686',
          },
          {
            value: '341321',
            text: '砀山县',
            center: '116.366257,34.442139',
          },
          {
            value: '341323',
            text: '灵璧县',
            center: '117.549321,33.554464',
          },
          {
            value: '341302',
            text: '埇桥区',
            center: '116.977039,33.640205',
          },
          {
            value: '341322',
            text: '萧县',
            center: '116.947289,34.18884',
          },
        ],
      },
      {
        value: '341500',
        text: '六安市',
        center: '116.519729,31.735892',

        children: [
          {
            value: '341503',
            text: '裕安区',
            center: '116.479505,31.738789',
          },
          {
            value: '341522',
            text: '霍邱县',
            center: '116.277966,32.353362',
          },
          {
            value: '341504',
            text: '叶集区',
            center: '115.925271,31.863693',
          },
          {
            value: '341525',
            text: '霍山县',
            center: '116.348274,31.409668',
          },
          {
            value: '341524',
            text: '金寨县',
            center: '115.934253,31.727295',
          },
          {
            value: '341502',
            text: '金安区',
            center: '116.539458,31.75014',
          },
          {
            value: '341523',
            text: '舒城县',
            center: '116.94863,31.462036',
          },
        ],
      },
      {
        value: '341800',
        text: '宣城市',
        center: '118.759127,30.939278',

        children: [
          {
            value: '341825',
            text: '旌德县',
            center: '118.550043,30.298287',
          },
          {
            value: '341881',
            text: '宁国市',
            center: '118.983085,30.634032',
          },
          {
            value: '341802',
            text: '宣州区',
            center: '118.786098,30.944356',
          },
          {
            value: '341824',
            text: '绩溪县',
            center: '118.578519,30.067533',
          },
          {
            value: '341821',
            text: '郎溪县',
            center: '119.184326,31.142995',
          },
          {
            value: '341882',
            text: '广德市',
            center: '119.420799,30.877608',
          },
          {
            value: '341823',
            text: '泾县',
            center: '118.419552,30.688793',
          },
        ],
      },
      {
        value: '340200',
        text: '芜湖市',
        center: '118.433065,31.352614',

        children: [
          {
            value: '340202',
            text: '镜湖区',
            center: '118.385133,31.34056',
          },
          {
            value: '340209',
            text: '弋江区',
            center: '118.372664,31.311421',
          },
          {
            value: '340281',
            text: '无为市',
            center: '117.902265,31.304462',
          },
          {
            value: '340212',
            text: '繁昌区',
            center: '118.198536,31.101766',
          },
          {
            value: '340223',
            text: '南陵县',
            center: '118.334083,30.914621',
          },
          {
            value: '340210',
            text: '湾沚区',
            center: '118.576124,31.134809',
          },
          {
            value: '340207',
            text: '鸠江区',
            center: '118.392337,31.369752',
          },
        ],
      },
      {
        value: '340100',
        text: '合肥市',
        center: '117.227267,31.820567',

        children: [
          {
            value: '340111',
            text: '包河区',
            center: '117.310133,31.793801',
          },
          {
            value: '340103',
            text: '庐阳区',
            center: '117.265088,31.878722',
          },
          {
            value: '340121',
            text: '长丰县',
            center: '117.167632,32.478347',
          },
          {
            value: '340181',
            text: '巢湖市',
            center: '117.890236,31.624464',
          },
          {
            value: '340122',
            text: '肥东县',
            center: '117.4779,31.878601',
          },
          {
            value: '340102',
            text: '瑶海区',
            center: '117.30944,31.858111',
          },
          {
            value: '340104',
            text: '蜀山区',
            center: '117.26053,31.851211',
          },
          {
            value: '340123',
            text: '肥西县',
            center: '117.158416,31.707006',
          },
          {
            value: '340124',
            text: '庐江县',
            center: '117.288165,31.256978',
          },
        ],
      },
    ],
  },
  {
    value: '350000',
    text: '福建省',
    center: '119.296194,26.101082',

    children: [
      {
        value: '350900',
        text: '宁德市',
        center: '119.547729,26.666222',

        children: [
          {
            value: '350982',
            text: '福鼎市',
            center: '120.216559,27.324796',
          },
          {
            value: '350922',
            text: '古田县',
            center: '118.74603,26.578134',
          },
          {
            value: '350902',
            text: '蕉城区',
            center: '119.526284,26.660658',
          },
          {
            value: '350921',
            text: '霞浦县',
            center: '120.005267,26.885971',
          },
          {
            value: '350981',
            text: '福安市',
            center: '119.647871,27.088274',
          },
          {
            value: '350926',
            text: '柘荣县',
            center: '119.900597,27.23421',
          },
          {
            value: '350923',
            text: '屏南县',
            center: '118.985759,26.908256',
          },
          {
            value: '350925',
            text: '周宁县',
            center: '119.338998,27.104797',
          },
          {
            value: '350924',
            text: '寿宁县',
            center: '119.514589,27.45467',
          },
        ],
      },
      {
        value: '350100',
        text: '福州市',
        center: '119.296411,26.074286',

        children: [
          {
            value: '350123',
            text: '罗源县',
            center: '119.549129,26.490215',
          },
          {
            value: '350124',
            text: '闽清县',
            center: '118.863334,26.221099',
          },
          {
            value: '350122',
            text: '连江县',
            center: '119.539542,26.197737',
          },
          {
            value: '350181',
            text: '福清市',
            center: '119.384388,25.720081',
          },
          {
            value: '350112',
            text: '长乐区',
            center: '119.522952,25.962925',
          },
          {
            value: '350128',
            text: '平潭县',
            center: '119.789893,25.498767',
          },
          {
            value: '350103',
            text: '台江区',
            center: '119.31419,26.052826',
          },
          {
            value: '350125',
            text: '永泰县',
            center: '118.932746,25.867198',
          },
          {
            value: '350111',
            text: '晋安区',
            center: '119.328591,26.081963',
          },
          {
            value: '350102',
            text: '鼓楼区',
            center: '119.304507,26.082666',
          },
          {
            value: '350121',
            text: '闽侯县',
            center: '119.131362,26.150428',
          },
          {
            value: '350104',
            text: '仓山区',
            center: '119.27322,26.047027',
          },
          {
            value: '350105',
            text: '马尾区',
            center: '119.439259,25.998657',
          },
        ],
      },
      {
        value: '350300',
        text: '莆田市',
        center: '119.007662,25.454202',

        children: [
          {
            value: '350305',
            text: '秀屿区',
            center: '119.105177,25.318649',
          },
          {
            value: '350304',
            text: '荔城区',
            center: '119.014821,25.432268',
          },
          {
            value: '350322',
            text: '仙游县',
            center: '118.689745,25.373373',
          },
          {
            value: '350302',
            text: '城厢区',
            center: '118.994261,25.419062',
          },
          {
            value: '350303',
            text: '涵江区',
            center: '119.116173,25.459057',
          },
        ],
      },
      {
        value: '350500',
        text: '泉州市',
        center: '118.675724,24.874452',

        children: [
          {
            value: '350504',
            text: '洛江区',
            center: '118.671168,24.939319',
          },
          {
            value: '350521',
            text: '惠安县',
            center: '118.781037,25.012449',
          },
          {
            value: '350582',
            text: '晋江市',
            center: '118.551659,24.781635',
          },
          {
            value: '350583',
            text: '南安市',
            center: '118.385929,24.960056',
          },
          {
            value: '350527',
            text: '金门县',
            center: '118.319179,24.437147',
          },
          {
            value: '350505',
            text: '泉港区',
            center: '118.915804,25.120399',
          },
          {
            value: '350581',
            text: '石狮市',
            center: '118.647945,24.731969',
          },
          {
            value: '350525',
            text: '永春县',
            center: '118.29416,25.321849',
          },
          {
            value: '350524',
            text: '安溪县',
            center: '118.186295,25.056065',
          },
          {
            value: '350502',
            text: '鲤城区',
            center: '118.58652,24.908133',
          },
          {
            value: '350526',
            text: '德化县',
            center: '118.241104,25.492102',
          },
          {
            value: '350503',
            text: '丰泽区',
            center: '118.613007,24.890373',
          },
        ],
      },
      {
        value: '350200',
        text: '厦门市',
        center: '118.08891,24.479627',

        children: [
          {
            value: '350206',
            text: '湖里区',
            center: '118.146825,24.512858',
          },
          {
            value: '350203',
            text: '思明区',
            center: '118.082745,24.445676',
          },
          {
            value: '350213',
            text: '翔安区',
            center: '118.247911,24.618583',
          },
          {
            value: '350205',
            text: '海沧区',
            center: '118.032883,24.484688',
          },
          {
            value: '350211',
            text: '集美区',
            center: '118.097407,24.575976',
          },
          {
            value: '350212',
            text: '同安区',
            center: '118.150823,24.723299',
          },
        ],
      },
      {
        value: '350600',
        text: '漳州市',
        center: '117.647298,24.515297',

        children: [
          {
            value: '350623',
            text: '漳浦县',
            center: '117.613783,24.11741',
          },
          {
            value: '350604',
            text: '龙海区',
            center: '117.818485,24.446839',
          },
          {
            value: '350626',
            text: '东山县',
            center: '117.4295,23.702034',
          },
          {
            value: '350627',
            text: '南靖县',
            center: '117.357061,24.5151',
          },
          {
            value: '350628',
            text: '平和县',
            center: '117.314798,24.363831',
          },
          {
            value: '350629',
            text: '华安县',
            center: '117.53411,25.00445',
          },
          {
            value: '350605',
            text: '长泰区',
            center: '117.759119,24.625989',
          },
          {
            value: '350602',
            text: '芗城区',
            center: '117.653727,24.510937',
          },
          {
            value: '350603',
            text: '龙文区',
            center: '117.711188,24.503523',
          },
          {
            value: '350624',
            text: '诏安县',
            center: '117.175314,23.711674',
          },
          {
            value: '350622',
            text: '云霄县',
            center: '117.334351,23.935433',
          },
        ],
      },
      {
        value: '350800',
        text: '龙岩市',
        center: '117.017362,25.075884',

        children: [
          {
            value: '350824',
            text: '武平县',
            center: '116.100216,25.096139',
          },
          {
            value: '350821',
            text: '长汀县',
            center: '116.357581,25.833531',
          },
          {
            value: '350802',
            text: '新罗区',
            center: '117.036816,25.098942',
          },
          {
            value: '350881',
            text: '漳平市',
            center: '117.419823,25.290481',
          },
          {
            value: '350803',
            text: '永定区',
            center: '116.732216,24.724148',
          },
          {
            value: '350823',
            text: '上杭县',
            center: '116.419447,25.049867',
          },
          {
            value: '350825',
            text: '连城县',
            center: '116.754472,25.710538',
          },
        ],
      },
      {
        value: '350700',
        text: '南平市',
        center: '118.081325,27.382829',

        children: [
          {
            value: '350703',
            text: '建阳区',
            center: '118.120392,27.331996',
          },
          {
            value: '350725',
            text: '政和县',
            center: '118.857703,27.366122',
          },
          {
            value: '350723',
            text: '光泽县',
            center: '117.333812,27.541061',
          },
          {
            value: '350722',
            text: '浦城县',
            center: '118.541079,27.917804',
          },
          {
            value: '350724',
            text: '松溪县',
            center: '118.785429,27.526028',
          },
          {
            value: '350783',
            text: '建瓯市',
            center: '118.304712,27.023233',
          },
          {
            value: '350721',
            text: '顺昌县',
            center: '117.809433,26.793455',
          },
          {
            value: '350702',
            text: '延平区',
            center: '118.181806,26.637503',
          },
          {
            value: '350782',
            text: '武夷山市',
            center: '118.035321,27.756422',
          },
          {
            value: '350781',
            text: '邵武市',
            center: '117.492778,27.340672',
          },
        ],
      },
      {
        value: '350400',
        text: '三明市',
        center: '117.638919,26.263455',

        children: [
          {
            value: '350405',
            text: '沙县区',
            center: '117.792551,26.396843',
          },
          {
            value: '350430',
            text: '建宁县',
            center: '116.848488,26.833566',
          },
          {
            value: '350421',
            text: '明溪县',
            center: '117.202119,26.355938',
          },
          {
            value: '350428',
            text: '将乐县',
            center: '117.471127,26.728917',
          },
          {
            value: '350424',
            text: '宁化县',
            center: '116.654369,26.262298',
          },
          {
            value: '350404',
            text: '三元区',
            center: '117.646153,26.271653',
          },
          {
            value: '350423',
            text: '清流县',
            center: '116.816772,26.177658',
          },
          {
            value: '350481',
            text: '永安市',
            center: '117.365046,25.941671',
          },
          {
            value: '350426',
            text: '尤溪县',
            center: '118.190515,26.169942',
          },
          {
            value: '350429',
            text: '泰宁县',
            center: '117.175448,26.900244',
          },
          {
            value: '350425',
            text: '大田县',
            center: '117.846828,25.692535',
          },
        ],
      },
    ],
  },
  {
    value: '430000',
    text: '湖南省',
    center: '112.982951,28.116007',

    children: [
      {
        value: '430600',
        text: '岳阳市',
        center: '113.128922,29.35648',

        children: [
          {
            value: '430623',
            text: '华容县',
            center: '112.540448,29.530775',
          },
          {
            value: '430603',
            text: '云溪区',
            center: '113.272312,29.472745',
          },
          {
            value: '430681',
            text: '汨罗市',
            center: '113.067097,28.806937',
          },
          {
            value: '430624',
            text: '湘阴县',
            center: '112.909248,28.690123',
          },
          {
            value: '430682',
            text: '临湘市',
            center: '113.450461,29.476687',
          },
          {
            value: '430602',
            text: '岳阳楼区',
            center: '113.129362,29.371356',
          },
          {
            value: '430626',
            text: '平江县',
            center: '113.581296,28.702018',
          },
          {
            value: '430621',
            text: '岳阳县',
            center: '113.116152,29.144681',
          },
          {
            value: '430611',
            text: '君山区',
            center: '113.006434,29.461017',
          },
        ],
      },
      {
        value: '431200',
        text: '怀化市',
        center: '110.001598,27.569813',

        children: [
          {
            value: '431228',
            text: '芷江侗族自治县',
            center: '109.684696,27.443429',
          },
          {
            value: '431230',
            text: '通道侗族自治县',
            center: '109.784409,26.158032',
          },
          {
            value: '431222',
            text: '沅陵县',
            center: '110.393782,28.452103',
          },
          {
            value: '431223',
            text: '辰溪县',
            center: '110.183159,28.006235',
          },
          {
            value: '431224',
            text: '溆浦县',
            center: '110.594419,27.908869',
          },
          {
            value: '431225',
            text: '会同县',
            center: '109.734724,26.887156',
          },
          {
            value: '431229',
            text: '靖州苗族侗族自治县',
            center: '109.696249,26.575111',
          },
          {
            value: '431226',
            text: '麻阳苗族自治县',
            center: '109.817703,27.857666',
          },
          {
            value: '431227',
            text: '新晃侗族自治县',
            center: '109.174808,27.352094',
          },
          {
            value: '431202',
            text: '鹤城区',
            center: '110.040099,27.578581',
          },
          {
            value: '431221',
            text: '中方县',
            center: '109.945436,27.440554',
          },
          {
            value: '431281',
            text: '洪江市',
            center: '109.836475,27.209385',
          },
        ],
      },
      {
        value: '433100',
        text: '湘西土家族苗族自治州',
        center: '109.737428,28.312592',

        children: [
          {
            value: '433125',
            text: '保靖县',
            center: '109.660433,28.699939',
          },
          {
            value: '433127',
            text: '永顺县',
            center: '109.857142,28.979819',
          },
          {
            value: '433101',
            text: '吉首市',
            center: '109.698348,28.261948',
          },
          {
            value: '433124',
            text: '花垣县',
            center: '109.482378,28.57191',
          },
          {
            value: '433126',
            text: '古丈县',
            center: '109.95072,28.616971',
          },
          {
            value: '433122',
            text: '泸溪县',
            center: '110.219619,28.216109',
          },
          {
            value: '433123',
            text: '凤凰县',
            center: '109.580815,27.957441',
          },
          {
            value: '433130',
            text: '龙山县',
            center: '109.443974,29.457623',
          },
        ],
      },
      {
        value: '430700',
        text: '常德市',
        center: '111.69905,29.031446',

        children: [
          {
            value: '430723',
            text: '澧县',
            center: '111.758806,29.633138',
          },
          {
            value: '430722',
            text: '汉寿县',
            center: '111.970725,28.906063',
          },
          {
            value: '430781',
            text: '津市市',
            center: '111.877957,29.606512',
          },
          {
            value: '430703',
            text: '鼎城区',
            center: '111.679896,29.017596',
          },
          {
            value: '430721',
            text: '安乡县',
            center: '112.171107,29.41131',
          },
          {
            value: '430726',
            text: '石门县',
            center: '111.380056,29.584344',
          },
          {
            value: '430724',
            text: '临澧县',
            center: '111.647547,29.440813',
          },
          {
            value: '430702',
            text: '武陵区',
            center: '111.683043,29.055332',
          },
          {
            value: '430725',
            text: '桃源县',
            center: '111.488985,28.90232',
          },
        ],
      },
      {
        value: '430900',
        text: '益阳市',
        center: '112.355994,28.554853',

        children: [
          {
            value: '430902',
            text: '资阳区',
            center: '112.324286,28.59149',
          },
          {
            value: '430922',
            text: '桃江县',
            center: '112.156432,28.518215',
          },
          {
            value: '430923',
            text: '安化县',
            center: '111.213296,28.374223',
          },
          {
            value: '430921',
            text: '南县',
            center: '112.396323,29.362396',
          },
          {
            value: '430981',
            text: '沅江市',
            center: '112.354657,28.845755',
          },
          {
            value: '430903',
            text: '赫山区',
            center: '112.373895,28.58011',
          },
        ],
      },
      {
        value: '430400',
        text: '衡阳市',
        center: '112.572016,26.894216',

        children: [
          {
            value: '430423',
            text: '衡山县',
            center: '112.868361,27.230225',
          },
          {
            value: '430421',
            text: '衡阳县',
            center: '112.370649,26.970258',
          },
          {
            value: '430412',
            text: '南岳区',
            center: '112.737678,27.231846',
          },
          {
            value: '430405',
            text: '珠晖区',
            center: '112.620653,26.894796',
          },
          {
            value: '430407',
            text: '石鼓区',
            center: '112.597937,26.944257',
          },
          {
            value: '430406',
            text: '雁峰区',
            center: '112.613914,26.840335',
          },
          {
            value: '430408',
            text: '蒸湘区',
            center: '112.567333,26.912388',
          },
          {
            value: '430482',
            text: '常宁市',
            center: '112.399894,26.421717',
          },
          {
            value: '430424',
            text: '衡东县',
            center: '112.953113,27.081086',
          },
          {
            value: '430426',
            text: '祁东县',
            center: '112.090319,26.799284',
          },
          {
            value: '430481',
            text: '耒阳市',
            center: '112.859806,26.422149',
          },
          {
            value: '430422',
            text: '衡南县',
            center: '112.677572,26.739665',
          },
        ],
      },
      {
        value: '430300',
        text: '湘潭市',
        center: '112.945439,27.83136',

        children: [
          {
            value: '430304',
            text: '岳塘区',
            center: '112.969444,27.872013',
          },
          {
            value: '430302',
            text: '雨湖区',
            center: '112.907334,27.856115',
          },
          {
            value: '430382',
            text: '韶山市',
            center: '112.525364,27.914796',
          },
          {
            value: '430321',
            text: '湘潭县',
            center: '112.950767,27.779669',
          },
          {
            value: '430381',
            text: '湘乡市',
            center: '112.550268,27.718655',
          },
        ],
      },
      {
        value: '430200',
        text: '株洲市',
        center: '113.132783,27.828862',

        children: [
          {
            value: '430202',
            text: '荷塘区',
            center: '113.173169,27.856314',
          },
          {
            value: '430224',
            text: '茶陵县',
            center: '113.537907,26.777957',
          },
          {
            value: '430281',
            text: '醴陵市',
            center: '113.497119,27.6457',
          },
          {
            value: '430223',
            text: '攸县',
            center: '113.397152,27.01516',
          },
          {
            value: '430225',
            text: '炎陵县',
            center: '113.772665,26.489847',
          },
          {
            value: '430211',
            text: '天元区',
            center: '113.082227,27.826738',
          },
          {
            value: '430212',
            text: '渌口区',
            center: '113.143832,27.699361',
          },
          {
            value: '430203',
            text: '芦淞区',
            center: '113.153455,27.785198',
          },
          {
            value: '430204',
            text: '石峰区',
            center: '113.117763,27.875513',
          },
        ],
      },
      {
        value: '431100',
        text: '永州市',
        center: '111.613482,26.419861',

        children: [
          {
            value: '431128',
            text: '新田县',
            center: '112.203396,25.903965',
          },
          {
            value: '431103',
            text: '冷水滩区',
            center: '111.592373,26.461313',
          },
          {
            value: '431122',
            text: '东安县',
            center: '111.315893,26.392173',
          },
          {
            value: '431102',
            text: '零陵区',
            center: '111.629806,26.222278',
          },
          {
            value: '431126',
            text: '宁远县',
            center: '111.945925,25.570817',
          },
          {
            value: '431123',
            text: '双牌县',
            center: '111.659967,25.961909',
          },
          {
            value: '431125',
            text: '江永县',
            center: '111.343543,25.274461',
          },
          {
            value: '431124',
            text: '道县',
            center: '111.600866,25.526282',
          },
          {
            value: '431129',
            text: '江华瑶族自治县',
            center: '111.57951,25.185257',
          },
          {
            value: '431181',
            text: '祁阳市',
            center: '111.840253,26.580292',
          },
          {
            value: '431127',
            text: '蓝山县',
            center: '112.195842,25.369575',
          },
        ],
      },
      {
        value: '431000',
        text: '郴州市',
        center: '113.015517,25.770117',

        children: [
          {
            value: '431026',
            text: '汝城县',
            center: '113.685193,25.533024',
          },
          {
            value: '431027',
            text: '桂东县',
            center: '113.944792,26.077609',
          },
          {
            value: '431081',
            text: '资兴市',
            center: '113.235841,25.977226',
          },
          {
            value: '431002',
            text: '北湖区',
            center: '113.010606,25.784632',
          },
          {
            value: '431022',
            text: '宜章县',
            center: '112.948806,25.40059',
          },
          {
            value: '431025',
            text: '临武县',
            center: '112.563833,25.276459',
          },
          {
            value: '431028',
            text: '安仁县',
            center: '113.269703,26.708569',
          },
          {
            value: '431021',
            text: '桂阳县',
            center: '112.733804,25.75382',
          },
          {
            value: '431003',
            text: '苏仙区',
            center: '113.042364,25.799624',
          },
          {
            value: '431023',
            text: '永兴县',
            center: '113.116587,26.127155',
          },
          {
            value: '431024',
            text: '嘉禾县',
            center: '112.379216,25.616025',
          },
        ],
      },
      {
        value: '430500',
        text: '邵阳市',
        center: '111.467855,27.239528',

        children: [
          {
            value: '430524',
            text: '隆回县',
            center: '111.032437,27.113978',
          },
          {
            value: '430502',
            text: '双清区',
            center: '111.496946,27.232286',
          },
          {
            value: '430523',
            text: '邵阳县',
            center: '111.273872,26.990785',
          },
          {
            value: '430527',
            text: '绥宁县',
            center: '110.155532,26.582027',
          },
          {
            value: '430511',
            text: '北塔区',
            center: '111.451988,27.246244',
          },
          {
            value: '430503',
            text: '大祥区',
            center: '111.438892,27.222078',
          },
          {
            value: '430582',
            text: '邵东市',
            center: '111.744268,27.259812',
          },
          {
            value: '430528',
            text: '新宁县',
            center: '110.857294,26.432913',
          },
          {
            value: '430581',
            text: '武冈市',
            center: '110.632286,26.727414',
          },
          {
            value: '430525',
            text: '洞口县',
            center: '110.575962,27.060274',
          },
          {
            value: '430529',
            text: '城步苗族自治县',
            center: '110.322239,26.390598',
          },
          {
            value: '430522',
            text: '新邵县',
            center: '111.458656,27.320917',
          },
        ],
      },
      {
        value: '430800',
        text: '张家界市',
        center: '110.478887,29.117343',

        children: [
          {
            value: '430802',
            text: '永定区',
            center: '110.537379,29.119662',
          },
          {
            value: '430822',
            text: '桑植县',
            center: '110.204804,29.414112',
          },
          {
            value: '430811',
            text: '武陵源区',
            center: '110.550309,29.345721',
          },
          {
            value: '430821',
            text: '慈利县',
            center: '111.139424,29.430429',
          },
        ],
      },
      {
        value: '430100',
        text: '长沙市',
        center: '112.938882,28.228304',

        children: [
          {
            value: '430104',
            text: '岳麓区',
            center: '112.930116,28.234202',
          },
          {
            value: '430112',
            text: '望城区',
            center: '112.83125,28.353221',
          },
          {
            value: '430181',
            text: '浏阳市',
            center: '113.64328,28.163866',
          },
          {
            value: '430121',
            text: '长沙县',
            center: '113.080555,28.246821',
          },
          {
            value: '430103',
            text: '天心区',
            center: '112.98978,28.114544',
          },
          {
            value: '430182',
            text: '宁乡市',
            center: '112.551887,28.277709',
          },
          {
            value: '430105',
            text: '开福区',
            center: '112.985284,28.257286',
          },
          {
            value: '430102',
            text: '芙蓉区',
            center: '113.032605,28.185351',
          },
          {
            value: '430111',
            text: '雨花区',
            center: '113.03853,28.135795',
          },
        ],
      },
      {
        value: '431300',
        text: '娄底市',
        center: '111.994468,27.699838',

        children: [
          {
            value: '431321',
            text: '双峰县',
            center: '112.174623,27.457437',
          },
          {
            value: '431382',
            text: '涟源市',
            center: '111.663837,27.693813',
          },
          {
            value: '431322',
            text: '新化县',
            center: '111.327674,27.725416',
          },
          {
            value: '431381',
            text: '冷水江市',
            center: '111.459199,27.656017',
          },
          {
            value: '431302',
            text: '娄星区',
            center: '112.001922,27.730208',
          },
        ],
      },
    ],
  },
  {
    value: '460000',
    text: '海南省',
    center: '110.348781,20.018639',

    children: [
      {
        value: '469024',
        text: '临高县',
        center: '109.690508,19.912025',

        children: [
          {
            value: '469024',
            text: '博厚镇',
            center: '109.807195,19.989365',
          },
          {
            value: '469024',
            text: '南宝镇',
            center: '109.638149,19.751609',
          },
          {
            value: '469024',
            text: '和舍镇',
            center: '109.714907,19.671698',
          },
          {
            value: '469024',
            text: '东英镇',
            center: '109.612973,19.934938',
          },
          {
            value: '469024',
            text: '调楼镇',
            center: '109.609769,19.923138',
          },
          {
            value: '469024',
            text: '加来镇',
            center: '109.650909,19.759074',
          },
          {
            value: '469024',
            text: '临城镇',
            center: '109.632657,19.753184',
          },
          {
            value: '469024',
            text: '多文镇',
            center: '109.751742,19.673620',
          },
          {
            value: '469024',
            text: '新盈镇',
            center: '109.619413,19.864946',
          },
          {
            value: '469024',
            text: '皇桐镇',
            center: '109.856872,19.732264',
          },
          {
            value: '469024',
            text: '波莲镇',
            center: '109.614806,19.855541',
          },
        ],
      },
      {
        value: '469022',
        text: '屯昌县',
        center: '110.101667,19.351662',

        children: [
          {
            value: '469022',
            text: '西昌镇',
            center: '109.953863,19.415440',
          },
          {
            value: '469022',
            text: '南坤镇',
            center: '110.034905,19.407514',
          },
          {
            value: '469022',
            text: '坡心镇',
            center: '110.214429,19.310397',
          },
          {
            value: '469022',
            text: '南吕镇',
            center: '110.042989,19.268166',
          },
          {
            value: '469022',
            text: '乌坡镇',
            center: '110.083261,19.206717',
          },
          {
            value: '469022',
            text: '枫木镇',
            center: '109.973395,19.190743',
          },
          {
            value: '469022',
            text: '屯城镇',
            center: '110.180636,19.319861',
          },
          {
            value: '469022',
            text: '新兴镇',
            center: '110.136198,19.558967',
          },
        ],
      },
      {
        value: '469030',
        text: '琼中黎族苗族自治县',
        center: '109.838423,19.03327',

        children: [
          {
            value: '469030',
            text: '什运乡',
            center: '109.583026,18.923692',
          },
          {
            value: '469030',
            text: '上安乡',
            center: '109.712993,18.899738',
          },
          {
            value: '469030',
            text: '和平镇',
            center: '110.052562,18.755917',
          },
          {
            value: '469030',
            text: '吊罗山乡',
            center: '109.930063,18.865272',
          },
          {
            value: '469030',
            text: '黎母山镇',
            center: '109.824353,19.190837',
          },
          {
            value: '469030',
            text: '营根镇',
            center: '109.930582,19.089045',
          },
          {
            value: '469030',
            text: '长征镇',
            center: '109.793068,18.896296',
          },
          {
            value: '469030',
            text: '红毛镇',
            center: '109.608031,19.033716',
          },
          {
            value: '469030',
            text: '湾岭镇',
            center: '109.865175,19.096504',
          },
          {
            value: '469030',
            text: '中平镇',
            center: '110.032689,18.966494',
          },
        ],
      },
      {
        value: '469025',
        text: '白沙黎族自治县',
        center: '109.4429,19.221641',

        children: [
          {
            value: '469025',
            text: '南开乡',
            center: '109.293018,19.059602',
          },
          {
            value: '469025',
            text: '阜龙乡',
            center: '109.436387,19.331650',
          },
          {
            value: '469025',
            text: '细水乡',
            center: '109.526636,19.201248',
          },
          {
            value: '469025',
            text: '牙叉镇',
            center: '109.399183,19.138439',
          },
          {
            value: '469025',
            text: '元门乡',
            center: '109.449713,19.095705',
          },
          {
            value: '469025',
            text: '打安镇',
            center: '109.358207,19.378075',
          },
          {
            value: '469025',
            text: '金波乡',
            center: '109.171689,19.276555',
          },
          {
            value: '469025',
            text: '青松乡',
            center: '109.293018,19.059602',
          },
          {
            value: '469025',
            text: '七坊镇',
            center: '109.139587,19.311855',
          },
          {
            value: '469025',
            text: '邦溪镇',
            center: '109.043497,19.419968',
          },
          {
            value: '469025',
            text: '荣邦乡',
            center: '109.047772,19.432678',
          },
        ],
      },
      {
        value: '469002',
        text: '琼海市',
        center: '110.474524,19.259112',

        children: [
          {
            value: '469002',
            text: '龙江镇',
            center: '110.377839,19.152396',
          },
          {
            value: '469002',
            text: '长坡镇',
            center: '110.497644,19.427753',
          },
          {
            value: '469002',
            text: '阳江镇',
            center: '110.343829,19.128946',
          },
          {
            value: '469002',
            text: '石壁镇',
            center: '110.330819,19.151644',
          },
          {
            value: '469002',
            text: '会山镇',
            center: '110.153445,19.012397',
          },
          {
            value: '469002',
            text: '塔洋镇',
            center: '110.472088,19.325894',
          },
          {
            value: '469002',
            text: '潭门镇',
            center: '110.539051,19.210843',
          },
          {
            value: '469002',
            text: '大路镇',
            center: '110.529076,19.373803',
          },
          {
            value: '469002',
            text: '嘉积镇',
            center: '110.421334,19.291689',
          },
          {
            value: '469002',
            text: '博鳌镇',
            center: '110.492863,19.177047',
          },
          {
            value: '469002',
            text: '万泉镇',
            center: '110.414108,19.355227',
          },
          {
            value: '469002',
            text: '中原镇',
            center: '110.431959,19.060809',
          },
        ],
      },
      {
        value: '469007',
        text: '东方市',
        center: '108.651829,19.095187',

        children: [
          {
            value: '469007',
            text: '四更镇',
            center: '108.596055,19.187648',
          },
          {
            value: '469007',
            text: '新龙镇',
            center: '108.678972,19.017898',
          },
          {
            value: '469007',
            text: '三家镇',
            center: '108.833188,19.259935',
          },
          {
            value: '469007',
            text: '大田镇',
            center: '108.771554,19.042603',
          },
          {
            value: '469007',
            text: '八所镇',
            center: '108.780679,19.124742',
          },
          {
            value: '469007',
            text: '感城镇',
            center: '108.787859,18.842201',
          },
          {
            value: '469007',
            text: '板桥镇',
            center: '108.910695,18.807162',
          },
          {
            value: '469007',
            text: '天安乡',
            center: '108.804715,18.975480',
          },
          {
            value: '469007',
            text: '东河镇',
            center: '109.015044,19.084384',
          },
          {
            value: '469007',
            text: '江边乡',
            center: '109.091697,18.906129',
          },
        ],
      },
      {
        value: '469027',
        text: '乐东黎族自治县',
        center: '109.173384,18.750063',

        children: [
          {
            value: '469027',
            text: '莺歌海镇',
            center: '108.754600,18.546375',
          },
          {
            value: '469027',
            text: '佛罗镇',
            center: '108.789451,18.579735',
          },
          {
            value: '469027',
            text: '黄流镇',
            center: '108.804819,18.594264',
          },
          {
            value: '469027',
            text: '尖峰镇',
            center: '108.843833,18.624901',
          },
          {
            value: '469027',
            text: '志仲镇',
            center: '109.386810,18.609590',
          },
          {
            value: '469027',
            text: '大安镇',
            center: '109.231993,18.734953',
          },
          {
            value: '469027',
            text: '万冲镇',
            center: '109.331720,18.913271',
          },
          {
            value: '469027',
            text: '抱由镇',
            center: '109.027958,18.797154',
          },
          {
            value: '469027',
            text: '千家镇',
            center: '109.149747,18.465259',
          },
          {
            value: '469027',
            text: '九所镇',
            center: '109.080605,18.450650',
          },
          {
            value: '469027',
            text: '利国镇',
            center: '108.938223,18.495361',
          },
        ],
      },
      {
        value: '469006',
        text: '万宁市',
        center: '110.392605,18.793697',

        children: [
          {
            value: '469006',
            text: '后安镇',
            center: '110.374318,18.908719',
          },
          {
            value: '469006',
            text: '和乐镇',
            center: '110.415860,18.962463',
          },
          {
            value: '469006',
            text: '东澳镇',
            center: '110.429479,18.640771',
          },
          {
            value: '469006',
            text: '山根镇',
            center: '110.451557,18.990371',
          },
          {
            value: '469006',
            text: '龙滚镇',
            center: '110.475633,18.993293',
          },
          {
            value: '469006',
            text: '南桥镇',
            center: '110.030918,18.747164',
          },
          {
            value: '469006',
            text: '北大镇',
            center: '110.418437,18.985185',
          },
          {
            value: '469006',
            text: '三更罗镇',
            center: '110.113025,18.948777',
          },
          {
            value: '469006',
            text: '大茂镇',
            center: '110.391696,18.876747',
          },
          {
            value: '469006',
            text: '礼纪镇',
            center: '110.265921,18.748523',
          },
          {
            value: '469006',
            text: '万城镇',
            center: '110.412512,18.826291',
          },
          {
            value: '469006',
            text: '长丰镇',
            center: '110.281098,18.855580',
          },
        ],
      },
      {
        value: '469028',
        text: '陵水黎族自治县',
        center: '110.037553,18.506045',

        children: [
          {
            value: '469028',
            text: '椰林镇',
            center: '110.019690,18.482546',
          },
          {
            value: '469028',
            text: '文罗镇',
            center: '109.914457,18.573364',
          },
          {
            value: '469028',
            text: '黎安镇',
            center: '110.027365,18.450385',
          },
          {
            value: '469028',
            text: '新村镇',
            center: '110.026125,18.445965',
          },
          {
            value: '469028',
            text: '三才镇',
            center: '109.963149,18.491519',
          },
          {
            value: '469028',
            text: '群英乡',
            center: '109.847456,18.569653',
          },
          {
            value: '469028',
            text: '提蒙乡',
            center: '110.013235,18.640359',
          },
          {
            value: '469028',
            text: '隆广镇',
            center: '109.857549,18.480188',
          },
          {
            value: '469028',
            text: '英州镇',
            center: '109.875526,18.473898',
          },
          {
            value: '469028',
            text: '本号镇',
            center: '109.837130,18.632318',
          },
          {
            value: '469028',
            text: '光坡镇',
            center: '110.036496,18.559416',
          },
        ],
      },
      {
        value: '460300',
        text: '三沙市',
        center: '112.338649,16.831004',

        children: [
          {
            value: '460301',
            text: '西沙区',
            center: '112.346961,16.834372',
          },
          {
            value: '460302',
            text: '南沙区',
            center: '112.896229,9.548531',
          },
        ],
      },
      {
        value: '469005',
        text: '文昌市',
        center: '110.797473,19.544234',

        children: [
          {
            value: '469005',
            text: '文教镇',
            center: '110.855856,19.708320',
          },
          {
            value: '469005',
            text: '铺前镇',
            center: '110.675271,20.037734',
          },
          {
            value: '469005',
            text: '东郊镇',
            center: '110.910447,19.629115',
          },
          {
            value: '469005',
            text: '龙楼镇',
            center: '110.938472,19.660636',
          },
          {
            value: '469005',
            text: '昌洒镇',
            center: '110.894780,19.826152',
          },
          {
            value: '469005',
            text: '锦山镇',
            center: '110.664000,20.027062',
          },
          {
            value: '469005',
            text: '东路镇',
            center: '110.716883,19.722600',
          },
          {
            value: '469005',
            text: '冯坡镇',
            center: '110.790950,20.028869',
          },
          {
            value: '469005',
            text: '翁田镇',
            center: '110.808995,19.920147',
          },
          {
            value: '469005',
            text: '公坡镇',
            center: '110.826694,19.852259',
          },
          {
            value: '469005',
            text: '抱罗镇',
            center: '110.739711,19.888896',
          },
          {
            value: '469005',
            text: '东阁镇',
            center: '110.855599,19.705977',
          },
          {
            value: '469005',
            text: '文城镇',
            center: '110.702595,19.503784',
          },
          {
            value: '469005',
            text: '会文镇',
            center: '110.722572,19.484181',
          },
          {
            value: '469005',
            text: '潭牛镇',
            center: '110.773474,19.744417',
          },
          {
            value: '469005',
            text: '蓬莱镇',
            center: '110.509637,19.558919',
          },
          {
            value: '469005',
            text: '重兴镇',
            center: '110.569437,19.477879',
          },
        ],
      },
      {
        value: '460400',
        text: '儋州市',
        center: '109.580812,19.520948',

        children: [
          {
            value: '460400',
            text: '光村镇',
            center: '109.467340,19.903531',
          },
          {
            value: '460400',
            text: '海头镇',
            center: '109.028046,19.432317',
          },
          {
            value: '460400',
            text: '新州镇',
            center: '109.320933,19.752347',
          },
          {
            value: '460400',
            text: '中和镇',
            center: '109.351017,19.774675',
          },
          {
            value: '460400',
            text: '峨蔓镇',
            center: '109.332639,19.843794',
          },
          {
            value: '460400',
            text: '三都镇',
            center: '109.204266,19.830050',
          },
          {
            value: '460400',
            text: '王五镇',
            center: '109.277591,19.624562',
          },
          {
            value: '460400',
            text: '木棠镇',
            center: '109.346666,19.900381',
          },
          {
            value: '460400',
            text: '东成镇',
            center: '109.597935,19.726594',
          },
          {
            value: '460400',
            text: '白马井镇',
            center: '109.232173,19.580719',
          },
          {
            value: '460400',
            text: '排浦镇',
            center: '109.219523,19.631492',
          },
          {
            value: '460400',
            text: '雅星镇',
            center: '109.305133,19.393438',
          },
          {
            value: '460400',
            text: '和庆镇',
            center: '109.739681,19.587333',
          },
          {
            value: '460400',
            text: '大成镇',
            center: '109.371806,19.478206',
          },
          {
            value: '460400',
            text: '那大镇',
            center: '109.559561,19.500110',
          },
          {
            value: '460400',
            text: '兰洋镇',
            center: '109.735770,19.408360',
          },
          {
            value: '460400',
            text: '南丰镇',
            center: '109.543297,19.504378',
          },
        ],
      },
      {
        value: '460200',
        text: '三亚市',
        center: '109.511709,18.252865',

        children: [
          {
            value: '460202',
            text: '海棠区',
            center: '109.735676,18.384177',
          },
          {
            value: '460205',
            text: '崖州区',
            center: '109.172298,18.357572',
          },
          {
            value: '460204',
            text: '天涯区',
            center: '109.452325,18.298975',
          },
          {
            value: '460203',
            text: '吉阳区',
            center: '109.578238,18.28146',
          },
        ],
      },
      {
        value: '469029',
        text: '保亭黎族苗族自治县',
        center: '109.700279,18.640339',

        children: [
          {
            value: '469029',
            text: '南林乡',
            center: '109.576563,18.389262',
          },
          {
            value: '469029',
            text: '毛感乡',
            center: '109.503131,18.556288',
          },
          {
            value: '469029',
            text: '加茂镇',
            center: '109.674549,18.516922',
          },
          {
            value: '469029',
            text: '六弓乡',
            center: '109.744740,18.574041',
          },
          {
            value: '469029',
            text: '什玲镇',
            center: '109.736545,18.697785',
          },
          {
            value: '469029',
            text: '新政镇',
            center: '109.603989,18.435464',
          },
          {
            value: '469029',
            text: '保城镇',
            center: '109.773883,18.600774',
          },
          {
            value: '469029',
            text: '响水镇',
            center: '109.550646,18.610753',
          },
          {
            value: '469029',
            text: '三道镇',
            center: '109.702909,18.430953',
          },
        ],
      },
      {
        value: '469001',
        text: '五指山市',
        center: '109.516784,18.774827',

        children: [
          {
            value: '469001',
            text: '毛阳镇',
            center: '109.449705,18.881089',
          },
          {
            value: '469001',
            text: '水满乡',
            center: '109.600698,18.899478',
          },
          {
            value: '469001',
            text: '毛道乡',
            center: '109.356022,18.713388',
          },
          {
            value: '469001',
            text: '番阳镇',
            center: '109.333537,18.913174',
          },
          {
            value: '469001',
            text: '南圣镇',
            center: '109.684604,18.822608',
          },
          {
            value: '469001',
            text: '通什镇',
            center: '109.623006,18.822353',
          },
          {
            value: '469001',
            text: '畅好乡',
            center: '109.383431,18.682307',
          },
        ],
      },
      {
        value: '469023',
        text: '澄迈县',
        center: '110.007497,19.738885',

        children: [
          {
            value: '469023',
            text: '老城镇',
            center: '110.152799,19.872233',
          },
          {
            value: '469023',
            text: '大丰镇',
            center: '109.988855,19.904039',
          },
          {
            value: '469023',
            text: '瑞溪镇',
            center: '110.111302,19.789006',
          },
          {
            value: '469023',
            text: '中兴镇',
            center: '109.760023,19.528937',
          },
          {
            value: '469023',
            text: '仁兴镇',
            center: '109.776963,19.382054',
          },
          {
            value: '469023',
            text: '加乐镇',
            center: '110.061273,19.617646',
          },
          {
            value: '469023',
            text: '福山镇',
            center: '109.919175,19.929023',
          },
          {
            value: '469023',
            text: '文儒镇',
            center: '110.134745,19.633652',
          },
          {
            value: '469023',
            text: '桥头镇',
            center: '109.936766,19.914013',
          },
          {
            value: '469023',
            text: '金江镇',
            center: '109.976112,19.774256',
          },
          {
            value: '469023',
            text: '永发镇',
            center: '110.186668,19.641706',
          },
        ],
      },
      {
        value: '469026',
        text: '昌江黎族自治县',
        center: '109.055783,19.298139',

        children: [
          {
            value: '469026',
            text: '乌烈镇',
            center: '108.809852,19.352543',
          },
          {
            value: '469026',
            text: '石碌镇',
            center: '108.997547,19.244929',
          },
          {
            value: '469026',
            text: '叉河镇',
            center: '108.997547,19.244929',
          },
          {
            value: '469026',
            text: '昌化镇',
            center: '108.731720,19.383636',
          },
          {
            value: '469026',
            text: '王下乡',
            center: '109.094025,18.905182',
          },
          {
            value: '469026',
            text: '十月田镇',
            center: '108.842173,19.252501',
          },
          {
            value: '469026',
            text: '七叉镇',
            center: '109.077512,19.190357',
          },
          {
            value: '469026',
            text: '海尾镇',
            center: '108.952319,19.494543',
          },
        ],
      },
      {
        value: '469021',
        text: '定安县',
        center: '110.358001,19.681215',

        children: [
          {
            value: '469021',
            text: '岭口镇',
            center: '110.276026,19.360104',
          },
          {
            value: '469021',
            text: '龙门镇',
            center: '110.297826,19.499676',
          },
          {
            value: '469021',
            text: '定城镇',
            center: '110.317065,19.701678',
          },
          {
            value: '469021',
            text: '黄竹镇',
            center: '110.348146,19.445919',
          },
          {
            value: '469021',
            text: '新竹镇',
            center: '110.165312,19.577271',
          },
          {
            value: '469021',
            text: '雷鸣镇',
            center: '110.300530,19.498361',
          },
          {
            value: '469021',
            text: '龙河镇',
            center: '110.258715,19.361056',
          },
          {
            value: '469021',
            text: '龙湖镇',
            center: '110.401131,19.606699',
          },
          {
            value: '469021',
            text: '富文镇',
            center: '110.223762,19.422974',
          },
          {
            value: '469021',
            text: '翰林镇',
            center: '110.285870,19.349021',
          },
        ],
      },
      {
        value: '460100',
        text: '海口市',
        center: '110.198418,20.045805',

        children: [
          {
            value: '460108',
            text: '美兰区',
            center: '110.366359,20.028983',
          },
          {
            value: '460107',
            text: '琼山区',
            center: '110.384318,19.984293',
          },
          {
            value: '460106',
            text: '龙华区',
            center: '110.328628,20.030843',
          },
          {
            value: '460105',
            text: '秀英区',
            center: '110.293566,20.007703',
          },
        ],
      },
    ],
  },
  {
    value: '320000',
    text: '江苏省',
    center: '118.763563,32.061377',

    children: [
      {
        value: '320600',
        text: '南通市',
        center: '120.894522,31.981269',

        children: [
          {
            value: '320623',
            text: '如东县',
            center: '121.18495,32.331584',
          },
          {
            value: '320613',
            text: '崇川区',
            center: '120.857253,32.010277',
          },
          {
            value: '320681',
            text: '启东市',
            center: '121.65523,31.792831',
          },
          {
            value: '320614',
            text: '海门区',
            center: '121.182016,31.869418',
          },
          {
            value: '320612',
            text: '通州区',
            center: '121.073742,32.065972',
          },
          {
            value: '320682',
            text: '如皋市',
            center: '120.574028,32.371493',
          },
          {
            value: '320685',
            text: '海安市',
            center: '120.46779,32.532853',
          },
        ],
      },
      {
        value: '320700',
        text: '连云港市',
        center: '119.221487,34.596639',

        children: [
          {
            value: '320707',
            text: '赣榆区',
            center: '119.173173,34.841336',
          },
          {
            value: '320724',
            text: '灌南县',
            center: '119.315583,34.087251',
          },
          {
            value: '320703',
            text: '连云区',
            center: '119.338901,34.760317',
          },
          {
            value: '320723',
            text: '灌云县',
            center: '119.239426,34.284074',
          },
          {
            value: '320706',
            text: '海州区',
            center: '119.163492,34.572506',
          },
          {
            value: '320722',
            text: '东海县',
            center: '118.752869,34.542194',
          },
        ],
      },
      {
        value: '321300',
        text: '宿迁市',
        center: '118.275228,33.963186',

        children: [
          {
            value: '321323',
            text: '泗阳县',
            center: '118.703636,33.723576',
          },
          {
            value: '321324',
            text: '泗洪县',
            center: '118.223941,33.476575',
          },
          {
            value: '321311',
            text: '宿豫区',
            center: '118.330423,33.94813',
          },
          {
            value: '321302',
            text: '宿城区',
            center: '118.242048,33.963891',
          },
          {
            value: '321322',
            text: '沭阳县',
            center: '118.804321,34.110642',
          },
        ],
      },
      {
        value: '320800',
        text: '淮安市',
        center: '119.113166,33.551495',

        children: [
          {
            value: '320804',
            text: '淮阴区',
            center: '119.034895,33.632588',
          },
          {
            value: '320830',
            text: '盱眙县',
            center: '118.544545,33.011905',
          },
          {
            value: '320826',
            text: '涟水县',
            center: '119.260589,33.781648',
          },
          {
            value: '320831',
            text: '金湖县',
            center: '119.020432,33.024663',
          },
          {
            value: '320813',
            text: '洪泽区',
            center: '118.873132,33.294095',
          },
          {
            value: '320803',
            text: '淮安区',
            center: '119.141183,33.50296',
          },
          {
            value: '320812',
            text: '清江浦区',
            center: '119.026662,33.552579',
          },
        ],
      },
      {
        value: '321100',
        text: '镇江市',
        center: '119.424441,32.188141',

        children: [
          {
            value: '321182',
            text: '扬中市',
            center: '119.796816,32.236476',
          },
          {
            value: '321111',
            text: '润州区',
            center: '119.411383,32.195146',
          },
          {
            value: '321112',
            text: '丹徒区',
            center: '119.433854,32.132118',
          },
          {
            value: '321183',
            text: '句容市',
            center: '119.168693,31.945732',
          },
          {
            value: '321181',
            text: '丹阳市',
            center: '119.606071,32.010035',
          },
          {
            value: '321102',
            text: '京口区',
            center: '119.470186,32.198285',
          },
        ],
      },
      {
        value: '320100',
        text: '南京市',
        center: '118.796624,32.059344',

        children: [
          {
            value: '320115',
            text: '江宁区',
            center: '118.83951,31.953195',
          },
          {
            value: '320114',
            text: '雨花台区',
            center: '118.779087,31.991291',
          },
          {
            value: '320118',
            text: '高淳区',
            center: '118.892074,31.328678',
          },
          {
            value: '320117',
            text: '溧水区',
            center: '119.028414,31.651108',
          },
          {
            value: '320105',
            text: '建邺区',
            center: '118.731642,32.003343',
          },
          {
            value: '320116',
            text: '六合区',
            center: '118.822241,32.323235',
          },
          {
            value: '320106',
            text: '鼓楼区',
            center: '118.769943,32.066814',
          },
          {
            value: '320104',
            text: '秦淮区',
            center: '118.794792,32.039065',
          },
          {
            value: '320111',
            text: '浦口区',
            center: '118.627165,32.059796',
          },
          {
            value: '320102',
            text: '玄武区',
            center: '118.797779,32.048644',
          },
          {
            value: '320113',
            text: '栖霞区',
            center: '118.909117,32.096423',
          },
        ],
      },
      {
        value: '320900',
        text: '盐城市',
        center: '120.16263,33.348176',

        children: [
          {
            value: '320924',
            text: '射阳县',
            center: '120.326338,33.766277',
          },
          {
            value: '320922',
            text: '滨海县',
            center: '119.820713,33.990372',
          },
          {
            value: '320921',
            text: '响水县',
            center: '119.578332,34.199172',
          },
          {
            value: '320981',
            text: '东台市',
            center: '120.320308,32.867845',
          },
          {
            value: '320925',
            text: '建湖县',
            center: '119.788743,33.438931',
          },
          {
            value: '320923',
            text: '阜宁县',
            center: '119.802271,33.758857',
          },
          {
            value: '320903',
            text: '盐都区',
            center: '120.153567,33.338538',
          },
          {
            value: '320904',
            text: '大丰区',
            center: '120.500761,33.200047',
          },
          {
            value: '320902',
            text: '亭湖区',
            center: '120.196148,33.391414',
          },
        ],
      },
      {
        value: '320200',
        text: '无锡市',
        center: '120.311889,31.491064',

        children: [
          {
            value: '320282',
            text: '宜兴市',
            center: '119.821873,31.338429',
          },
          {
            value: '320211',
            text: '滨湖区',
            center: '120.284381,31.527846',
          },
          {
            value: '320213',
            text: '梁溪区',
            center: '120.303551,31.566226',
          },
          {
            value: '320206',
            text: '惠山区',
            center: '120.29843,31.680282',
          },
          {
            value: '320281',
            text: '江阴市',
            center: '120.284794,31.921642',
          },
          {
            value: '320214',
            text: '新吴区',
            center: '120.364303,31.49085',
          },
          {
            value: '320205',
            text: '锡山区',
            center: '120.357732,31.589484',
          },
        ],
      },
      {
        value: '320400',
        text: '常州市',
        center: '119.974092,31.811313',

        children: [
          {
            value: '320413',
            text: '金坛区',
            center: '119.587503,31.722384',
          },
          {
            value: '320412',
            text: '武进区',
            center: '119.942441,31.701252',
          },
          {
            value: '320481',
            text: '溧阳市',
            center: '119.484164,31.416967',
          },
          {
            value: '320411',
            text: '新北区',
            center: '119.960925,31.86355',
          },
          {
            value: '320404',
            text: '钟楼区',
            center: '119.902081,31.802608',
          },
          {
            value: '320402',
            text: '天宁区',
            center: '119.999439,31.79232',
          },
        ],
      },
      {
        value: '321200',
        text: '泰州市',
        center: '119.922883,32.456692',

        children: [
          {
            value: '321202',
            text: '海陵区',
            center: '119.923825,32.49248',
          },
          {
            value: '321282',
            text: '靖江市',
            center: '120.277124,31.98325',
          },
          {
            value: '321204',
            text: '姜堰区',
            center: '120.12807,32.51029',
          },
          {
            value: '321203',
            text: '高港区',
            center: '119.88154,32.31923',
          },
          {
            value: '321283',
            text: '泰兴市',
            center: '120.051475,32.173072',
          },
          {
            value: '321281',
            text: '兴化市',
            center: '119.85255,32.911952',
          },
        ],
      },
      {
        value: '321000',
        text: '扬州市',
        center: '119.412834,32.394404',

        children: [
          {
            value: '321023',
            text: '宝应县',
            center: '119.358389,33.241125',
          },
          {
            value: '321002',
            text: '广陵区',
            center: '119.431785,32.395654',
          },
          {
            value: '321081',
            text: '仪征市',
            center: '119.184468,32.272833',
          },
          {
            value: '321003',
            text: '邗江区',
            center: '119.397935,32.37741',
          },
          {
            value: '321084',
            text: '高邮市',
            center: '119.45892,32.781606',
          },
          {
            value: '321012',
            text: '江都区',
            center: '119.569684,32.43571',
          },
        ],
      },
      {
        value: '320300',
        text: '徐州市',
        center: '117.283752,34.204224',

        children: [
          {
            value: '320305',
            text: '贾汪区',
            center: '117.465137,34.436492',
          },
          {
            value: '320312',
            text: '铜山区',
            center: '117.169698,34.181162',
          },
          {
            value: '320311',
            text: '泉山区',
            center: '117.194405,34.22655',
          },
          {
            value: '320324',
            text: '睢宁县',
            center: '117.941364,33.913727',
          },
          {
            value: '320302',
            text: '鼓楼区',
            center: '117.185643,34.288736',
          },
          {
            value: '320303',
            text: '云龙区',
            center: '117.251515,34.253638',
          },
          {
            value: '320322',
            text: '沛县',
            center: '116.936353,34.760761',
          },
          {
            value: '320321',
            text: '丰县',
            center: '116.658111,34.697232',
          },
          {
            value: '320381',
            text: '新沂市',
            center: '118.354747,34.369585',
          },
          {
            value: '320382',
            text: '邳州市',
            center: '118.012511,34.339208',
          },
        ],
      },
      {
        value: '320500',
        text: '苏州市',
        center: '120.585294,31.299758',

        children: [
          {
            value: '320508',
            text: '姑苏区',
            center: '120.617367,31.335648',
          },
          {
            value: '320505',
            text: '虎丘区',
            center: '120.434238,31.329601',
          },
          {
            value: '320506',
            text: '吴中区',
            center: '120.632094,31.263604',
          },
          {
            value: '320585',
            text: '太仓市',
            center: '121.130344,31.458043',
          },
          {
            value: '320583',
            text: '昆山市',
            center: '120.980795,31.385476',
          },
          {
            value: '320507',
            text: '相城区',
            center: '120.642391,31.369189',
          },
          {
            value: '320581',
            text: '常熟市',
            center: '120.752512,31.656016',
          },
          {
            value: '320582',
            text: '张家港市',
            center: '120.555979,31.876739',
          },
          {
            value: '320509',
            text: '吴江区',
            center: '120.645728,31.138525',
          },
        ],
      },
    ],
  },
  {
    value: '630000',
    text: '青海省',
    center: '101.780482,36.622538',

    children: [
      {
        value: '630200',
        text: '海东市',
        center: '102.41064,36.473448',

        children: [
          {
            value: '630202',
            text: '乐都区',
            center: '102.401614,36.482242',
          },
          {
            value: '630222',
            text: '民和回族土族自治县',
            center: '102.830775,36.320038',
          },
          {
            value: '630225',
            text: '循化撒拉族自治县',
            center: '102.488958,35.851079',
          },
          {
            value: '630203',
            text: '平安区',
            center: '102.108538,36.500166',
          },
          {
            value: '630223',
            text: '互助土族自治县',
            center: '101.958519,36.844027',
          },
          {
            value: '630224',
            text: '化隆回族自治县',
            center: '102.266007,36.096124',
          },
        ],
      },
      {
        value: '632500',
        text: '海南藏族自治州',
        center: '100.622647,36.296399',

        children: [
          {
            value: '632523',
            text: '贵德县',
            center: '101.43403,36.039672',
          },
          {
            value: '632525',
            text: '贵南县',
            center: '100.747731,35.587239',
          },
          {
            value: '632522',
            text: '同德县',
            center: '100.577859,35.254297',
          },
          {
            value: '632521',
            text: '共和县',
            center: '100.619405,36.284158',
          },
          {
            value: '632524',
            text: '兴海县',
            center: '99.987799,35.589086',
          },
        ],
      },
      {
        value: '632800',
        text: '海西蒙古族藏族自治州',
        center: '97.33197,37.348114',

        children: [
          {
            value: '632823',
            text: '天峻县',
            center: '99.02297,37.301206',
          },
          {
            value: '632802',
            text: '德令哈市',
            center: '97.361528,37.369865',
          },
          {
            value: '632801',
            text: '格尔木市',
            center: '94.928293,36.407272',
          },
          {
            value: '632822',
            text: '都兰县',
            center: '98.095889,36.302098',
          },
          {
            value: '632821',
            text: '乌兰县',
            center: '98.47988,36.941279',
          },
          {
            value: '632825',
            text: '海西蒙古族藏族自治州直辖',
            center: '95.357233,37.853631',
          },
          {
            value: '632803',
            text: '茫崖市',
            center: '90.856372,38.247537',
          },
        ],
      },
      {
        value: '632700',
        text: '玉树藏族自治州',
        center: '97.006292,33.006308',

        children: [
          {
            value: '632724',
            text: '治多县',
            center: '95.618954,33.844854',
          },
          {
            value: '632726',
            text: '曲麻莱县',
            center: '95.805463,34.137353',
          },
          {
            value: '632723',
            text: '称多县',
            center: '97.109487,33.377504',
          },
          {
            value: '632722',
            text: '杂多县',
            center: '95.300723,32.893185',
          },
          {
            value: '632701',
            text: '玉树市',
            center: '97.009184,32.992934',
          },
          {
            value: '632725',
            text: '囊谦县',
            center: '96.489538,32.203193',
          },
        ],
      },
      {
        value: '632300',
        text: '黄南藏族自治州',
        center: '102.015397,35.519317',

        children: [
          {
            value: '632301',
            text: '同仁市',
            center: '102.018663,35.515769',
          },
          {
            value: '632323',
            text: '泽库县',
            center: '101.466565,35.035322',
          },
          {
            value: '632322',
            text: '尖扎县',
            center: '102.040094,35.943253',
          },
          {
            value: '632324',
            text: '河南蒙古族自治县',
            center: '101.617719,34.734777',
          },
        ],
      },
      {
        value: '632600',
        text: '果洛藏族自治州',
        center: '100.245161,34.472179',

        children: [
          {
            value: '632621',
            text: '玛沁县',
            center: '100.238873,34.478049',
          },
          {
            value: '632623',
            text: '甘德县',
            center: '99.900923,33.969216',
          },
          {
            value: '632624',
            text: '达日县',
            center: '99.651863,33.739293',
          },
          {
            value: '632625',
            text: '久治县',
            center: '101.482831,33.429471',
          },
          {
            value: '632622',
            text: '班玛县',
            center: '100.737138,32.932723',
          },
          {
            value: '632626',
            text: '玛多县',
            center: '98.209217,34.915645',
          },
        ],
      },
      {
        value: '630100',
        text: '西宁市',
        center: '101.777795,36.616621',

        children: [
          {
            value: '630123',
            text: '湟源县',
            center: '101.256464,36.682426',
          },
          {
            value: '630121',
            text: '大通回族土族自治县',
            center: '101.685503,36.926872',
          },
          {
            value: '630104',
            text: '城西区',
            center: '101.765915,36.628288',
          },
          {
            value: '630105',
            text: '城北区',
            center: '101.766308,36.650064',
          },
          {
            value: '630102',
            text: '城东区',
            center: '101.803717,36.599744',
          },
          {
            value: '630103',
            text: '城中区',
            center: '101.705357,36.545545',
          },
          {
            value: '630106',
            text: '湟中区',
            center: '101.571683,36.501291',
          },
        ],
      },
      {
        value: '632200',
        text: '海北藏族自治州',
        center: '100.900944,36.954612',

        children: [
          {
            value: '632223',
            text: '海晏县',
            center: '100.994521,36.896667',
          },
          {
            value: '632221',
            text: '门源回族自治县',
            center: '101.611524,37.388567',
          },
          {
            value: '632224',
            text: '刚察县',
            center: '100.145662,37.325096',
          },
          {
            value: '632222',
            text: '祁连县',
            center: '100.253211,38.177112',
          },
        ],
      },
    ],
  },
  {
    value: '450000',
    text: '广西壮族自治区',
    center: '108.327537,22.816659',

    children: [
      {
        value: '451000',
        text: '百色市',
        center: '106.61869,23.90307',

        children: [
          {
            value: '451028',
            text: '乐业县',
            center: '106.556564,24.776812',
          },
          {
            value: '451031',
            text: '隆林各族自治县',
            center: '105.343816,24.770649',
          },
          {
            value: '451030',
            text: '西林县',
            center: '105.097229,24.50762',
          },
          {
            value: '451027',
            text: '凌云县',
            center: '106.56114,24.347444',
          },
          {
            value: '451002',
            text: '右江区',
            center: '106.618151,23.900804',
          },
          {
            value: '451082',
            text: '平果市',
            center: '107.589768,23.329815',
          },
          {
            value: '451081',
            text: '靖西市',
            center: '106.417666,23.134375',
          },
          {
            value: '451026',
            text: '那坡县',
            center: '105.83234,23.387997',
          },
          {
            value: '451029',
            text: '田林县',
            center: '106.22874,24.294627',
          },
          {
            value: '451022',
            text: '田东县',
            center: '107.125609,23.596706',
          },
          {
            value: '451003',
            text: '田阳区',
            center: '106.915424,23.735631',
          },
          {
            value: '451024',
            text: '德保县',
            center: '106.615087,23.324084',
          },
        ],
      },
      {
        value: '450700',
        text: '钦州市',
        center: '108.654355,21.980894',

        children: [
          {
            value: '450702',
            text: '钦南区',
            center: '108.657427,21.940438',
          },
          {
            value: '450703',
            text: '钦北区',
            center: '108.638738,22.0024',
          },
          {
            value: '450721',
            text: '灵山县',
            center: '109.290698,22.416671',
          },
          {
            value: '450722',
            text: '浦北县',
            center: '109.556232,22.271902',
          },
        ],
      },
      {
        value: '450500',
        text: '北海市',
        center: '109.120248,21.481305',

        children: [
          {
            value: '450503',
            text: '银海区',
            center: '109.139689,21.449729',
          },
          {
            value: '450512',
            text: '铁山港区',
            center: '109.422099,21.529878',
          },
          {
            value: '450502',
            text: '海城区',
            center: '109.117256,21.474914',
          },
          {
            value: '450521',
            text: '合浦县',
            center: '109.207236,21.66132',
          },
        ],
      },
      {
        value: '450400',
        text: '梧州市',
        center: '111.279022,23.476733',

        children: [
          {
            value: '450423',
            text: '蒙山县',
            center: '110.525003,24.193567',
          },
          {
            value: '450406',
            text: '龙圩区',
            center: '111.247514,23.414869',
          },
          {
            value: '450481',
            text: '岑溪市',
            center: '110.994955,22.918327',
          },
          {
            value: '450405',
            text: '长洲区',
            center: '111.274276,23.486279',
          },
          {
            value: '450422',
            text: '藤县',
            center: '110.914606,23.375538',
          },
          {
            value: '450421',
            text: '苍梧县',
            center: '111.547244,23.868208',
          },
          {
            value: '450403',
            text: '万秀区',
            center: '111.318065,23.470543',
          },
        ],
      },
      {
        value: '451400',
        text: '崇左市',
        center: '107.364973,22.377139',

        children: [
          {
            value: '451421',
            text: '扶绥县',
            center: '107.90389,22.635542',
          },
          {
            value: '451402',
            text: '江州区',
            center: '107.353694,22.40609',
          },
          {
            value: '451423',
            text: '龙州县',
            center: '106.854001,22.343591',
          },
          {
            value: '451481',
            text: '凭祥市',
            center: '106.766715,22.094421',
          },
          {
            value: '451422',
            text: '宁明县',
            center: '107.076394,22.140242',
          },
          {
            value: '451424',
            text: '大新县',
            center: '107.200654,22.829287',
          },
          {
            value: '451425',
            text: '天等县',
            center: '107.143539,23.080818',
          },
        ],
      },
      {
        value: '450600',
        text: '防城港市',
        center: '108.35467,21.686732',

        children: [
          {
            value: '450602',
            text: '港口区',
            center: '108.380273,21.643426',
          },
          {
            value: '450681',
            text: '东兴市',
            center: '107.971828,21.547821',
          },
          {
            value: '450621',
            text: '上思县',
            center: '107.983627,22.153671',
          },
          {
            value: '450603',
            text: '防城区',
            center: '108.353978,21.768826',
          },
        ],
      },
      {
        value: '450100',
        text: '南宁市',
        center: '108.366407,22.8177',

        children: [
          {
            value: '450124',
            text: '马山县',
            center: '108.177764,23.708448',
          },
          {
            value: '450125',
            text: '上林县',
            center: '108.605089,23.432451',
          },
          {
            value: '450110',
            text: '武鸣区',
            center: '108.274869,23.159257',
          },
          {
            value: '450126',
            text: '宾阳县',
            center: '108.810336,23.217771',
          },
          {
            value: '450105',
            text: '江南区',
            center: '108.273206,22.781166',
          },
          {
            value: '450109',
            text: '邕宁区',
            center: '108.487438,22.758633',
          },
          {
            value: '450108',
            text: '良庆区',
            center: '108.393889,22.753613',
          },
          {
            value: '450107',
            text: '西乡塘区',
            center: '108.31344,22.833852',
          },
          {
            value: '450123',
            text: '隆安县',
            center: '107.695721,23.166356',
          },
          {
            value: '450181',
            text: '横州市',
            center: '109.262448,22.681257',
          },
          {
            value: '450102',
            text: '兴宁区',
            center: '108.368071,22.85354',
          },
          {
            value: '450103',
            text: '青秀区',
            center: '108.495204,22.785833',
          },
        ],
      },
      {
        value: '451300',
        text: '来宾市',
        center: '109.221243,23.750105',

        children: [
          {
            value: '451322',
            text: '象州县',
            center: '109.704852,23.973832',
          },
          {
            value: '451324',
            text: '金秀瑶族自治县',
            center: '110.190354,24.130509',
          },
          {
            value: '451381',
            text: '合山市',
            center: '108.885829,23.807032',
          },
          {
            value: '451302',
            text: '兴宾区',
            center: '109.183284,23.727647',
          },
          {
            value: '451323',
            text: '武宣县',
            center: '109.663153,23.594444',
          },
          {
            value: '451321',
            text: '忻城县',
            center: '108.665641,24.066176',
          },
        ],
      },
      {
        value: '450300',
        text: '桂林市',
        center: '110.179752,25.235615',

        children: [
          {
            value: '450305',
            text: '七星区',
            center: '110.317576,25.253093',
          },
          {
            value: '450327',
            text: '灌阳县',
            center: '111.160764,25.489419',
          },
          {
            value: '450329',
            text: '资源县',
            center: '110.652612,26.042452',
          },
          {
            value: '450332',
            text: '恭城瑶族自治县',
            center: '110.82841,24.831581',
          },
          {
            value: '450330',
            text: '平乐县',
            center: '110.632867,24.622814',
          },
          {
            value: '450325',
            text: '兴安县',
            center: '110.672013,25.612576',
          },
          {
            value: '450324',
            text: '全州县',
            center: '111.087089,25.94939',
          },
          {
            value: '450326',
            text: '永福县',
            center: '109.982974,24.980447',
          },
          {
            value: '450328',
            text: '龙胜各族自治县',
            center: '110.011662,25.79803',
          },
          {
            value: '450381',
            text: '荔浦市',
            center: '110.395232,24.48843',
          },
          {
            value: '450321',
            text: '阳朔县',
            center: '110.496305,24.778785',
          },
          {
            value: '450312',
            text: '临桂区',
            center: '110.212425,25.238556',
          },
          {
            value: '450302',
            text: '秀峰区',
            center: '110.264102,25.273954',
          },
          {
            value: '450304',
            text: '象山区',
            center: '110.281223,25.261585',
          },
          {
            value: '450311',
            text: '雁山区',
            center: '110.286611,25.101798',
          },
          {
            value: '450303',
            text: '叠彩区',
            center: '110.301489,25.314158',
          },
          {
            value: '450323',
            text: '灵川县',
            center: '110.319837,25.3948',
          },
        ],
      },
      {
        value: '451100',
        text: '贺州市',
        center: '111.567216,24.404182',

        children: [
          {
            value: '451123',
            text: '富川瑶族自治县',
            center: '111.296012,24.811601',
          },
          {
            value: '451122',
            text: '钟山县',
            center: '111.303085,24.526041',
          },
          {
            value: '451102',
            text: '八步区',
            center: '111.552029,24.411822',
          },
          {
            value: '451121',
            text: '昭平县',
            center: '110.811158,24.169675',
          },
          {
            value: '451103',
            text: '平桂区',
            center: '111.479839,24.453094',
          },
        ],
      },
      {
        value: '450800',
        text: '贵港市',
        center: '109.598903,23.11182',

        children: [
          {
            value: '450803',
            text: '港南区',
            center: '109.599357,23.075816',
          },
          {
            value: '450821',
            text: '平南县',
            center: '110.392489,23.540413',
          },
          {
            value: '450881',
            text: '桂平市',
            center: '110.079315,23.394208',
          },
          {
            value: '450802',
            text: '港北区',
            center: '109.572227,23.11136',
          },
          {
            value: '450804',
            text: '覃塘区',
            center: '109.452668,23.127405',
          },
        ],
      },
      {
        value: '451200',
        text: '河池市',
        center: '108.63639,24.48523',

        children: [
          {
            value: '451222',
            text: '天峨县',
            center: '107.172287,24.999181',
          },
          {
            value: '451225',
            text: '罗城仫佬族自治县',
            center: '108.904613,24.777501',
          },
          {
            value: '451223',
            text: '凤山县',
            center: '107.042157,24.546913',
          },
          {
            value: '451224',
            text: '东兰县',
            center: '107.374259,24.510698',
          },
          {
            value: '451229',
            text: '大化瑶族自治县',
            center: '107.998151,23.735699',
          },
          {
            value: '451228',
            text: '都安瑶族自治县',
            center: '108.105229,23.932704',
          },
          {
            value: '451226',
            text: '环江毛南族自治县',
            center: '108.258426,24.825923',
          },
          {
            value: '451221',
            text: '南丹县',
            center: '107.540578,24.975066',
          },
          {
            value: '451202',
            text: '金城江区',
            center: '108.085166,24.692865',
          },
          {
            value: '451203',
            text: '宜州区',
            center: '108.611303,24.500981',
          },
          {
            value: '451227',
            text: '巴马瑶族自治县',
            center: '107.258671,24.142216',
          },
        ],
      },
      {
        value: '450200',
        text: '柳州市',
        center: '109.428071,24.326442',

        children: [
          {
            value: '450226',
            text: '三江侗族自治县',
            center: '109.607675,25.783197',
          },
          {
            value: '450225',
            text: '融水苗族自治县',
            center: '109.256609,25.066624',
          },
          {
            value: '450224',
            text: '融安县',
            center: '109.397538,25.224549',
          },
          {
            value: '450222',
            text: '柳城县',
            center: '109.267125,24.654329',
          },
          {
            value: '450206',
            text: '柳江区',
            center: '109.326365,24.255644',
          },
          {
            value: '450223',
            text: '鹿寨县',
            center: '109.750527,24.472897',
          },
          {
            value: '450202',
            text: '城中区',
            center: '109.427398,24.366964',
          },
          {
            value: '450205',
            text: '柳北区',
            center: '109.402009,24.362611',
          },
          {
            value: '450203',
            text: '鱼峰区',
            center: '109.452781,24.318276',
          },
          {
            value: '450204',
            text: '柳南区',
            center: '109.385504,24.336229',
          },
        ],
      },
      {
        value: '450900',
        text: '玉林市',
        center: '110.18097,22.654001',

        children: [
          {
            value: '450903',
            text: '福绵区',
            center: '110.059564,22.585316',
          },
          {
            value: '450922',
            text: '陆川县',
            center: '110.26412,22.321563',
          },
          {
            value: '450902',
            text: '玉州区',
            center: '110.150717,22.628476',
          },
          {
            value: '450924',
            text: '兴业县',
            center: '109.875223,22.736395',
          },
          {
            value: '450981',
            text: '北流市',
            center: '110.353765,22.708415',
          },
          {
            value: '450921',
            text: '容县',
            center: '110.558093,22.85844',
          },
          {
            value: '450923',
            text: '博白县',
            center: '109.975856,22.273539',
          },
        ],
      },
    ],
  },
  {
    value: '640000',
    text: '宁夏回族自治区',
    center: '106.258889,38.472273',

    children: [
      {
        value: '640400',
        text: '固原市',
        center: '106.24267,36.01628',

        children: [
          {
            value: '640423',
            text: '隆德县',
            center: '106.111321,35.62592',
          },
          {
            value: '640425',
            text: '彭阳县',
            center: '106.632151,35.860067',
          },
          {
            value: '640424',
            text: '泾源县',
            center: '106.330569,35.497887',
          },
          {
            value: '640422',
            text: '西吉县',
            center: '105.729189,35.963885',
          },
          {
            value: '640402',
            text: '原州区',
            center: '106.28784,36.003777',
          },
        ],
      },
      {
        value: '640200',
        text: '石嘴山市',
        center: '106.382792,38.984632',

        children: [
          {
            value: '640205',
            text: '惠农区',
            center: '106.781013,39.239292',
          },
          {
            value: '640221',
            text: '平罗县',
            center: '106.523411,38.913923',
          },
          {
            value: '640202',
            text: '大武口区',
            center: '106.368128,39.019375',
          },
        ],
      },
      {
        value: '640300',
        text: '吴忠市',
        center: '106.198613,37.997755',

        children: [
          {
            value: '640381',
            text: '青铜峡市',
            center: '106.07906,38.021579',
          },
          {
            value: '640323',
            text: '盐池县',
            center: '107.407184,37.783276',
          },
          {
            value: '640324',
            text: '同心县',
            center: '105.895412,36.954635',
          },
          {
            value: '640302',
            text: '利通区',
            center: '106.212479,37.984586',
          },
          {
            value: '640303',
            text: '红寺堡区',
            center: '106.06216,37.425494',
          },
        ],
      },
      {
        value: '640100',
        text: '银川市',
        center: '106.230977,38.487783',

        children: [
          {
            value: '640121',
            text: '永宁县',
            center: '106.25337,38.277376',
          },
          {
            value: '640105',
            text: '西夏区',
            center: '106.161208,38.502325',
          },
          {
            value: '640181',
            text: '灵武市',
            center: '106.339978,38.102456',
          },
          {
            value: '640122',
            text: '贺兰县',
            center: '106.365074,38.579147',
          },
          {
            value: '640106',
            text: '金凤区',
            center: '106.239339,38.474277',
          },
          {
            value: '640104',
            text: '兴庆区',
            center: '106.288452,38.473972',
          },
        ],
      },
      {
        value: '640500',
        text: '中卫市',
        center: '105.19677,37.500185',

        children: [
          {
            value: '640522',
            text: '海原县',
            center: '105.643449,36.565189',
          },
          {
            value: '640521',
            text: '中宁县',
            center: '105.684729,37.492092',
          },
          {
            value: '640502',
            text: '沙坡头区',
            center: '105.173875,37.516859',
          },
        ],
      },
    ],
  },
  {
    value: '330000',
    text: '浙江省',
    center: '120.152575,30.266619',

    children: [
      {
        value: '330900',
        text: '舟山市',
        center: '122.207395,29.985578',

        children: [
          {
            value: '330922',
            text: '嵊泗县',
            center: '122.45132,30.725677',
          },
          {
            value: '330921',
            text: '岱山县',
            center: '122.225718,30.264533',
          },
          {
            value: '330903',
            text: '普陀区',
            center: '122.323297,29.970571',
          },
          {
            value: '330902',
            text: '定海区',
            center: '122.106844,30.019795',
          },
        ],
      },
      {
        value: '330400',
        text: '嘉兴市',
        center: '120.755623,30.746814',

        children: [
          {
            value: '330482',
            text: '平湖市',
            center: '121.015619,30.677804',
          },
          {
            value: '330411',
            text: '秀洲区',
            center: '120.709047,30.764811',
          },
          {
            value: '330481',
            text: '海宁市',
            center: '120.680224,30.511536',
          },
          {
            value: '330424',
            text: '海盐县',
            center: '120.94628,30.52664',
          },
          {
            value: '330402',
            text: '南湖区',
            center: '120.782952,30.747738',
          },
          {
            value: '330483',
            text: '桐乡市',
            center: '120.565127,30.630375',
          },
          {
            value: '330421',
            text: '嘉善县',
            center: '120.926031,30.83085',
          },
        ],
      },
      {
        value: '330200',
        text: '宁波市',
        center: '121.62454,29.860258',

        children: [
          {
            value: '330206',
            text: '北仑区',
            center: '121.844601,29.899548',
          },
          {
            value: '330225',
            text: '象山县',
            center: '121.869251,29.476826',
          },
          {
            value: '330211',
            text: '镇海区',
            center: '121.596686,29.965212',
          },
          {
            value: '330205',
            text: '江北区',
            center: '121.555067,29.88673',
          },
          {
            value: '330203',
            text: '海曙区',
            center: '121.550485,29.873705',
          },
          {
            value: '330212',
            text: '鄞州区',
            center: '121.546617,29.817302',
          },
          {
            value: '330213',
            text: '奉化区',
            center: '121.406151,29.655292',
          },
          {
            value: '330281',
            text: '余姚市',
            center: '121.154572,30.037967',
          },
          {
            value: '330282',
            text: '慈溪市',
            center: '121.266525,30.170695',
          },
          {
            value: '330226',
            text: '宁海县',
            center: '121.429729,29.287929',
          },
        ],
      },
      {
        value: '331000',
        text: '台州市',
        center: '121.42079,28.655716',

        children: [
          {
            value: '331082',
            text: '临海市',
            center: '121.144625,28.859042',
          },
          {
            value: '331002',
            text: '椒江区',
            center: '121.442859,28.673334',
          },
          {
            value: '331004',
            text: '路桥区',
            center: '121.337874,28.578244',
          },
          {
            value: '331083',
            text: '玉环市',
            center: '121.231915,28.136703',
          },
          {
            value: '331081',
            text: '温岭市',
            center: '121.385435,28.372805',
          },
          {
            value: '331022',
            text: '三门县',
            center: '121.39561,29.104888',
          },
          {
            value: '331024',
            text: '仙居县',
            center: '120.728733,28.846856',
          },
          {
            value: '331023',
            text: '天台县',
            center: '121.006657,29.144594',
          },
          {
            value: '331003',
            text: '黄岩区',
            center: '121.261804,28.649433',
          },
        ],
      },
      {
        value: '330300',
        text: '温州市',
        center: '120.699279,27.993849',

        children: [
          {
            value: '330327',
            text: '苍南县',
            center: '120.425957,27.518636',
          },
          {
            value: '330326',
            text: '平阳县',
            center: '120.565161,27.662394',
          },
          {
            value: '330305',
            text: '洞头区',
            center: '121.157406,27.836412',
          },
          {
            value: '330381',
            text: '瑞安市',
            center: '120.655245,27.778967',
          },
          {
            value: '330383',
            text: '龙港市',
            center: '120.552952,27.578379',
          },
          {
            value: '330329',
            text: '泰顺县',
            center: '119.717643,27.556578',
          },
          {
            value: '330328',
            text: '文成县',
            center: '120.090929,27.786856',
          },
          {
            value: '330382',
            text: '乐清市',
            center: '120.986297,28.112519',
          },
          {
            value: '330324',
            text: '永嘉县',
            center: '120.69136,28.153914',
          },
          {
            value: '330303',
            text: '龙湾区',
            center: '120.812333,27.933261',
          },
          {
            value: '330304',
            text: '瓯海区',
            center: '120.615149,27.967445',
          },
          {
            value: '330302',
            text: '鹿城区',
            center: '120.655199,28.015776',
          },
        ],
      },
      {
        value: '330800',
        text: '衢州市',
        center: '118.859307,28.970229',

        children: [
          {
            value: '330802',
            text: '柯城区',
            center: '118.874138,28.936937',
          },
          {
            value: '330881',
            text: '江山市',
            center: '118.627228,28.73796',
          },
          {
            value: '330822',
            text: '常山县',
            center: '118.511224,28.902446',
          },
          {
            value: '330803',
            text: '衢江区',
            center: '118.959139,28.980356',
          },
          {
            value: '330825',
            text: '龙游县',
            center: '119.1723,29.028214',
          },
          {
            value: '330824',
            text: '开化县',
            center: '118.415756,29.136729',
          },
        ],
      },
      {
        value: '330700',
        text: '金华市',
        center: '119.647265,29.079195',

        children: [
          {
            value: '330784',
            text: '永康市',
            center: '120.047356,28.88899',
          },
          {
            value: '330723',
            text: '武义县',
            center: '119.816341,28.892562',
          },
          {
            value: '330703',
            text: '金东区',
            center: '119.692821,29.099822',
          },
          {
            value: '330782',
            text: '义乌市',
            center: '120.075679,29.306296',
          },
          {
            value: '330702',
            text: '婺城区',
            center: '119.571574,29.087311',
          },
          {
            value: '330727',
            text: '磐安县',
            center: '120.449937,29.054491',
          },
          {
            value: '330783',
            text: '东阳市',
            center: '120.24179,29.290158',
          },
          {
            value: '330781',
            text: '兰溪市',
            center: '119.460404,29.209059',
          },
          {
            value: '330726',
            text: '浦江县',
            center: '119.89259,29.453363',
          },
        ],
      },
      {
        value: '331100',
        text: '丽水市',
        center: '119.923249,28.467694',

        children: [
          {
            value: '331124',
            text: '松阳县',
            center: '119.481406,28.448883',
          },
          {
            value: '331181',
            text: '龙泉市',
            center: '119.14126,28.074916',
          },
          {
            value: '331125',
            text: '云和县',
            center: '119.573454,28.116024',
          },
          {
            value: '331123',
            text: '遂昌县',
            center: '119.275865,28.592388',
          },
          {
            value: '331127',
            text: '景宁畲族自治县',
            center: '119.635686,27.973594',
          },
          {
            value: '331122',
            text: '缙云县',
            center: '120.091685,28.659294',
          },
          {
            value: '331121',
            text: '青田县',
            center: '120.289693,28.1396',
          },
          {
            value: '331102',
            text: '莲都区',
            center: '119.912266,28.4461',
          },
          {
            value: '331126',
            text: '庆元县',
            center: '119.062572,27.619213',
          },
        ],
      },
      {
        value: '330600',
        text: '绍兴市',
        center: '120.582886,30.051549',

        children: [
          {
            value: '330681',
            text: '诸暨市',
            center: '120.246602,29.709398',
          },
          {
            value: '330603',
            text: '柯桥区',
            center: '120.495532,30.083039',
          },
          {
            value: '330604',
            text: '上虞区',
            center: '120.868571,30.033862',
          },
          {
            value: '330602',
            text: '越城区',
            center: '120.582338,29.989092',
          },
          {
            value: '330624',
            text: '新昌县',
            center: '120.903918,29.500525',
          },
          {
            value: '330683',
            text: '嵊州市',
            center: '120.830505,29.561519',
          },
        ],
      },
      {
        value: '330100',
        text: '杭州市',
        center: '120.210792,30.246026',

        children: [
          {
            value: '330108',
            text: '滨江区',
            center: '120.211981,30.208332',
          },
          {
            value: '330114',
            text: '钱塘区',
            center: '120.493941,30.32304',
          },
          {
            value: '330111',
            text: '富阳区',
            center: '119.96022,30.048803',
          },
          {
            value: '330122',
            text: '桐庐县',
            center: '119.691755,29.79418',
          },
          {
            value: '330102',
            text: '上城区',
            center: '120.19732,30.226543',
          },
          {
            value: '330182',
            text: '建德市',
            center: '119.281195,29.474964',
          },
          {
            value: '330113',
            text: '临平区',
            center: '120.299222,30.419154',
          },
          {
            value: '330109',
            text: '萧山区',
            center: '120.264263,30.184119',
          },
          {
            value: '330106',
            text: '西湖区',
            center: '120.130396,30.259242',
          },
          {
            value: '330127',
            text: '淳安县',
            center: '119.042015,29.609678',
          },
          {
            value: '330112',
            text: '临安区',
            center: '119.724457,30.234375',
          },
          {
            value: '330105',
            text: '拱墅区',
            center: '120.141503,30.319126',
          },
          {
            value: '330110',
            text: '余杭区',
            center: '119.978742,30.273705',
          },
        ],
      },
      {
        value: '330500',
        text: '湖州市',
        center: '120.086881,30.894178',

        children: [
          {
            value: '330522',
            text: '长兴县',
            center: '119.911212,31.026962',
          },
          {
            value: '330503',
            text: '南浔区',
            center: '120.418244,30.850835',
          },
          {
            value: '330523',
            text: '安吉县',
            center: '119.680261,30.638803',
          },
          {
            value: '330502',
            text: '吴兴区',
            center: '120.185608,30.857184',
          },
          {
            value: '330521',
            text: '德清县',
            center: '119.9774,30.54251',
          },
        ],
      },
    ],
  },
  {
    value: '130000',
    text: '河北省',
    center: '114.530399,38.037707',

    children: [
      {
        value: '130200',
        text: '唐山市',
        center: '118.180149,39.63068',

        children: [
          {
            value: '130283',
            text: '迁安市',
            center: '118.701021,39.998861',
          },
          {
            value: '130225',
            text: '乐亭县',
            center: '118.91245,39.425748',
          },
          {
            value: '130229',
            text: '玉田县',
            center: '117.738196,39.901827',
          },
          {
            value: '130202',
            text: '路南区',
            center: '118.154348,39.624988',
          },
          {
            value: '130209',
            text: '曹妃甸区',
            center: '118.460197,39.273528',
          },
          {
            value: '130224',
            text: '滦南县',
            center: '118.68363,39.520272',
          },
          {
            value: '130205',
            text: '开平区',
            center: '118.262246,39.671634',
          },
          {
            value: '130204',
            text: '古冶区',
            center: '118.447134,39.73392',
          },
          {
            value: '130227',
            text: '迁西县',
            center: '118.31467,40.141486',
          },
          {
            value: '130284',
            text: '滦州市',
            center: '118.70301,39.740963',
          },
          {
            value: '130281',
            text: '遵化市',
            center: '117.965878,40.189119',
          },
          {
            value: '130207',
            text: '丰南区',
            center: '118.085169,39.576031',
          },
          {
            value: '130208',
            text: '丰润区',
            center: '118.162426,39.832919',
          },
          {
            value: '130203',
            text: '路北区',
            center: '118.201085,39.625079',
          },
        ],
      },
      {
        value: '130300',
        text: '秦皇岛市',
        center: '119.52022,39.888243',

        children: [
          {
            value: '130324',
            text: '卢龙县',
            center: '118.891931,39.892564',
          },
          {
            value: '130303',
            text: '山海关区',
            center: '119.775187,39.978882',
          },
          {
            value: '130302',
            text: '海港区',
            center: '119.564962,39.94756',
          },
          {
            value: '130306',
            text: '抚宁区',
            center: '119.244847,39.876253',
          },
          {
            value: '130322',
            text: '昌黎县',
            center: '119.199846,39.699677',
          },
          {
            value: '130304',
            text: '北戴河区',
            center: '119.48449,39.834912',
          },
          {
            value: '130321',
            text: '青龙满族自治县',
            center: '118.94985,40.407473',
          },
        ],
      },
      {
        value: '130800',
        text: '承德市',
        center: '117.962749,40.952942',

        children: [
          {
            value: '130828',
            text: '围场满族蒙古族自治县',
            center: '117.75934,41.938372',
          },
          {
            value: '130826',
            text: '丰宁满族自治县',
            center: '116.645798,41.209951',
          },
          {
            value: '130825',
            text: '隆化县',
            center: '117.739026,41.314402',
          },
          {
            value: '130827',
            text: '宽城满族自治县',
            center: '118.485472,40.611333',
          },
          {
            value: '130804',
            text: '鹰手营子矿区',
            center: '117.659341,40.546424',
          },
          {
            value: '130824',
            text: '滦平县',
            center: '117.332652,40.941644',
          },
          {
            value: '130803',
            text: '双滦区',
            center: '117.799588,40.959426',
          },
          {
            value: '130821',
            text: '承德县',
            center: '118.174166,40.768082',
          },
          {
            value: '130802',
            text: '双桥区',
            center: '117.943121,40.974679',
          },
          {
            value: '130822',
            text: '兴隆县',
            center: '117.500558,40.417358',
          },
          {
            value: '130881',
            text: '平泉市',
            center: '118.702032,41.018482',
          },
        ],
      },
      {
        value: '130100',
        text: '石家庄市',
        center: '114.514976,38.042007',

        children: [
          {
            value: '130126',
            text: '灵寿县',
            center: '114.383013,38.307908',
          },
          {
            value: '130183',
            text: '晋州市',
            center: '115.044141,38.033937',
          },
          {
            value: '130132',
            text: '元氏县',
            center: '114.525508,37.767332',
          },
          {
            value: '130127',
            text: '高邑县',
            center: '114.611659,37.615905',
          },
          {
            value: '130123',
            text: '正定县',
            center: '114.57043,38.14699',
          },
          {
            value: '130184',
            text: '新乐市',
            center: '114.683745,38.343952',
          },
          {
            value: '130181',
            text: '辛集市',
            center: '115.217626,37.943239',
          },
          {
            value: '130121',
            text: '井陉县',
            center: '114.145669,38.032366',
          },
          {
            value: '130107',
            text: '井陉矿区',
            center: '114.062258,38.065446',
          },
          {
            value: '130128',
            text: '深泽县',
            center: '115.20089,38.184572',
          },
          {
            value: '130133',
            text: '赵县',
            center: '114.775914,37.756935',
          },
          {
            value: '130125',
            text: '行唐县',
            center: '114.553044,38.437535',
          },
          {
            value: '130105',
            text: '新华区',
            center: '114.463904,38.050749',
          },
          {
            value: '130110',
            text: '鹿泉区',
            center: '114.313559,38.086536',
          },
          {
            value: '130131',
            text: '平山县',
            center: '114.186007,38.260288',
          },
          {
            value: '130104',
            text: '桥西区',
            center: '114.45004,38.025245',
          },
          {
            value: '130111',
            text: '栾城区',
            center: '114.647922,37.900915',
          },
          {
            value: '130108',
            text: '裕华区',
            center: '114.531599,38.007002',
          },
          {
            value: '130109',
            text: '藁城区',
            center: '114.846562,38.022177',
          },
          {
            value: '130102',
            text: '长安区',
            center: '114.538955,38.03682',
          },
          {
            value: '130130',
            text: '无极县',
            center: '114.976256,38.178852',
          },
          {
            value: '130129',
            text: '赞皇县',
            center: '114.386114,37.666549',
          },
        ],
      },
      {
        value: '130400',
        text: '邯郸市',
        center: '114.53915,36.625849',

        children: [
          {
            value: '130407',
            text: '肥乡区',
            center: '114.800199,36.548545',
          },
          {
            value: '130431',
            text: '鸡泽县',
            center: '114.889951,36.911525',
          },
          {
            value: '130408',
            text: '永年区',
            center: '114.536626,36.74188',
          },
          {
            value: '130433',
            text: '馆陶县',
            center: '115.281818,36.548295',
          },
          {
            value: '130423',
            text: '临漳县',
            center: '114.585514,36.322504',
          },
          {
            value: '130434',
            text: '魏县',
            center: '114.939217,36.35926',
          },
          {
            value: '130406',
            text: '峰峰矿区',
            center: '114.212571,36.419298',
          },
          {
            value: '130427',
            text: '磁县',
            center: '114.373965,36.37507',
          },
          {
            value: '130402',
            text: '邯山区',
            center: '114.531062,36.59457',
          },
          {
            value: '130425',
            text: '大名县',
            center: '115.147985,36.286406',
          },
          {
            value: '130403',
            text: '丛台区',
            center: '114.492875,36.636434',
          },
          {
            value: '130404',
            text: '复兴区',
            center: '114.462581,36.638879',
          },
          {
            value: '130435',
            text: '曲周县',
            center: '114.957549,36.766347',
          },
          {
            value: '130430',
            text: '邱县',
            center: '115.200049,36.811783',
          },
          {
            value: '130481',
            text: '武安市',
            center: '114.203685,36.69759',
          },
          {
            value: '130426',
            text: '涉县',
            center: '113.692157,36.586073',
          },
          {
            value: '130424',
            text: '成安县',
            center: '114.670094,36.445331',
          },
          {
            value: '130432',
            text: '广平县',
            center: '114.921185,36.476727',
          },
        ],
      },
      {
        value: '131000',
        text: '廊坊市',
        center: '116.683546,39.538304',

        children: [
          {
            value: '131028',
            text: '大厂回族自治县',
            center: '116.98961,39.886569',
          },
          {
            value: '131026',
            text: '文安县',
            center: '116.457628,38.873185',
          },
          {
            value: '131082',
            text: '三河市',
            center: '117.078269,39.982933',
          },
          {
            value: '131081',
            text: '霸州市',
            center: '116.391488,39.125238',
          },
          {
            value: '131022',
            text: '固安县',
            center: '116.298696,39.438797',
          },
          {
            value: '131025',
            text: '大城县',
            center: '116.653917,38.705232',
          },
          {
            value: '131023',
            text: '永清县',
            center: '116.50608,39.330983',
          },
          {
            value: '131002',
            text: '安次区',
            center: '116.6945443,39.50256863',
          },
          {
            value: '131024',
            text: '香河县',
            center: '117.006072,39.763772',
          },
          {
            value: '131003',
            text: '广阳区',
            center: '116.710667,39.52343',
          },
        ],
      },
      {
        value: '131100',
        text: '衡水市',
        center: '115.668987,37.739367',

        children: [
          {
            value: '131102',
            text: '桃城区',
            center: '115.675208,37.735152',
          },
          {
            value: '131182',
            text: '深州市',
            center: '115.559576,38.001535',
          },
          {
            value: '131128',
            text: '阜城县',
            center: '116.175424,37.862984',
          },
          {
            value: '131103',
            text: '冀州区',
            center: '115.579392,37.550922',
          },
          {
            value: '131126',
            text: '故城县',
            center: '115.965877,37.347873',
          },
          {
            value: '131122',
            text: '武邑县',
            center: '115.887498,37.802036',
          },
          {
            value: '131123',
            text: '武强县',
            center: '115.982119,38.041447',
          },
          {
            value: '131121',
            text: '枣强县',
            center: '115.724365,37.514217',
          },
          {
            value: '131127',
            text: '景县',
            center: '116.270558,37.692831',
          },
          {
            value: '131124',
            text: '饶阳县',
            center: '115.725898,38.235313',
          },
          {
            value: '131125',
            text: '安平县',
            center: '115.518918,38.234769',
          },
        ],
      },
      {
        value: '130900',
        text: '沧州市',
        center: '116.838715,38.304676',

        children: [
          {
            value: '130982',
            text: '任丘市',
            center: '116.084412,38.685325',
          },
          {
            value: '130924',
            text: '海兴县',
            center: '117.497545,38.143308',
          },
          {
            value: '130923',
            text: '东光县',
            center: '116.537138,37.888844',
          },
          {
            value: '130928',
            text: '吴桥县',
            center: '116.391557,37.628225',
          },
          {
            value: '130983',
            text: '黄骅市',
            center: '117.330043,38.372266',
          },
          {
            value: '130902',
            text: '新华区',
            center: '116.866309,38.314094',
          },
          {
            value: '130921',
            text: '沧县',
            center: '117.007478,38.21985569',
          },
          {
            value: '130903',
            text: '运河区',
            center: '116.842964,38.283456',
          },
          {
            value: '130925',
            text: '盐山县',
            center: '117.230681,38.058074',
          },
          {
            value: '130930',
            text: '孟村回族自治县',
            center: '117.104514,38.053438',
          },
          {
            value: '130927',
            text: '南皮县',
            center: '116.708603,38.038761',
          },
          {
            value: '130922',
            text: '青县',
            center: '116.804137,38.583657',
          },
          {
            value: '130926',
            text: '肃宁县',
            center: '115.829619,38.423044',
          },
          {
            value: '130984',
            text: '河间市',
            center: '116.099362,38.446656',
          },
          {
            value: '130981',
            text: '泊头市',
            center: '116.578322,38.084262',
          },
          {
            value: '130929',
            text: '献县',
            center: '116.122767,38.189924',
          },
        ],
      },
      {
        value: '130700',
        text: '张家口市',
        center: '114.885895,40.768931',

        children: [
          {
            value: '130723',
            text: '康保县',
            center: '114.60018,41.853016',
          },
          {
            value: '130732',
            text: '赤城县',
            center: '115.831256,40.913348',
          },
          {
            value: '130706',
            text: '下花园区',
            center: '115.287127,40.502628',
          },
          {
            value: '130709',
            text: '崇礼区',
            center: '115.282345,40.974741',
          },
          {
            value: '130731',
            text: '涿鹿县',
            center: '115.196835,40.382681',
          },
          {
            value: '130702',
            text: '桥东区',
            center: '114.894114,40.788472',
          },
          {
            value: '130705',
            text: '宣化区',
            center: '115.099515,40.609444',
          },
          {
            value: '130726',
            text: '蔚县',
            center: '114.589136,39.840154',
          },
          {
            value: '130728',
            text: '怀安县',
            center: '114.386488,40.67527',
          },
          {
            value: '130703',
            text: '桥西区',
            center: '114.868604,40.819553',
          },
          {
            value: '130725',
            text: '尚义县',
            center: '113.968763,41.076588',
          },
          {
            value: '130708',
            text: '万全区',
            center: '114.740584,40.767377',
          },
          {
            value: '130722',
            text: '张北县',
            center: '114.719927,41.159039',
          },
          {
            value: '130730',
            text: '怀来县',
            center: '115.517868,40.415625',
          },
          {
            value: '130727',
            text: '阳原县',
            center: '114.150267,40.104303',
          },
          {
            value: '130724',
            text: '沽源县',
            center: '115.688544,41.670497',
          },
        ],
      },
      {
        value: '130600',
        text: '保定市',
        center: '115.464523,38.874476',

        children: [
          {
            value: '130636',
            text: '顺平县',
            center: '115.135133,38.837988',
          },
          {
            value: '130632',
            text: '安新县',
            center: '115.935688,38.936102',
          },
          {
            value: '130683',
            text: '安国市',
            center: '115.327088,38.418985',
          },
          {
            value: '130623',
            text: '涞水县',
            center: '115.713651,39.394305',
          },
          {
            value: '130624',
            text: '阜平县',
            center: '114.195118,38.849221',
          },
          {
            value: '130631',
            text: '望都县',
            center: '115.15542,38.696221',
          },
          {
            value: '130627',
            text: '唐县',
            center: '114.982968,38.748477',
          },
          {
            value: '130684',
            text: '高碑店市',
            center: '115.873612,39.327233',
          },
          {
            value: '130626',
            text: '定兴县',
            center: '115.808183,39.263219',
          },
          {
            value: '130629',
            text: '容城县',
            center: '115.861635,39.043321',
          },
          {
            value: '130638',
            text: '雄县',
            center: '116.108624,38.994825',
          },
          {
            value: '130637',
            text: '博野县',
            center: '115.464295,38.458048',
          },
          {
            value: '130634',
            text: '曲阳县',
            center: '114.740476,38.614409',
          },
          {
            value: '130635',
            text: '蠡县',
            center: '115.583701,38.488064',
          },
          {
            value: '130628',
            text: '高阳县',
            center: '115.779149,38.700846',
          },
          {
            value: '130681',
            text: '涿州市',
            center: '115.97444,39.485684',
          },
          {
            value: '130630',
            text: '涞源县',
            center: '114.694416,39.360622',
          },
          {
            value: '130607',
            text: '满城区',
            center: '115.322246,38.949732',
          },
          {
            value: '130602',
            text: '竞秀区',
            center: '115.458671,38.877318',
          },
          {
            value: '130606',
            text: '莲池区',
            center: '115.497153,38.883528',
          },
          {
            value: '130608',
            text: '清苑区',
            center: '115.48988,38.76527',
          },
          {
            value: '130682',
            text: '定州市',
            center: '114.990321,38.516746',
          },
          {
            value: '130609',
            text: '徐水区',
            center: '115.655772,39.018781',
          },
          {
            value: '130633',
            text: '易县',
            center: '115.497487,39.350219',
          },
        ],
      },
      {
        value: '130500',
        text: '邢台市',
        center: '114.49742,37.060227',

        children: [
          {
            value: '130524',
            text: '柏乡县',
            center: '114.693447,37.48288',
          },
          {
            value: '130581',
            text: '南宫市',
            center: '115.40866,37.358907',
          },
          {
            value: '130530',
            text: '新河县',
            center: '115.251005,37.520891',
          },
          {
            value: '130531',
            text: '广宗县',
            center: '115.142766,37.074795',
          },
          {
            value: '130534',
            text: '清河县',
            center: '115.665081,37.0451',
          },
          {
            value: '130506',
            text: '南和区',
            center: '114.683683,37.005626',
          },
          {
            value: '130528',
            text: '宁晋县',
            center: '114.940006,37.624524',
          },
          {
            value: '130533',
            text: '威县',
            center: '115.266829,36.975164',
          },
          {
            value: '130535',
            text: '临西县',
            center: '115.501258,36.871312',
          },
          {
            value: '130582',
            text: '沙河市',
            center: '114.503023,36.855548',
          },
          {
            value: '130523',
            text: '内丘县',
            center: '114.512226,37.287612',
          },
          {
            value: '130502',
            text: '襄都区',
            center: '114.507443,37.071314',
          },
          {
            value: '130505',
            text: '任泽区',
            center: '114.671339,37.121958',
          },
          {
            value: '130503',
            text: '信都区',
            center: '114.468229,37.093798',
          },
          {
            value: '130522',
            text: '临城县',
            center: '114.498651,37.444512',
          },
          {
            value: '130532',
            text: '平乡县',
            center: '115.03008,37.063771',
          },
          {
            value: '130529',
            text: '巨鹿县',
            center: '115.037884,37.221293',
          },
          {
            value: '130525',
            text: '隆尧县',
            center: '114.770509,37.351232',
          },
        ],
      },
    ],
  },
  {
    value: '810000',
    text: '香港特别行政区',
    center: '114.171203,22.277468',

    children: [
      {
        value: '810014',
        text: '大埔区',
        center: '114.1717431,22.44565306',
      },
      {
        value: '810013',
        text: '北区',
        center: '114.1473639,22.49610389',
      },
      {
        value: '810016',
        text: '沙田区',
        center: '114.1953653,22.37953167',
      },
      {
        value: '810015',
        text: '西贡区',
        center: '114.264645,22.31421306',
      },
      {
        value: '810011',
        text: '屯门区',
        center: '113.9765742,22.39384417',
      },
      {
        value: '810008',
        text: '黄大仙区',
        center: '114.2038856,22.33632056',
      },
      {
        value: '810005',
        text: '油尖旺区',
        center: '114.1733317,22.31170389',
      },
      {
        value: '810006',
        text: '深水埗区',
        center: '114.1632417,22.33385417',
      },
      {
        value: '810003',
        text: '东区',
        center: '114.2260031,22.27969306',
      },
      {
        value: '810009',
        text: '观塘区',
        center: '114.2140542,22.32083778',
      },
      {
        value: '810007',
        text: '九龙城区',
        center: '114.1928467,22.31251',
      },
      {
        value: '810001',
        text: '中西区',
        center: '114.1543731,22.28198083',
      },
      {
        value: '810004',
        text: '南区',
        center: '114.1600117,22.24589667',
      },
      {
        value: '810018',
        text: '离岛区',
        center: '113.94612,22.28640778',
      },
      {
        value: '810002',
        text: '湾仔区',
        center: '114.1829153,22.27638889',
      },
      {
        value: '810012',
        text: '元朗区',
        center: '114.0324381,22.44142833',
      },
      {
        value: '810010',
        text: '荃湾区',
        center: '114.1210792,22.36830667',
      },
      {
        value: '810017',
        text: '葵青区',
        center: '114.1393194,22.36387667',
      },
    ],
  },
  // {
  //   value: '710000',
  //   text: '台湾省',
  //   center: '121.509062,25.044332',
  // },
  {
    value: '820000',
    text: '澳门特别行政区',
    center: '113.543076,22.186927',

    children: [
      {
        value: '820002',
        text: '花王堂区',
        center: '113.5489608,22.1992075',
      },
      {
        value: '820004',
        text: '大堂区',
        center: '113.5536475,22.18853944',
      },
      {
        value: '820008',
        text: '圣方济各堂区',
        center: '113.5599542,22.12348639',
      },
      {
        value: '820001',
        text: '花地玛堂区',
        center: '113.5528956,22.20787',
      },
      {
        value: '820003',
        text: '望德堂区',
        center: '113.5501828,22.19372083',
      },
      {
        value: '820006',
        text: '嘉模堂区',
        center: '113.5587044,22.15375944',
      },
      {
        value: '820007',
        text: '路凼填海区',
        center: '113.5695992,22.13663',
      },
      {
        value: '820005',
        text: '风顺堂区',
        center: '113.5419278,22.18736806',
      },
    ],
  },
  {
    value: '620000',
    text: '甘肃省',
    center: '103.826777,36.060634',

    children: [
      {
        value: '620200',
        text: '嘉峪关市',
        center: '98.2882,39.77325',

        children: [
          {
            value: '620200',
            text: '峪泉镇',
            center: '98.320410,39.958254',
          },
          {
            value: '620200',
            text: '新城镇',
            center: '98.362748,39.958127',
          },
          {
            value: '620200',
            text: '文殊镇',
            center: '98.157893,39.696861',
          },
          {
            value: '620200',
            text: '钢城街道',
            center: '98.292606,39.755770',
          },
          {
            value: '620200',
            text: '雄关街道',
            center: '98.239097,39.892952',
          },
        ],
      },
      {
        value: '620900',
        text: '酒泉市',
        center: '98.49432,39.733416',

        children: [
          {
            value: '620923',
            text: '肃北蒙古族自治县',
            center: '94.876533,39.512158',
          },
          {
            value: '620982',
            text: '敦煌市',
            center: '94.66201,40.142141',
          },
          {
            value: '620921',
            text: '金塔县',
            center: '98.901523,39.984146',
          },
          {
            value: '620981',
            text: '玉门市',
            center: '97.045617,40.292344',
          },
          {
            value: '620902',
            text: '肃州区',
            center: '98.507834,39.74511',
          },
          {
            value: '620922',
            text: '瓜州县',
            center: '95.782255,40.520457',
          },
          {
            value: '620924',
            text: '阿克塞哈萨克族自治县',
            center: '94.340202,39.633944',
          },
        ],
      },
      {
        value: '620300',
        text: '金昌市',
        center: '102.187972,38.521468',

        children: [
          {
            value: '620321',
            text: '永昌县',
            center: '101.984642,38.243534',
          },
          {
            value: '620302',
            text: '金川区',
            center: '102.1939,38.520373',
          },
        ],
      },
      {
        value: '620100',
        text: '兰州市',
        center: '103.834228,36.060798',

        children: [
          {
            value: '620111',
            text: '红古区',
            center: '102.859338,36.345768',
          },
          {
            value: '620104',
            text: '西固区',
            center: '103.627966,36.08845',
          },
          {
            value: '620103',
            text: '七里河区',
            center: '103.786261,36.066249',
          },
          {
            value: '620123',
            text: '榆中县',
            center: '104.112541,35.843354',
          },
          {
            value: '620105',
            text: '安宁区',
            center: '103.718953,36.104493',
          },
          {
            value: '620102',
            text: '城关区',
            center: '103.825315,36.056948',
          },
          {
            value: '620121',
            text: '永登县',
            center: '103.260273,36.736457',
          },
          {
            value: '620122',
            text: '皋兰县',
            center: '103.947345,36.332434',
          },
        ],
      },
      {
        value: '620800',
        text: '平凉市',
        center: '106.664913,35.542417',

        children: [
          {
            value: '620802',
            text: '崆峒区',
            center: '106.67489,35.542437',
          },
          {
            value: '620825',
            text: '庄浪县',
            center: '106.036201,35.20266',
          },
          {
            value: '620823',
            text: '崇信县',
            center: '107.025762,35.305648',
          },
          {
            value: '620881',
            text: '华亭市',
            center: '106.628899,35.207695',
          },
          {
            value: '620826',
            text: '静宁县',
            center: '105.732165,35.522035',
          },
          {
            value: '620822',
            text: '灵台县',
            center: '107.595874,35.070027',
          },
          {
            value: '620821',
            text: '泾川县',
            center: '107.367608,35.332992',
          },
        ],
      },
      {
        value: '620700',
        text: '张掖市',
        center: '100.449858,38.924766',

        children: [
          {
            value: '620721',
            text: '肃南裕固族自治县',
            center: '99.615601,38.836931',
          },
          {
            value: '620724',
            text: '高台县',
            center: '99.819265,39.378294',
          },
          {
            value: '620725',
            text: '山丹县',
            center: '101.088611,38.7846',
          },
          {
            value: '620722',
            text: '民乐县',
            center: '100.812047,38.430318',
          },
          {
            value: '620702',
            text: '甘州区',
            center: '100.415324,38.944315',
          },
          {
            value: '620723',
            text: '临泽县',
            center: '100.164333,39.15224',
          },
        ],
      },
      {
        value: '621000',
        text: '庆阳市',
        center: '107.643433,35.709459',

        children: [
          {
            value: '621025',
            text: '正宁县',
            center: '108.359964,35.492158',
          },
          {
            value: '621027',
            text: '镇原县',
            center: '107.200888,35.677705',
          },
          {
            value: '621022',
            text: '环县',
            center: '107.308788,36.568566',
          },
          {
            value: '621026',
            text: '宁县',
            center: '107.913463,35.509252',
          },
          {
            value: '621024',
            text: '合水县',
            center: '108.021859,35.833908',
          },
          {
            value: '621002',
            text: '西峰区',
            center: '107.650563,35.730318',
          },
          {
            value: '621021',
            text: '庆城县',
            center: '107.881706,36.016125',
          },
          {
            value: '621023',
            text: '华池县',
            center: '107.98972,36.461474',
          },
        ],
      },
      {
        value: '620400',
        text: '白银市',
        center: '104.138872,36.545123',

        children: [
          {
            value: '620402',
            text: '白银区',
            center: '104.14956,36.53469',
          },
          {
            value: '620422',
            text: '会宁县',
            center: '105.052883,35.693241',
          },
          {
            value: '620421',
            text: '靖远县',
            center: '104.676202,36.571736',
          },
          {
            value: '620403',
            text: '平川区',
            center: '104.825275,36.728494',
          },
          {
            value: '620423',
            text: '景泰县',
            center: '104.063125,37.18351',
          },
        ],
      },
      {
        value: '620600',
        text: '武威市',
        center: '102.637821,37.92898',

        children: [
          {
            value: '620602',
            text: '凉州区',
            center: '102.641959,37.928217',
          },
          {
            value: '620622',
            text: '古浪县',
            center: '102.897542,37.470882',
          },
          {
            value: '620621',
            text: '民勤县',
            center: '103.093671,38.624293',
          },
          {
            value: '620623',
            text: '天祝藏族自治县',
            center: '103.142416,36.971978',
          },
        ],
      },
      {
        value: '623000',
        text: '甘南藏族自治州',
        center: '102.911736,34.983266',

        children: [
          {
            value: '623027',
            text: '夏河县',
            center: '102.548303,35.203857',
          },
          {
            value: '623001',
            text: '合作市',
            center: '102.910305,35.000228',
          },
          {
            value: '623021',
            text: '临潭县',
            center: '103.353665,34.693009',
          },
          {
            value: '623024',
            text: '迭部县',
            center: '103.221735,34.055888',
          },
          {
            value: '623022',
            text: '卓尼县',
            center: '103.506849,34.589476',
          },
          {
            value: '623026',
            text: '碌曲县',
            center: '102.487512,34.591084',
          },
          {
            value: '623025',
            text: '玛曲县',
            center: '102.072608,33.998145',
          },
          {
            value: '623023',
            text: '舟曲县',
            center: '104.251543,33.793695',
          },
        ],
      },
      {
        value: '621200',
        text: '陇南市',
        center: '104.960296,33.370174',

        children: [
          {
            value: '621202',
            text: '武都区',
            center: '104.921861,33.400685',
          },
          {
            value: '621222',
            text: '文县',
            center: '104.6835,32.944031',
          },
          {
            value: '621225',
            text: '西和县',
            center: '105.298756,34.014215',
          },
          {
            value: '621224',
            text: '康县',
            center: '105.608609,33.329212',
          },
          {
            value: '621223',
            text: '宕昌县',
            center: '104.393385,34.047261',
          },
          {
            value: '621228',
            text: '两当县',
            center: '106.304973,33.908952',
          },
          {
            value: '621221',
            text: '成县',
            center: '105.742508,33.750722',
          },
          {
            value: '621227',
            text: '徽县',
            center: '106.087156,33.769927',
          },
          {
            value: '621226',
            text: '礼县',
            center: '105.17864,34.189345',
          },
        ],
      },
      {
        value: '620500',
        text: '天水市',
        center: '105.724828,34.581514',

        children: [
          {
            value: '620525',
            text: '张家川回族自治县',
            center: '106.20513,34.988676',
          },
          {
            value: '620521',
            text: '清水县',
            center: '106.137318,34.749906',
          },
          {
            value: '620524',
            text: '武山县',
            center: '104.89121,34.72183',
          },
          {
            value: '620503',
            text: '麦积区',
            center: '105.889452,34.571143',
          },
          {
            value: '620502',
            text: '秦州区',
            center: '105.724914,34.581187',
          },
          {
            value: '620522',
            text: '秦安县',
            center: '105.675799,34.859094',
          },
          {
            value: '620523',
            text: '甘谷县',
            center: '105.340789,34.745447',
          },
        ],
      },
      {
        value: '622900',
        text: '临夏回族自治州',
        center: '103.210386,35.601792',

        children: [
          {
            value: '622924',
            text: '广河县',
            center: '103.575582,35.488248',
          },
          {
            value: '622925',
            text: '和政县',
            center: '103.350996,35.424602',
          },
          {
            value: '622927',
            text: '积石山保安族东乡族撒拉族自治县',
            center: '102.875939,35.717697',
          },
          {
            value: '622923',
            text: '永靖县',
            center: '103.285853,35.958306',
          },
          {
            value: '622926',
            text: '东乡族自治县',
            center: '103.388122,35.664409',
          },
          {
            value: '622922',
            text: '康乐县',
            center: '103.708507,35.370296',
          },
          {
            value: '622921',
            text: '临夏县',
            center: '103.04068,35.478726',
          },
          {
            value: '622901',
            text: '临夏市',
            center: '103.24222,35.604682',
          },
        ],
      },
      {
        value: '621100',
        text: '定西市',
        center: '104.592342,35.607947',

        children: [
          {
            value: '621123',
            text: '渭源县',
            center: '104.215092,35.137028',
          },
          {
            value: '621124',
            text: '临洮县',
            center: '103.859446,35.394993',
          },
          {
            value: '621126',
            text: '岷县',
            center: '104.036731,34.43833',
          },
          {
            value: '621125',
            text: '漳县',
            center: '104.471722,34.84854',
          },
          {
            value: '621102',
            text: '安定区',
            center: '104.610647,35.580918',
          },
          {
            value: '621122',
            text: '陇西县',
            center: '104.634928,35.003899',
          },
          {
            value: '621121',
            text: '通渭县',
            center: '105.242312,35.211311',
          },
        ],
      },
    ],
  },
  {
    value: '510000',
    text: '四川省',
    center: '104.076452,30.651696',

    children: [
      {
        value: '510800',
        text: '广元市',
        center: '105.844004,32.435774',

        children: [
          {
            value: '510812',
            text: '朝天区',
            center: '105.882848,32.651352',
          },
          {
            value: '510824',
            text: '苍溪县',
            center: '105.934756,31.731709',
          },
          {
            value: '510811',
            text: '昭化区',
            center: '105.957612,32.333173',
          },
          {
            value: '510823',
            text: '剑阁县',
            center: '105.524699,32.288681',
          },
          {
            value: '510822',
            text: '青川县',
            center: '105.238498,32.575821',
          },
          {
            value: '510821',
            text: '旺苍县',
            center: '106.290124,32.229074',
          },
          {
            value: '510802',
            text: '利州区',
            center: '105.845307,32.433756',
          },
        ],
      },
      {
        value: '511300',
        text: '南充市',
        center: '106.110565,30.837235',

        children: [
          {
            value: '511321',
            text: '南部县',
            center: '106.036349,31.348255',
          },
          {
            value: '511322',
            text: '营山县',
            center: '106.565524,31.077057',
          },
          {
            value: '511304',
            text: '嘉陵区',
            center: '106.07208,30.758831',
          },
          {
            value: '511325',
            text: '西充县',
            center: '105.900894,30.995546',
          },
          {
            value: '511324',
            text: '仪陇县',
            center: '106.303082,31.271693',
          },
          {
            value: '511302',
            text: '顺庆区',
            center: '106.092327,30.797366',
          },
          {
            value: '511381',
            text: '阆中市',
            center: '106.005046,31.558356',
          },
          {
            value: '511323',
            text: '蓬安县',
            center: '106.412156,31.028537',
          },
          {
            value: '511303',
            text: '高坪区',
            center: '106.118931,30.781284',
          },
        ],
      },
      {
        value: '511900',
        text: '巴中市',
        center: '106.747548,31.867853',

        children: [
          {
            value: '511921',
            text: '通江县',
            center: '107.245033,31.911705',
          },
          {
            value: '511902',
            text: '巴州区',
            center: '106.76887,31.851458',
          },
          {
            value: '511922',
            text: '南江县',
            center: '106.828697,32.346589',
          },
          {
            value: '511923',
            text: '平昌县',
            center: '107.103613,31.560436',
          },
          {
            value: '511903',
            text: '恩阳区',
            center: '106.654386,31.787186',
          },
        ],
      },
      {
        value: '510600',
        text: '德阳市',
        center: '104.397795,31.127449',

        children: [
          {
            value: '510623',
            text: '中江县',
            center: '104.678601,31.03327',
          },
          {
            value: '510682',
            text: '什邡市',
            center: '104.167345,31.12655',
          },
          {
            value: '510604',
            text: '罗江区',
            center: '104.510457,31.317388',
          },
          {
            value: '510681',
            text: '广汉市',
            center: '104.282204,30.977264',
          },
          {
            value: '510603',
            text: '旌阳区',
            center: '104.417061,31.143335',
          },
          {
            value: '510683',
            text: '绵竹市',
            center: '104.220679,31.339251',
          },
        ],
      },
      {
        value: '510700',
        text: '绵阳市',
        center: '104.679127,31.467673',

        children: [
          {
            value: '510781',
            text: '江油市',
            center: '104.74564,31.778572',
          },
          {
            value: '510725',
            text: '梓潼县',
            center: '105.170746,31.642635',
          },
          {
            value: '510704',
            text: '游仙区',
            center: '104.766136,31.473788',
          },
          {
            value: '510722',
            text: '三台县',
            center: '105.093722,31.095826',
          },
          {
            value: '510703',
            text: '涪城区',
            center: '104.756917,31.455192',
          },
          {
            value: '510727',
            text: '平武县',
            center: '104.555481,32.409684',
          },
          {
            value: '510726',
            text: '北川羌族自治县',
            center: '104.468163,31.617192',
          },
          {
            value: '510723',
            text: '盐亭县',
            center: '105.389453,31.208362',
          },
          {
            value: '510705',
            text: '安州区',
            center: '104.567543,31.534319',
          },
        ],
      },
      {
        value: '510100',
        text: '成都市',
        center: '104.066301,30.572961',

        children: [
          {
            value: '510182',
            text: '彭州市',
            center: '103.957706,30.990463',
          },
          {
            value: '510185',
            text: '简阳市',
            center: '104.547644,30.410937',
          },
          {
            value: '510131',
            text: '蒲江县',
            center: '103.506478,30.197558',
          },
          {
            value: '510116',
            text: '双流区',
            center: '103.92342,30.574884',
          },
          {
            value: '510105',
            text: '青羊区',
            center: '104.062415,30.674583',
          },
          {
            value: '510106',
            text: '金牛区',
            center: '104.052236,30.691359',
          },
          {
            value: '510181',
            text: '都江堰市',
            center: '103.647193,30.988763',
          },
          {
            value: '510121',
            text: '金堂县',
            center: '104.411871,30.86203',
          },
          {
            value: '510118',
            text: '新津区',
            center: '103.810906,30.410404',
          },
          {
            value: '510117',
            text: '郫都区',
            center: '103.900486,30.795113',
          },
          {
            value: '510183',
            text: '邛崃市',
            center: '103.464176,30.41029',
          },
          {
            value: '510115',
            text: '温江区',
            center: '103.856423,30.681956',
          },
          {
            value: '510108',
            text: '成华区',
            center: '104.101452,30.659966',
          },
          {
            value: '510107',
            text: '武侯区',
            center: '104.043246,30.641849',
          },
          {
            value: '510114',
            text: '新都区',
            center: '104.158593,30.823568',
          },
          {
            value: '510113',
            text: '青白江区',
            center: '104.251342,30.8786',
          },
          {
            value: '510184',
            text: '崇州市',
            center: '103.673025,30.630183',
          },
          {
            value: '510129',
            text: '大邑县',
            center: '103.51226,30.573004',
          },
          {
            value: '510104',
            text: '锦江区',
            center: '104.117262,30.598726',
          },
          {
            value: '510112',
            text: '龙泉驿区',
            center: '104.27536,30.556808',
          },
        ],
      },
      {
        value: '511600',
        text: '广安市',
        center: '106.632647,30.456354',

        children: [
          {
            value: '511623',
            text: '邻水县',
            center: '106.930242,30.334911',
          },
          {
            value: '511602',
            text: '广安区',
            center: '106.641628,30.473943',
          },
          {
            value: '511621',
            text: '岳池县',
            center: '106.440056,30.538656',
          },
          {
            value: '511622',
            text: '武胜县',
            center: '106.295945,30.349493',
          },
          {
            value: '511681',
            text: '华蓥市',
            center: '106.783151,30.390439',
          },
          {
            value: '511603',
            text: '前锋区',
            center: '106.886039,30.496059',
          },
        ],
      },
      {
        value: '511700',
        text: '达州市',
        center: '107.46778,31.209278',

        children: [
          {
            value: '511724',
            text: '大竹县',
            center: '107.204702,30.736222',
          },
          {
            value: '511725',
            text: '渠县',
            center: '106.973114,30.836504',
          },
          {
            value: '511723',
            text: '开江县',
            center: '107.868609,31.082945',
          },
          {
            value: '511703',
            text: '达川区',
            center: '107.511736,31.196573',
          },
          {
            value: '511702',
            text: '通川区',
            center: '107.505053,31.214665',
          },
          {
            value: '511722',
            text: '宣汉县',
            center: '107.727198,31.353845',
          },
          {
            value: '511781',
            text: '万源市',
            center: '108.034393,32.081698',
          },
        ],
      },
      {
        value: '510900',
        text: '遂宁市',
        center: '105.592602,30.53268',

        children: [
          {
            value: '510981',
            text: '射洪市',
            center: '105.388366,30.871079',
          },
          {
            value: '510923',
            text: '大英县',
            center: '105.236852,30.594472',
          },
          {
            value: '510921',
            text: '蓬溪县',
            center: '105.707498,30.75763',
          },
          {
            value: '510903',
            text: '船山区',
            center: '105.568359,30.526201',
          },
          {
            value: '510904',
            text: '安居区',
            center: '105.45636,30.355091',
          },
        ],
      },
      {
        value: '512000',
        text: '资阳市',
        center: '104.627265,30.129236',

        children: [
          {
            value: '512022',
            text: '乐至县',
            center: '105.019823,30.275418',
          },
          {
            value: '512021',
            text: '安岳县',
            center: '105.35551,30.103623',
          },
          {
            value: '512002',
            text: '雁江区',
            center: '104.676814,30.107778',
          },
        ],
      },
      {
        value: '511400',
        text: '眉山市',
        center: '103.848417,30.077113',

        children: [
          {
            value: '511421',
            text: '仁寿县',
            center: '104.133931,29.995638',
          },
          {
            value: '511424',
            text: '丹棱县',
            center: '103.512859,30.014398',
          },
          {
            value: '511423',
            text: '洪雅县',
            center: '103.365035,29.915828',
          },
          {
            value: '511425',
            text: '青神县',
            center: '103.846596,29.831302',
          },
          {
            value: '511403',
            text: '彭山区',
            center: '103.872852,30.193278',
          },
          {
            value: '511402',
            text: '东坡区',
            center: '103.831868,30.041956',
          },
        ],
      },
      {
        value: '511000',
        text: '内江市',
        center: '105.057992,29.58021',

        children: [
          {
            value: '511025',
            text: '资中县',
            center: '104.851874,29.763419',
          },
          {
            value: '511024',
            text: '威远县',
            center: '104.669032,29.527456',
          },
          {
            value: '511011',
            text: '东兴区',
            center: '105.076107,29.593528',
          },
          {
            value: '511083',
            text: '隆昌市',
            center: '105.287507,29.339408',
          },
          {
            value: '511002',
            text: '市中区',
            center: '105.06759,29.587091',
          },
        ],
      },
      {
        value: '511100',
        text: '乐山市',
        center: '103.766085,29.552275',

        children: [
          {
            value: '511126',
            text: '夹江县',
            center: '103.571313,29.738143',
          },
          {
            value: '511111',
            text: '沙湾区',
            center: '103.550118,29.412404',
          },
          {
            value: '511112',
            text: '五通桥区',
            center: '103.818024,29.406837',
          },
          {
            value: '511124',
            text: '井研县',
            center: '104.06968,29.65165',
          },
          {
            value: '511113',
            text: '金口河区',
            center: '103.078597,29.244345',
          },
          {
            value: '511123',
            text: '犍为县',
            center: '103.949231,29.208118',
          },
          {
            value: '511132',
            text: '峨边彝族自治县',
            center: '103.262048,29.230426',
          },
          {
            value: '511129',
            text: '沐川县',
            center: '103.902691,28.956394',
          },
          {
            value: '511102',
            text: '市中区',
            center: '103.761329,29.555374',
          },
          {
            value: '511133',
            text: '马边彝族自治县',
            center: '103.546347,28.83552',
          },
          {
            value: '511181',
            text: '峨眉山市',
            center: '103.484557,29.601189',
          },
        ],
      },
      {
        value: '510300',
        text: '自贡市',
        center: '104.779307,29.33924',

        children: [
          {
            value: '510304',
            text: '大安区',
            center: '104.773982,29.36371',
          },
          {
            value: '510321',
            text: '荣县',
            center: '104.417438,29.445461',
          },
          {
            value: '510322',
            text: '富顺县',
            center: '104.975193,29.181779',
          },
          {
            value: '510302',
            text: '自流井区',
            center: '104.777182,29.337295',
          },
          {
            value: '510311',
            text: '沿滩区',
            center: '104.873826,29.27208',
          },
          {
            value: '510303',
            text: '贡井区',
            center: '104.715294,29.345481',
          },
        ],
      },
      {
        value: '510500',
        text: '泸州市',
        center: '105.441866,28.87098',

        children: [
          {
            value: '510521',
            text: '泸县',
            center: '105.381879,29.1516',
          },
          {
            value: '510504',
            text: '龙马潭区',
            center: '105.437751,28.913257',
          },
          {
            value: '510503',
            text: '纳溪区',
            center: '105.371324,28.772888',
          },
          {
            value: '510524',
            text: '叙永县',
            center: '105.444777,28.155631',
          },
          {
            value: '510525',
            text: '古蔺县',
            center: '105.812694,28.038763',
          },
          {
            value: '510502',
            text: '江阳区',
            center: '105.434982,28.87881',
          },
          {
            value: '510522',
            text: '合江县',
            center: '105.831011,28.811278',
          },
        ],
      },
      {
        value: '511500',
        text: '宜宾市',
        center: '104.642826,28.752354',

        children: [
          {
            value: '511503',
            text: '南溪区',
            center: '104.969147,28.846366',
          },
          {
            value: '511524',
            text: '长宁县',
            center: '104.920643,28.582866',
          },
          {
            value: '511528',
            text: '兴文县',
            center: '105.236207,28.303669',
          },
          {
            value: '511526',
            text: '珙县',
            center: '104.708986,28.439514',
          },
          {
            value: '511523',
            text: '江安县',
            center: '105.066982,28.723797',
          },
          {
            value: '511527',
            text: '筠连县',
            center: '104.511159,28.167981',
          },
          {
            value: '511502',
            text: '翠屏区',
            center: '104.619853,28.766537',
          },
          {
            value: '511529',
            text: '屏山县',
            center: '104.346138,28.82867',
          },
          {
            value: '511504',
            text: '叙州区',
            center: '104.533244,28.690068',
          },
          {
            value: '511525',
            text: '高县',
            center: '104.517748,28.436166',
          },
        ],
      },
      {
        value: '513400',
        text: '凉山彝族自治州',
        center: '102.267713,27.881396',

        children: [
          {
            value: '513434',
            text: '越西县',
            center: '102.507467,28.639874',
          },
          {
            value: '513435',
            text: '甘洛县',
            center: '102.771441,28.959131',
          },
          {
            value: '513422',
            text: '木里藏族自治县',
            center: '101.280216,27.928736',
          },
          {
            value: '513436',
            text: '美姑县',
            center: '103.132359,28.328591',
          },
          {
            value: '513437',
            text: '雷波县',
            center: '103.571705,28.263202',
          },
          {
            value: '513423',
            text: '盐源县',
            center: '101.509038,27.422593',
          },
          {
            value: '513433',
            text: '冕宁县',
            center: '102.176622,28.550145',
          },
          {
            value: '513430',
            text: '金阳县',
            center: '103.248786,27.696735',
          },
          {
            value: '513429',
            text: '布拖县',
            center: '102.809157,27.7121',
          },
          {
            value: '513428',
            text: '普格县',
            center: '102.540901,27.376413',
          },
          {
            value: '513402',
            text: '会理市',
            center: '102.244774,26.655047',
          },
          {
            value: '513424',
            text: '德昌县',
            center: '102.175661,27.402832',
          },
          {
            value: '513427',
            text: '宁南县',
            center: '102.751587,27.061431',
          },
          {
            value: '513401',
            text: '西昌市',
            center: '102.264166,27.89441',
          },
          {
            value: '513431',
            text: '昭觉县',
            center: '102.839849,28.015301',
          },
          {
            value: '513426',
            text: '会东县',
            center: '102.577979,26.634744',
          },
          {
            value: '513432',
            text: '喜德县',
            center: '102.412451,28.306429',
          },
        ],
      },
      {
        value: '510400',
        text: '攀枝花市',
        center: '101.71846,26.582417',

        children: [
          {
            value: '510421',
            text: '米易县',
            center: '102.111073,26.896372',
          },
          {
            value: '510422',
            text: '盐边县',
            center: '101.854027,26.682611',
          },
          {
            value: '510402',
            text: '东区',
            center: '101.704129,26.546484',
          },
          {
            value: '510411',
            text: '仁和区',
            center: '101.738615,26.497796',
          },
          {
            value: '510403',
            text: '西区',
            center: '101.630557,26.5977',
          },
        ],
      },
      {
        value: '513300',
        text: '甘孜藏族自治州',
        center: '101.96231,30.04952',

        children: [
          {
            value: '513332',
            text: '石渠县',
            center: '98.102938,32.978728',
          },
          {
            value: '513328',
            text: '甘孜县',
            center: '99.991683,31.622731',
          },
          {
            value: '513330',
            text: '德格县',
            center: '98.580914,31.806118',
          },
          {
            value: '513327',
            text: '炉霍县',
            center: '100.676014,31.390657',
          },
          {
            value: '513329',
            text: '新龙县',
            center: '100.311569,30.93917',
          },
          {
            value: '513331',
            text: '白玉县',
            center: '98.824025,31.209669',
          },
          {
            value: '513326',
            text: '道孚县',
            center: '101.125157,30.979486',
          },
          {
            value: '513335',
            text: '巴塘县',
            center: '99.110555,30.00533',
          },
          {
            value: '513301',
            text: '康定市',
            center: '101.95687,29.998544',
          },
          {
            value: '513334',
            text: '理塘县',
            center: '100.269145,29.994228',
          },
          {
            value: '513325',
            text: '雅江县',
            center: '101.014366,30.031498',
          },
          {
            value: '513336',
            text: '乡城县',
            center: '99.798116,28.931081',
          },
          {
            value: '513337',
            text: '稻城县',
            center: '100.297369,29.03791',
          },
          {
            value: '513324',
            text: '九龙县',
            center: '101.507294,29.000347',
          },
          {
            value: '513338',
            text: '得荣县',
            center: '99.286366,28.713085',
          },
          {
            value: '513333',
            text: '色达县',
            center: '100.333011,32.268541',
          },
          {
            value: '513323',
            text: '丹巴县',
            center: '101.89054,30.878618',
          },
          {
            value: '513322',
            text: '泸定县',
            center: '102.234814,29.914103',
          },
        ],
      },
      {
        value: '513200',
        text: '阿坝藏族羌族自治州',
        center: '102.224504,31.899427',

        children: [
          {
            value: '513225',
            text: '九寨沟县',
            center: '104.2426,33.252008',
          },
          {
            value: '513231',
            text: '阿坝县',
            center: '101.706548,32.902387',
          },
          {
            value: '513233',
            text: '红原县',
            center: '102.544395,32.790841',
          },
          {
            value: '513228',
            text: '黑水县',
            center: '102.987592,32.069268',
          },
          {
            value: '513201',
            text: '马尔康市',
            center: '102.206386,31.905799',
          },
          {
            value: '513226',
            text: '金川县',
            center: '102.063821,31.47625',
          },
          {
            value: '513222',
            text: '理县',
            center: '103.163284,31.435831',
          },
          {
            value: '513224',
            text: '松潘县',
            center: '103.60428,32.655685',
          },
          {
            value: '513227',
            text: '小金县',
            center: '102.362984,30.995823',
          },
          {
            value: '513230',
            text: '壤塘县',
            center: '100.978526,32.265796',
          },
          {
            value: '513221',
            text: '汶川县',
            center: '103.590185,31.476875',
          },
          {
            value: '513223',
            text: '茂县',
            center: '103.85332,31.681727',
          },
          {
            value: '513232',
            text: '若尔盖县',
            center: '102.96738,33.578503',
          },
        ],
      },
      {
        value: '511800',
        text: '雅安市',
        center: '103.041538,30.009998',

        children: [
          {
            value: '511827',
            text: '宝兴县',
            center: '102.814156,30.382154',
          },
          {
            value: '511802',
            text: '雨城区',
            center: '103.032868,30.005718',
          },
          {
            value: '511822',
            text: '荥经县',
            center: '102.846537,29.793254',
          },
          {
            value: '511824',
            text: '石棉县',
            center: '102.358364,29.230963',
          },
          {
            value: '511803',
            text: '名山区',
            center: '103.109238,30.069837',
          },
          {
            value: '511823',
            text: '汉源县',
            center: '102.650417,29.344275',
          },
          {
            value: '511825',
            text: '天全县',
            center: '102.771745,30.05728',
          },
          {
            value: '511826',
            text: '芦山县',
            center: '102.933618,30.145077',
          },
        ],
      },
    ],
  },
  {
    value: '120000',
    text: '天津市',
    center: '117.201509,39.085318',

    children: [
      {
        value: '120100',
        text: '天津城区',
        center: '117.190182,39.125596',

        children: [
          {
            value: '120115',
            text: '宝坻区',
            center: '117.309748,39.717054',
          },
          {
            value: '120105',
            text: '河北区',
            center: '117.196874,39.148018',
          },
          {
            value: '120118',
            text: '静海区',
            center: '116.975474,38.947772',
          },
          {
            value: '120119',
            text: '蓟州区',
            center: '117.408432,40.046544',
          },
          {
            value: '120117',
            text: '宁河区',
            center: '117.826674,39.329749',
          },
          {
            value: '120112',
            text: '津南区',
            center: '117.356683,38.936971',
          },
          {
            value: '120101',
            text: '和平区',
            center: '117.214713,39.116884',
          },
          {
            value: '120113',
            text: '北辰区',
            center: '117.135614,39.224638',
          },
          {
            value: '120102',
            text: '河东区',
            center: '117.251584,39.128294',
          },
          {
            value: '120110',
            text: '东丽区',
            center: '117.313567,39.086789',
          },
          {
            value: '120106',
            text: '红桥区',
            center: '117.151566,39.167349',
          },
          {
            value: '120116',
            text: '滨海新区',
            center: '117.69641,39.017809',
          },
          {
            value: '120103',
            text: '河西区',
            center: '117.223379,39.109679',
          },
          {
            value: '120114',
            text: '武清区',
            center: '117.04456,39.384108',
          },
          {
            value: '120104',
            text: '南开区',
            center: '117.150638,39.138551',
          },
          {
            value: '120111',
            text: '西青区',
            center: '117.008994,39.141811',
          },
        ],
      },
    ],
  },
  {
    value: '360000',
    text: '江西省',
    center: '115.816587,28.637234',

    children: [
      {
        value: '360500',
        text: '新余市',
        center: '114.916665,27.818553',

        children: [
          {
            value: '360502',
            text: '渝水区',
            center: '114.944499,27.799526',
          },
          {
            value: '360521',
            text: '分宜县',
            center: '114.69264,27.814723',
          },
        ],
      },
      {
        value: '360100',
        text: '南昌市',
        center: '115.857972,28.682976',

        children: [
          {
            value: '360103',
            text: '西湖区',
            center: '115.876998,28.657005',
          },
          {
            value: '360123',
            text: '安义县',
            center: '115.549158,28.845585',
          },
          {
            value: '360104',
            text: '青云谱区',
            center: '115.925709,28.62182',
          },
          {
            value: '360111',
            text: '青山湖区',
            center: '115.962138,28.682867',
          },
          {
            value: '360121',
            text: '南昌县',
            center: '115.93349,28.557921',
          },
          {
            value: '360113',
            text: '红谷滩区',
            center: '115.858127,28.698188',
          },
          {
            value: '360124',
            text: '进贤县',
            center: '116.242468,28.377627',
          },
          {
            value: '360102',
            text: '东湖区',
            center: '115.903576,28.698787',
          },
          {
            value: '360112',
            text: '新建区',
            center: '115.815244,28.693192',
          },
        ],
      },
      {
        value: '360200',
        text: '景德镇市',
        center: '117.184892,29.2744',

        children: [
          {
            value: '360222',
            text: '浮梁县',
            center: '117.214984,29.352493',
          },
          {
            value: '360202',
            text: '昌江区',
            center: '117.182648,29.273683',
          },
          {
            value: '360203',
            text: '珠山区',
            center: '117.271365,29.305191',
          },
          {
            value: '360281',
            text: '乐平市',
            center: '117.151499,28.978521',
          },
        ],
      },
      {
        value: '360600',
        text: '鹰潭市',
        center: '117.039532,28.272092',

        children: [
          {
            value: '360603',
            text: '余江区',
            center: '116.854576,28.199657',
          },
          {
            value: '360602',
            text: '月湖区',
            center: '117.10247,28.266999',
          },
          {
            value: '360681',
            text: '贵溪市',
            center: '117.245178,28.292397',
          },
        ],
      },
      {
        value: '360800',
        text: '吉安市',
        center: '114.96681,27.091243',

        children: [
          {
            value: '360802',
            text: '吉州区',
            center: '114.994991,27.144204',
          },
          {
            value: '360825',
            text: '永丰县',
            center: '115.421599,27.317301',
          },
          {
            value: '360830',
            text: '永新县',
            center: '114.242425,26.945157',
          },
          {
            value: '360822',
            text: '吉水县',
            center: '115.135963,27.229697',
          },
          {
            value: '360828',
            text: '万安县',
            center: '114.759746,26.456821',
          },
          {
            value: '360823',
            text: '峡江县',
            center: '115.316567,27.5829',
          },
          {
            value: '360881',
            text: '井冈山市',
            center: '114.289563,26.748132',
          },
          {
            value: '360824',
            text: '新干县',
            center: '115.386853,27.740368',
          },
          {
            value: '360821',
            text: '吉安县',
            center: '114.908337,27.039866',
          },
          {
            value: '360827',
            text: '遂川县',
            center: '114.520825,26.313413',
          },
          {
            value: '360803',
            text: '青原区',
            center: '115.014836,27.082012',
          },
          {
            value: '360826',
            text: '泰和县',
            center: '114.922987,26.801687',
          },
          {
            value: '360829',
            text: '安福县',
            center: '114.619818,27.393286',
          },
        ],
      },
      {
        value: '360900',
        text: '宜春市',
        center: '114.416826,27.816245',

        children: [
          {
            value: '360981',
            text: '丰城市',
            center: '115.771131,28.160053',
          },
          {
            value: '360926',
            text: '铜鼓县',
            center: '114.354623,28.513291',
          },
          {
            value: '360922',
            text: '万载县',
            center: '114.445477,28.106201',
          },
          {
            value: '360902',
            text: '袁州区',
            center: '114.42794,27.796344',
          },
          {
            value: '360921',
            text: '奉新县',
            center: '115.400624,28.688254',
          },
          {
            value: '360983',
            text: '高安市',
            center: '115.366863,28.448054',
          },
          {
            value: '360982',
            text: '樟树市',
            center: '115.546174,28.054632',
          },
          {
            value: '360925',
            text: '靖安县',
            center: '115.362635,28.861296',
          },
          {
            value: '360924',
            text: '宜丰县',
            center: '114.803036,28.394466',
          },
          {
            value: '360923',
            text: '上高县',
            center: '114.948045,28.238591',
          },
        ],
      },
      {
        value: '361000',
        text: '抚州市',
        center: '116.358054,27.948979',

        children: [
          {
            value: '361003',
            text: '东乡区',
            center: '116.603159,28.249059',
          },
          {
            value: '361024',
            text: '崇仁县',
            center: '116.076363,27.754416',
          },
          {
            value: '361028',
            text: '资溪县',
            center: '117.060332,27.706088',
          },
          {
            value: '361021',
            text: '南城县',
            center: '116.637228,27.570031',
          },
          {
            value: '361025',
            text: '乐安县',
            center: '115.83099,27.428682',
          },
          {
            value: '361022',
            text: '黎川县',
            center: '116.907446,27.282729',
          },
          {
            value: '361030',
            text: '广昌县',
            center: '116.336556,26.843974',
          },
          {
            value: '361027',
            text: '金溪县',
            center: '116.755018,27.91973',
          },
          {
            value: '361002',
            text: '临川区',
            center: '116.311932,27.935098',
          },
          {
            value: '361023',
            text: '南丰县',
            center: '116.525898,27.21845',
          },
          {
            value: '361026',
            text: '宜黄县',
            center: '116.236174,27.554744',
          },
        ],
      },
      {
        value: '360400',
        text: '九江市',
        center: '115.95356,29.66116',

        children: [
          {
            value: '360404',
            text: '柴桑区',
            center: '115.911005,29.608775',
          },
          {
            value: '360483',
            text: '庐山市',
            center: '116.045118,29.448225',
          },
          {
            value: '360402',
            text: '濂溪区',
            center: '115.992735,29.668008',
          },
          {
            value: '360425',
            text: '永修县',
            center: '115.83207,29.011392',
          },
          {
            value: '360428',
            text: '都昌县',
            center: '116.203999,29.273803',
          },
          {
            value: '360482',
            text: '共青城市',
            center: '115.784269,29.235082',
          },
          {
            value: '360426',
            text: '德安县',
            center: '115.767114,29.298599',
          },
          {
            value: '360481',
            text: '瑞昌市',
            center: '115.681221,29.676026',
          },
          {
            value: '360403',
            text: '浔阳区',
            center: '116.001677,29.70547',
          },
          {
            value: '360423',
            text: '武宁县',
            center: '115.092649,29.246785',
          },
          {
            value: '360424',
            text: '修水县',
            center: '114.546536,29.026166',
          },
          {
            value: '360429',
            text: '湖口县',
            center: '116.252206,29.731194',
          },
          {
            value: '360430',
            text: '彭泽县',
            center: '116.563858,29.877404',
          },
        ],
      },
      {
        value: '361100',
        text: '上饶市',
        center: '117.943064,28.45513',

        children: [
          {
            value: '361130',
            text: '婺源县',
            center: '117.861532,29.248491',
          },
          {
            value: '361125',
            text: '横峰县',
            center: '117.596433,28.407116',
          },
          {
            value: '361123',
            text: '玉山县',
            center: '118.244736,28.681936',
          },
          {
            value: '361181',
            text: '德兴市',
            center: '117.594549,28.930557',
          },
          {
            value: '361124',
            text: '铅山县',
            center: '117.734742,28.298415',
          },
          {
            value: '361103',
            text: '广丰区',
            center: '118.189729,28.463697',
          },
          {
            value: '361126',
            text: '弋阳县',
            center: '117.449346,28.378039',
          },
          {
            value: '361127',
            text: '余干县',
            center: '116.695787,28.70283',
          },
          {
            value: '361102',
            text: '信州区',
            center: '117.965997,28.430694',
          },
          {
            value: '361104',
            text: '广信区',
            center: '117.907454,28.448893',
          },
          {
            value: '361128',
            text: '鄱阳县',
            center: '116.703731,29.005675',
          },
          {
            value: '361129',
            text: '万年县',
            center: '117.058445,28.694582',
          },
        ],
      },
      {
        value: '360700',
        text: '赣州市',
        center: '114.933494,25.831139',

        children: [
          {
            value: '360730',
            text: '宁都县',
            center: '116.009171,26.470865',
          },
          {
            value: '360735',
            text: '石城县',
            center: '116.347611,26.31491',
          },
          {
            value: '360725',
            text: '崇义县',
            center: '114.308135,25.682278',
          },
          {
            value: '360731',
            text: '于都县',
            center: '115.415145,25.952564',
          },
          {
            value: '360781',
            text: '瑞金市',
            center: '116.027114,25.88623',
          },
          {
            value: '360734',
            text: '寻乌县',
            center: '115.638534,24.969513',
          },
          {
            value: '360729',
            text: '全南县',
            center: '114.530148,24.742353',
          },
          {
            value: '360783',
            text: '龙南市',
            center: '114.804474,24.901216',
          },
          {
            value: '360726',
            text: '安远县',
            center: '115.393992,25.136855',
          },
          {
            value: '360733',
            text: '会昌县',
            center: '115.809271,25.58734',
          },
          {
            value: '360722',
            text: '信丰县',
            center: '114.922485,25.38676',
          },
          {
            value: '360704',
            text: '赣县区',
            center: '115.021196,25.854496',
          },
          {
            value: '360728',
            text: '定南县',
            center: '115.027908,24.783372',
          },
          {
            value: '360724',
            text: '上犹县',
            center: '114.55177,25.784754',
          },
          {
            value: '360702',
            text: '章贡区',
            center: '114.920426,25.818247',
          },
          {
            value: '360723',
            text: '大余县',
            center: '114.362306,25.401968',
          },
          {
            value: '360703',
            text: '南康区',
            center: '114.765044,25.661369',
          },
          {
            value: '360732',
            text: '兴国县',
            center: '115.363475,26.338129',
          },
        ],
      },
      {
        value: '360300',
        text: '萍乡市',
        center: '113.887147,27.658721',

        children: [
          {
            value: '360302',
            text: '安源区',
            center: '113.87072,27.615',
          },
          {
            value: '360321',
            text: '莲花县',
            center: '113.961589,27.128498',
          },
          {
            value: '360313',
            text: '湘东区',
            center: '113.733047,27.640075',
          },
          {
            value: '360322',
            text: '上栗县',
            center: '113.795294,27.880221',
          },
          {
            value: '360323',
            text: '芦溪县',
            center: '114.029351,27.631273',
          },
        ],
      },
    ],
  },
  {
    value: '140000',
    text: '山西省',
    center: '112.578781,37.813948',

    children: [
      {
        value: '140300',
        text: '阳泉市',
        center: '113.580426,37.857094',

        children: [
          {
            value: '140321',
            text: '平定县',
            center: '113.629777,37.804986',
          },
          {
            value: '140322',
            text: '盂县',
            center: '113.412279,38.086041',
          },
          {
            value: '140311',
            text: '郊区',
            center: '113.593998,37.943703',
          },
          {
            value: '140302',
            text: '城区',
            center: '113.600694,37.847457',
          },
          {
            value: '140303',
            text: '矿区',
            center: '113.555279,37.868494',
          },
        ],
      },
      {
        value: '140400',
        text: '长治市',
        center: '113.117394,36.195142',

        children: [
          {
            value: '140425',
            text: '平顺县',
            center: '113.435859,36.20037',
          },
          {
            value: '140430',
            text: '沁县',
            center: '112.699176,36.756152',
          },
          {
            value: '140431',
            text: '沁源县',
            center: '112.337726,36.499989',
          },
          {
            value: '140428',
            text: '长子县',
            center: '112.877922,36.122258',
          },
          {
            value: '140405',
            text: '屯留区',
            center: '112.892301,36.3162',
          },
          {
            value: '140403',
            text: '潞州区',
            center: '113.122725,36.203305',
          },
          {
            value: '140426',
            text: '黎城县',
            center: '113.387025,36.502258',
          },
          {
            value: '140404',
            text: '上党区',
            center: '113.051416,36.053104',
          },
          {
            value: '140427',
            text: '壶关县',
            center: '113.206836,36.115645',
          },
          {
            value: '140423',
            text: '襄垣县',
            center: '113.051298,36.535629',
          },
          {
            value: '140406',
            text: '潞城区',
            center: '113.228897,36.334597',
          },
          {
            value: '140429',
            text: '武乡县',
            center: '112.86396,36.837865',
          },
        ],
      },
      {
        value: '140600',
        text: '朔州市',
        center: '112.432906,39.331734',

        children: [
          {
            value: '140623',
            text: '右玉县',
            center: '112.466926,39.989198',
          },
          {
            value: '140681',
            text: '怀仁市',
            center: '113.133061,39.820522',
          },
          {
            value: '140602',
            text: '朔城区',
            center: '112.432071,39.320196',
          },
          {
            value: '140603',
            text: '平鲁区',
            center: '112.28827,39.512219',
          },
          {
            value: '140621',
            text: '山阴县',
            center: '112.816421,39.527445',
          },
          {
            value: '140622',
            text: '应县',
            center: '113.190952,39.554471',
          },
        ],
      },
      {
        value: '140500',
        text: '晋城市',
        center: '112.852022,35.491315',

        children: [
          {
            value: '140502',
            text: '城区',
            center: '112.853452,35.50248',
          },
          {
            value: '140525',
            text: '泽州县',
            center: '112.922243,35.507061',
          },
          {
            value: '140581',
            text: '高平市',
            center: '112.923798,35.798775',
          },
          {
            value: '140524',
            text: '陵川县',
            center: '113.280755,35.775239',
          },
          {
            value: '140521',
            text: '沁水县',
            center: '112.186726,35.690119',
          },
          {
            value: '140522',
            text: '阳城县',
            center: '112.414798,35.486275',
          },
        ],
      },
      {
        value: '140900',
        text: '忻州市',
        center: '112.734149,38.415958',

        children: [
          {
            value: '140921',
            text: '定襄县',
            center: '112.957234,38.471725',
          },
          {
            value: '140902',
            text: '忻府区',
            center: '112.746357,38.403498',
          },
          {
            value: '140926',
            text: '静乐县',
            center: '111.939498,38.359306',
          },
          {
            value: '140929',
            text: '岢岚县',
            center: '111.572964,38.703989',
          },
          {
            value: '140925',
            text: '宁武县',
            center: '112.304734,39.001498',
          },
          {
            value: '140922',
            text: '五台县',
            center: '113.255419,38.728056',
          },
          {
            value: '140928',
            text: '五寨县',
            center: '111.846808,38.91111',
          },
          {
            value: '140927',
            text: '神池县',
            center: '112.210997,39.091079',
          },
          {
            value: '140924',
            text: '繁峙县',
            center: '113.265464,39.188835',
          },
          {
            value: '140931',
            text: '保德县',
            center: '111.085944,39.022616',
          },
          {
            value: '140930',
            text: '河曲县',
            center: '111.138247,39.38452',
          },
          {
            value: '140981',
            text: '原平市',
            center: '112.711025,38.731412',
          },
          {
            value: '140923',
            text: '代县',
            center: '112.960102,39.066831',
          },
          {
            value: '140932',
            text: '偏关县',
            center: '111.508922,39.436917',
          },
        ],
      },
      {
        value: '140800',
        text: '运城市',
        center: '111.007051,35.02667',

        children: [
          {
            value: '140821',
            text: '临猗县',
            center: '110.774553,35.144406',
          },
          {
            value: '140802',
            text: '盐湖区',
            center: '110.998135,35.015549',
          },
          {
            value: '140822',
            text: '万荣县',
            center: '110.837957,35.415805',
          },
          {
            value: '140823',
            text: '闻喜县',
            center: '111.224485,35.356664',
          },
          {
            value: '140828',
            text: '夏县',
            center: '111.219946,35.140733',
          },
          {
            value: '140829',
            text: '平陆县',
            center: '111.193957,34.829595',
          },
          {
            value: '140827',
            text: '垣曲县',
            center: '111.670215,35.298297',
          },
          {
            value: '140824',
            text: '稷山县',
            center: '110.983273,35.604515',
          },
          {
            value: '140882',
            text: '河津市',
            center: '110.712032,35.596357',
          },
          {
            value: '140881',
            text: '永济市',
            center: '110.447771,34.866499',
          },
          {
            value: '140826',
            text: '绛县',
            center: '111.568849,35.491764',
          },
          {
            value: '140830',
            text: '芮城县',
            center: '110.694418,34.694173',
          },
          {
            value: '140825',
            text: '新绛县',
            center: '111.224767,35.616007',
          },
        ],
      },
      {
        value: '141000',
        text: '临汾市',
        center: '111.51931,36.088581',

        children: [
          {
            value: '141030',
            text: '大宁县',
            center: '110.752914,36.465126',
          },
          {
            value: '141031',
            text: '隰县',
            center: '110.940752,36.693345',
          },
          {
            value: '141025',
            text: '古县',
            center: '111.92031,36.266767',
          },
          {
            value: '141026',
            text: '安泽县',
            center: '112.250242,36.147921',
          },
          {
            value: '141028',
            text: '吉县',
            center: '110.680513,36.096833',
          },
          {
            value: '141032',
            text: '永和县',
            center: '110.631981,36.759524',
          },
          {
            value: '141029',
            text: '乡宁县',
            center: '110.846585,35.970834',
          },
          {
            value: '141033',
            text: '蒲县',
            center: '111.096457,36.41183',
          },
          {
            value: '141002',
            text: '尧都区',
            center: '111.578797,36.082463',
          },
          {
            value: '141027',
            text: '浮山县',
            center: '111.848883,35.968124',
          },
          {
            value: '141021',
            text: '曲沃县',
            center: '111.475783,35.641883',
          },
          {
            value: '141034',
            text: '汾西县',
            center: '111.563993,36.652833',
          },
          {
            value: '141024',
            text: '洪洞县',
            center: '111.67571,36.254087',
          },
          {
            value: '141082',
            text: '霍州市',
            center: '111.755111,36.569046',
          },
          {
            value: '141022',
            text: '翼城县',
            center: '111.719048,35.739706',
          },
          {
            value: '141023',
            text: '襄汾县',
            center: '111.441725,35.876293',
          },
          {
            value: '141081',
            text: '侯马市',
            center: '111.372002,35.619105',
          },
        ],
      },
      {
        value: '140200',
        text: '大同市',
        center: '113.366749,40.09711',

        children: [
          {
            value: '140223',
            text: '广灵县',
            center: '114.282703,39.760404',
          },
          {
            value: '140225',
            text: '浑源县',
            center: '113.69183,39.706485',
          },
          {
            value: '140221',
            text: '阳高县',
            center: '113.748944,40.361059',
          },
          {
            value: '140215',
            text: '云州区',
            center: '113.612496,40.040156',
          },
          {
            value: '140226',
            text: '左云县',
            center: '112.703008,40.013442',
          },
          {
            value: '140224',
            text: '灵丘县',
            center: '114.234452,39.442459',
          },
          {
            value: '140214',
            text: '云冈区',
            center: '113.149604,40.005383',
          },
          {
            value: '140222',
            text: '天镇县',
            center: '114.090871,40.42087',
          },
          {
            value: '140212',
            text: '新荣区',
            center: '113.139628,40.256355',
          },
          {
            value: '140213',
            text: '平城区',
            center: '113.300179,40.076991',
          },
        ],
      },
      {
        value: '140700',
        text: '晋中市',
        center: '112.752633,37.688006',

        children: [
          {
            value: '140724',
            text: '昔阳县',
            center: '113.707151,37.612577',
          },
          {
            value: '140725',
            text: '寿阳县',
            center: '113.176373,37.895191',
          },
          {
            value: '140721',
            text: '榆社县',
            center: '112.975378,37.071209',
          },
          {
            value: '140729',
            text: '灵石县',
            center: '111.778692,36.848085',
          },
          {
            value: '140703',
            text: '太谷区',
            center: '112.551297,37.421392',
          },
          {
            value: '140781',
            text: '介休市',
            center: '111.916451,37.027538',
          },
          {
            value: '140722',
            text: '左权县',
            center: '113.379412,37.082746',
          },
          {
            value: '140723',
            text: '和顺县',
            center: '113.570295,37.329696',
          },
          {
            value: '140702',
            text: '榆次区',
            center: '112.707564,37.698637',
          },
          {
            value: '140727',
            text: '祁县',
            center: '112.335226,37.358425',
          },
          {
            value: '140728',
            text: '平遥县',
            center: '112.175825,37.189614',
          },
        ],
      },
      {
        value: '141100',
        text: '吕梁市',
        center: '111.14454,37.518996',

        children: [
          {
            value: '141127',
            text: '岚县',
            center: '111.672156,38.279587',
          },
          {
            value: '141128',
            text: '方山县',
            center: '111.244309,37.895017',
          },
          {
            value: '141129',
            text: '中阳县',
            center: '111.178841,37.357816',
          },
          {
            value: '141130',
            text: '交口县',
            center: '111.181241,36.982205',
          },
          {
            value: '141123',
            text: '兴县',
            center: '111.127486,38.461818',
          },
          {
            value: '141126',
            text: '石楼县',
            center: '110.834712,36.998461',
          },
          {
            value: '141121',
            text: '文水县',
            center: '112.028866,37.438101',
          },
          {
            value: '141102',
            text: '离石区',
            center: '111.150325,37.517797',
          },
          {
            value: '141125',
            text: '柳林县',
            center: '110.888993,37.429816',
          },
          {
            value: '141124',
            text: '临县',
            center: '110.992712,37.951008',
          },
          {
            value: '141182',
            text: '汾阳市',
            center: '111.770834,37.261493',
          },
          {
            value: '141181',
            text: '孝义市',
            center: '111.778935,37.146051',
          },
          {
            value: '141122',
            text: '交城县',
            center: '112.155857,37.55169',
          },
        ],
      },
      {
        value: '140100',
        text: '太原市',
        center: '112.549656,37.870451',

        children: [
          {
            value: '140123',
            text: '娄烦县',
            center: '111.79715,38.067569',
          },
          {
            value: '140122',
            text: '阳曲县',
            center: '112.67292,38.058511',
          },
          {
            value: '140181',
            text: '古交市',
            center: '112.175034,37.907414',
          },
          {
            value: '140108',
            text: '尖草坪区',
            center: '112.486141,37.940052',
          },
          {
            value: '140107',
            text: '杏花岭区',
            center: '112.570412,37.894241',
          },
          {
            value: '140106',
            text: '迎泽区',
            center: '112.563373,37.863308',
          },
          {
            value: '140109',
            text: '万柏林区',
            center: '112.515638,37.859738',
          },
          {
            value: '140110',
            text: '晋源区',
            center: '112.477869,37.715519',
          },
          {
            value: '140121',
            text: '清徐县',
            center: '112.359367,37.608751',
          },
          {
            value: '140105',
            text: '小店区',
            center: '112.565524,37.736865',
          },
        ],
      },
    ],
  },
  {
    value: '540000',
    text: '西藏自治区',
    center: '91.117449,29.648694',

    children: [
      {
        value: '540300',
        text: '昌都市',
        center: '97.170425,31.142879',

        children: [
          {
            value: '540321',
            text: '江达县',
            center: '98.218336,31.499176',
          },
          {
            value: '540324',
            text: '丁青县',
            center: '95.619868,31.409024',
          },
          {
            value: '540302',
            text: '卡若区',
            center: '97.196021,31.112087',
          },
          {
            value: '540323',
            text: '类乌齐县',
            center: '96.600246,31.211601',
          },
          {
            value: '540330',
            text: '边坝县',
            center: '94.7078,30.933652',
          },
          {
            value: '540322',
            text: '贡觉县',
            center: '98.27097,30.860099',
          },
          {
            value: '540329',
            text: '洛隆县',
            center: '95.825169,30.741988',
          },
          {
            value: '540325',
            text: '察雅县',
            center: '97.568752,30.653943',
          },
          {
            value: '540326',
            text: '八宿县',
            center: '96.917836,30.053209',
          },
          {
            value: '540327',
            text: '左贡县',
            center: '97.841176,29.671488',
          },
          {
            value: '540328',
            text: '芒康县',
            center: '98.593493,29.679957',
          },
        ],
      },
      {
        value: '540600',
        text: '那曲市',
        center: '92.05151,31.477905',

        children: [
          {
            value: '540624',
            text: '安多县',
            center: '91.68195,32.265016',
          },
          {
            value: '540623',
            text: '聂荣县',
            center: '92.303377,32.10775',
          },
          {
            value: '540628',
            text: '巴青县',
            center: '94.053438,31.91847',
          },
          {
            value: '540625',
            text: '申扎县',
            center: '88.709936,30.93045',
          },
          {
            value: '540627',
            text: '班戈县',
            center: '90.009822,31.392157',
          },
          {
            value: '540622',
            text: '比如县',
            center: '93.681302,31.477914',
          },
          {
            value: '540602',
            text: '色尼区',
            center: '92.053498,31.469645',
          },
          {
            value: '540626',
            text: '索县',
            center: '93.785068,31.888045',
          },
          {
            value: '540621',
            text: '嘉黎县',
            center: '93.232347,30.641543',
          },
          {
            value: '540629',
            text: '尼玛县',
            center: '87.236772,31.784701',
          },
          {
            value: '540630',
            text: '双湖县',
            center: '88.838017,33.188355',
          },
        ],
      },
      {
        value: '540100',
        text: '拉萨市',
        center: '91.171924,29.653491',

        children: [
          {
            value: '540122',
            text: '当雄县',
            center: '91.101186,30.473134',
          },
          {
            value: '540121',
            text: '林周县',
            center: '91.265287,29.893545',
          },
          {
            value: '540127',
            text: '墨竹工卡县',
            center: '91.739134,29.850344',
          },
          {
            value: '540104',
            text: '达孜区',
            center: '91.349503,29.670173',
          },
          {
            value: '540103',
            text: '堆龙德庆区',
            center: '91.002866,29.646815',
          },
          {
            value: '540123',
            text: '尼木县',
            center: '90.16446,29.43202',
          },
          {
            value: '540102',
            text: '城关区',
            center: '91.140368,29.654813',
          },
          {
            value: '540124',
            text: '曲水县',
            center: '90.743355,29.354293',
          },
        ],
      },
      {
        value: '540200',
        text: '日喀则市',
        center: '88.880423,29.266838',

        children: [
          {
            value: '540232',
            text: '仲巴县',
            center: '84.03153,29.770279',
          },
          {
            value: '540226',
            text: '昂仁县',
            center: '87.227739,29.299444',
          },
          {
            value: '540227',
            text: '谢通门县',
            center: '88.255784,29.425455',
          },
          {
            value: '540221',
            text: '南木林县',
            center: '89.099243,29.682331',
          },
          {
            value: '540236',
            text: '萨嘎县',
            center: '85.232941,29.328818',
          },
          {
            value: '540202',
            text: '桑珠孜区',
            center: '88.898503,29.247726',
          },
          {
            value: '540225',
            text: '拉孜县',
            center: '87.636934,29.08188',
          },
          {
            value: '540229',
            text: '仁布县',
            center: '89.841983,29.230933',
          },
          {
            value: '540224',
            text: '萨迦县',
            center: '88.021674,28.899664',
          },
          {
            value: '540234',
            text: '吉隆县',
            center: '85.298109,28.856542',
          },
          {
            value: '540228',
            text: '白朗县',
            center: '89.261977,29.107688',
          },
          {
            value: '540222',
            text: '江孜县',
            center: '89.605654,28.91186',
          },
          {
            value: '540235',
            text: '聂拉木县',
            center: '85.982237,28.155186',
          },
          {
            value: '540223',
            text: '定日县',
            center: '87.12612,28.658743',
          },
          {
            value: '540230',
            text: '康马县',
            center: '89.681663,28.555627',
          },
          {
            value: '540237',
            text: '岗巴县',
            center: '88.515318,28.271189',
          },
          {
            value: '540233',
            text: '亚东县',
            center: '88.907136,27.486094',
          },
          {
            value: '540231',
            text: '定结县',
            center: '87.765872,28.364159',
          },
        ],
      },
      {
        value: '540500',
        text: '山南市',
        center: '91.771426,29.237722',

        children: [
          {
            value: '540523',
            text: '桑日县',
            center: '92.017723,29.259439',
          },
          {
            value: '540502',
            text: '乃东区',
            center: '91.761538,29.224904',
          },
          {
            value: '540528',
            text: '加查县',
            center: '92.592701,29.140355',
          },
          {
            value: '540521',
            text: '扎囊县',
            center: '91.33725,29.245113',
          },
          {
            value: '540522',
            text: '贡嘎县',
            center: '90.978425,29.290169',
          },
          {
            value: '540531',
            text: '浪卡子县',
            center: '90.400251,28.96693',
          },
          {
            value: '540525',
            text: '曲松县',
            center: '92.203738,29.062826',
          },
          {
            value: '540529',
            text: '隆子县',
            center: '92.461774,28.40743',
          },
          {
            value: '540527',
            text: '洛扎县',
            center: '90.859971,28.385811',
          },
          {
            value: '540526',
            text: '措美县',
            center: '91.433509,28.438202',
          },
          {
            value: '540524',
            text: '琼结县',
            center: '91.684307,29.024492',
          },
          {
            value: '540530',
            text: '错那市',
            center: '91.957155,27.991121',
          },
        ],
      },
      {
        value: '540400',
        text: '林芝市',
        center: '94.361436,29.64875',

        children: [
          {
            value: '540424',
            text: '波密县',
            center: '95.768439,29.859751',
          },
          {
            value: '540421',
            text: '工布江达县',
            center: '93.246077,29.88528',
          },
          {
            value: '540402',
            text: '巴宜区',
            center: '94.361094,29.636576',
          },
          {
            value: '540422',
            text: '米林市',
            center: '94.213059,29.215971',
          },
          {
            value: '540423',
            text: '墨脱县',
            center: '95.332108,29.325425',
          },
          {
            value: '540426',
            text: '朗县',
            center: '93.074702,29.046337',
          },
          {
            value: '540425',
            text: '察隅县',
            center: '97.466919,28.66128',
          },
        ],
      },
      {
        value: '542500',
        text: '阿里地区',
        center: '80.105786,32.500987',

        children: [
          {
            value: '542526',
            text: '改则县',
            center: '84.062612,32.303148',
          },
          {
            value: '542522',
            text: '札达县',
            center: '79.807096,31.479882',
          },
          {
            value: '542527',
            text: '措勤县',
            center: '85.151881,31.017272',
          },
          {
            value: '542521',
            text: '普兰县',
            center: '81.177116,30.290467',
          },
          {
            value: '542524',
            text: '日土县',
            center: '79.733552,33.382017',
          },
          {
            value: '542523',
            text: '噶尔县',
            center: '80.096591,32.492078',
          },
          {
            value: '542525',
            text: '革吉县',
            center: '81.145433,32.387233',
          },
        ],
      },
    ],
  },
  {
    value: '220000',
    text: '吉林省',
    center: '125.325802,43.896942',

    children: [
      {
        value: '220200',
        text: '吉林市',
        center: '126.549719,43.838132',

        children: [
          {
            value: '220283',
            text: '舒兰市',
            center: '126.965515,44.405922',
          },
          {
            value: '220282',
            text: '桦甸市',
            center: '126.746245,42.972272',
          },
          {
            value: '220281',
            text: '蛟河市',
            center: '127.344773,43.72382',
          },
          {
            value: '220221',
            text: '永吉县',
            center: '126.497899,43.672198',
          },
          {
            value: '220284',
            text: '磐石市',
            center: '126.060328,42.946608',
          },
          {
            value: '220203',
            text: '龙潭区',
            center: '126.562131,43.910743',
          },
          {
            value: '220211',
            text: '丰满区',
            center: '126.561351,43.821192',
          },
          {
            value: '220204',
            text: '船营区',
            center: '126.540909,43.833806',
          },
          {
            value: '220202',
            text: '昌邑区',
            center: '126.574414,43.881896',
          },
        ],
      },
      {
        value: '220100',
        text: '长春市',
        center: '125.323643,43.816996',

        children: [
          {
            value: '220182',
            text: '榆树市',
            center: '126.533126,44.840263',
          },
          {
            value: '220183',
            text: '德惠市',
            center: '125.728552,44.521788',
          },
          {
            value: '220112',
            text: '双阳区',
            center: '125.664583,43.525367',
          },
          {
            value: '220122',
            text: '农安县',
            center: '125.184921,44.432829',
          },
          {
            value: '220113',
            text: '九台区',
            center: '125.839549,44.151672',
          },
          {
            value: '220103',
            text: '宽城区',
            center: '125.326614,43.943522',
          },
          {
            value: '220105',
            text: '二道区',
            center: '125.37419,43.865912',
          },
          {
            value: '220102',
            text: '南关区',
            center: '125.350341,43.86382',
          },
          {
            value: '220184',
            text: '公主岭市',
            center: '124.79379,43.495116',
          },
          {
            value: '220106',
            text: '绿园区',
            center: '125.256214,43.881047',
          },
          {
            value: '220104',
            text: '朝阳区',
            center: '125.288168,43.833845',
          },
        ],
      },
      {
        value: '220800',
        text: '白城市',
        center: '122.838102,45.620131',

        children: [
          {
            value: '220881',
            text: '洮南市',
            center: '122.79845,45.356849',
          },
          {
            value: '220882',
            text: '大安市',
            center: '124.291032,45.507004',
          },
          {
            value: '220822',
            text: '通榆县',
            center: '123.088093,44.812912',
          },
          {
            value: '220802',
            text: '洮北区',
            center: '122.851105,45.621545',
          },
          {
            value: '220821',
            text: '镇赉县',
            center: '123.19967,45.848195',
          },
        ],
      },
      {
        value: '220400',
        text: '辽源市',
        center: '125.144676,42.887961',

        children: [
          {
            value: '220403',
            text: '西安区',
            center: '125.149488,42.927252',
          },
          {
            value: '220421',
            text: '东丰县',
            center: '125.53096,42.677253',
          },
          {
            value: '220422',
            text: '东辽县',
            center: '124.991045,42.925636',
          },
          {
            value: '220402',
            text: '龙山区',
            center: '125.13703,42.902194',
          },
        ],
      },
      {
        value: '220700',
        text: '松原市',
        center: '124.825321,45.14191',

        children: [
          {
            value: '220723',
            text: '乾安县',
            center: '124.040651,45.003539',
          },
          {
            value: '220722',
            text: '长岭县',
            center: '123.967244,44.276293',
          },
          {
            value: '220781',
            text: '扶余市',
            center: '126.049534,44.989057',
          },
          {
            value: '220721',
            text: '前郭尔罗斯蒙古族自治县',
            center: '124.823417,45.118061',
          },
          {
            value: '220702',
            text: '宁江区',
            center: '124.792839,45.186486',
          },
        ],
      },
      {
        value: '222400',
        text: '延边朝鲜族自治州',
        center: '129.470605,42.909426',

        children: [
          {
            value: '222404',
            text: '珲春市',
            center: '130.365829,42.862551',
          },
          {
            value: '222402',
            text: '图们市',
            center: '129.843807,42.968039',
          },
          {
            value: '222406',
            text: '和龙市',
            center: '129.010932,42.546434',
          },
          {
            value: '222424',
            text: '汪清县',
            center: '129.785137,43.317215',
          },
          {
            value: '222401',
            text: '延吉市',
            center: '129.507655,42.891034',
          },
          {
            value: '222426',
            text: '安图县',
            center: '128.899744,43.111978',
          },
          {
            value: '222403',
            text: '敦化市',
            center: '128.232235,43.372669',
          },
          {
            value: '222405',
            text: '龙井市',
            center: '129.426529,42.767172',
          },
        ],
      },
      {
        value: '220300',
        text: '四平市',
        center: '124.350599,43.166764',

        children: [
          {
            value: '220303',
            text: '铁东区',
            center: '124.409852,43.162664',
          },
          {
            value: '220323',
            text: '伊通满族自治县',
            center: '125.305393,43.345754',
          },
          {
            value: '220382',
            text: '双辽市',
            center: '123.502398,43.518301',
          },
          {
            value: '220302',
            text: '铁西区',
            center: '124.345994,43.146288',
          },
          {
            value: '220322',
            text: '梨树县',
            center: '124.335389,43.30706',
          },
        ],
      },
      {
        value: '220600',
        text: '白山市',
        center: '126.414274,41.944132',

        children: [
          {
            value: '220622',
            text: '靖宇县',
            center: '126.813262,42.388902',
          },
          {
            value: '220605',
            text: '江源区',
            center: '126.591178,42.056747',
          },
          {
            value: '220621',
            text: '抚松县',
            center: '127.449387,42.221038',
          },
          {
            value: '220602',
            text: '浑江区',
            center: '126.416093,41.945409',
          },
          {
            value: '220623',
            text: '长白朝鲜族自治县',
            center: '128.20066,41.420253',
          },
          {
            value: '220681',
            text: '临江市',
            center: '126.918086,41.811979',
          },
        ],
      },
      {
        value: '220500',
        text: '通化市',
        center: '125.939721,41.728312',

        children: [
          {
            value: '220503',
            text: '二道江区',
            center: '126.042546,41.773989',
          },
          {
            value: '220502',
            text: '东昌区',
            center: '125.927187,41.702872',
          },
          {
            value: '220521',
            text: '通化县',
            center: '125.758927,41.680135',
          },
          {
            value: '220524',
            text: '柳河县',
            center: '125.744654,42.284594',
          },
          {
            value: '220523',
            text: '辉南县',
            center: '126.046006,42.684706',
          },
          {
            value: '220581',
            text: '梅河口市',
            center: '125.711129,42.539183',
          },
          {
            value: '220582',
            text: '集安市',
            center: '126.193172,41.125805',
          },
        ],
      },
    ],
  },
  {
    value: '530000',
    text: '云南省',
    center: '102.709372,25.046432',

    children: [
      {
        value: '530600',
        text: '昭通市',
        center: '103.717078,27.338185',

        children: [
          {
            value: '530626',
            text: '绥江县',
            center: '103.968995,28.592119',
          },
          {
            value: '530681',
            text: '水富市',
            center: '104.415964,28.629951',
          },
          {
            value: '530625',
            text: '永善县',
            center: '103.63756,28.229018',
          },
          {
            value: '530624',
            text: '大关县',
            center: '103.891164,27.748054',
          },
          {
            value: '530629',
            text: '威信县',
            center: '105.049012,27.846839',
          },
          {
            value: '530622',
            text: '巧家县',
            center: '102.935343,26.896904',
          },
          {
            value: '530628',
            text: '彝良县',
            center: '104.055991,27.624277',
          },
          {
            value: '530621',
            text: '鲁甸县',
            center: '103.557969,27.186668',
          },
          {
            value: '530623',
            text: '盐津县',
            center: '104.234458,28.108475',
          },
          {
            value: '530627',
            text: '镇雄县',
            center: '104.873486,27.441527',
          },
          {
            value: '530602',
            text: '昭阳区',
            center: '103.706323,27.320035',
          },
        ],
      },
      {
        value: '530300',
        text: '曲靖市',
        center: '103.796288,25.490866',

        children: [
          {
            value: '530326',
            text: '会泽县',
            center: '103.297155,26.417116',
          },
          {
            value: '530304',
            text: '马龙区',
            center: '103.578459,25.428102',
          },
          {
            value: '530381',
            text: '宣威市',
            center: '104.104255,26.218956',
          },
          {
            value: '530325',
            text: '富源县',
            center: '104.255082,25.674217',
          },
          {
            value: '530303',
            text: '沾益区',
            center: '103.822104,25.600424',
          },
          {
            value: '530323',
            text: '师宗县',
            center: '103.985224,24.822471',
          },
          {
            value: '530324',
            text: '罗平县',
            center: '104.297124,24.865388',
          },
          {
            value: '530322',
            text: '陆良县',
            center: '103.66671,25.0293',
          },
          {
            value: '530302',
            text: '麒麟区',
            center: '103.804406,25.496472',
          },
        ],
      },
      {
        value: '532500',
        text: '红河哈尼族彝族自治州',
        center: '103.374873,23.363129',

        children: [
          {
            value: '532504',
            text: '弥勒市',
            center: '103.414817,24.411774',
          },
          {
            value: '532524',
            text: '建水县',
            center: '102.826178,23.635824',
          },
          {
            value: '532502',
            text: '开远市',
            center: '103.266908,23.714518',
          },
          {
            value: '532529',
            text: '红河县',
            center: '102.420566,23.368946',
          },
          {
            value: '532523',
            text: '屏边苗族自治县',
            center: '103.675458,22.986733',
          },
          {
            value: '532528',
            text: '元阳县',
            center: '102.835358,23.219671',
          },
          {
            value: '532531',
            text: '绿春县',
            center: '102.392655,22.993654',
          },
          {
            value: '532530',
            text: '金平苗族瑶族傣族自治县',
            center: '103.227982,22.769894',
          },
          {
            value: '532501',
            text: '个旧市',
            center: '103.152663,23.389935',
          },
          {
            value: '532532',
            text: '河口瑶族自治县',
            center: '103.939265,22.529438',
          },
          {
            value: '532525',
            text: '石屏县',
            center: '102.496138,23.705707',
          },
          {
            value: '532503',
            text: '蒙自市',
            center: '103.364936,23.396111',
          },
          {
            value: '532527',
            text: '泸西县',
            center: '103.76615,24.531981',
          },
        ],
      },
      {
        value: '533300',
        text: '怒江傈僳族自治州',
        center: '98.8566,25.817555',

        children: [
          {
            value: '533324',
            text: '贡山独龙族怒族自治县',
            center: '98.666279,27.740839',
          },
          {
            value: '533323',
            text: '福贡县',
            center: '98.869132,26.901831',
          },
          {
            value: '533325',
            text: '兰坪白族普米族自治县',
            center: '99.416628,26.453622',
          },
          {
            value: '533301',
            text: '泸水市',
            center: '98.857723,25.822579',
          },
        ],
      },
      {
        value: '532800',
        text: '西双版纳傣族自治州',
        center: '100.797002,22.009037',

        children: [
          {
            value: '532822',
            text: '勐海县',
            center: '100.452444,21.957323',
          },
          {
            value: '532823',
            text: '勐腊县',
            center: '101.564635,21.459233',
          },
          {
            value: '532801',
            text: '景洪市',
            center: '100.799595,22.011792',
          },
        ],
      },
      {
        value: '530400',
        text: '玉溪市',
        center: '102.526673,24.346786',

        children: [
          {
            value: '530425',
            text: '易门县',
            center: '102.161947,24.672156',
          },
          {
            value: '530402',
            text: '红塔区',
            center: '102.540122,24.341215',
          },
          {
            value: '530403',
            text: '江川区',
            center: '102.748499,24.299441',
          },
          {
            value: '530426',
            text: '峨山彝族自治县',
            center: '102.405698,24.168899',
          },
          {
            value: '530424',
            text: '华宁县',
            center: '102.928914,24.19322',
          },
          {
            value: '530423',
            text: '通海县',
            center: '102.725538,24.11114',
          },
          {
            value: '530481',
            text: '澄江市',
            center: '102.904181,24.675536',
          },
          {
            value: '530428',
            text: '元江哈尼族彝族傣族自治县',
            center: '101.998138,23.596068',
          },
          {
            value: '530427',
            text: '新平彝族傣族自治县',
            center: '101.990805,24.070436',
          },
        ],
      },
      {
        value: '532900',
        text: '大理白族自治州',
        center: '100.267608,25.606548',

        children: [
          {
            value: '532930',
            text: '洱源县',
            center: '99.962294,26.11337',
          },
          {
            value: '532932',
            text: '鹤庆县',
            center: '100.176331,26.560122',
          },
          {
            value: '532931',
            text: '剑川县',
            center: '99.905041,26.536889',
          },
          {
            value: '532929',
            text: '云龙县',
            center: '99.371021,25.885733',
          },
          {
            value: '532924',
            text: '宾川县',
            center: '100.590274,25.830491',
          },
          {
            value: '532922',
            text: '漾濞彝族自治县',
            center: '99.958089,25.669944',
          },
          {
            value: '532901',
            text: '大理市',
            center: '100.301614,25.678466',
          },
          {
            value: '532928',
            text: '永平县',
            center: '99.54063,25.464134',
          },
          {
            value: '532927',
            text: '巍山彝族回族自治县',
            center: '100.306977,25.227065',
          },
          {
            value: '532923',
            text: '祥云县',
            center: '100.549961,25.483727',
          },
          {
            value: '532926',
            text: '南涧彝族自治县',
            center: '100.510333,25.032353',
          },
          {
            value: '532925',
            text: '弥渡县',
            center: '100.491038,25.343778',
          },
        ],
      },
      {
        value: '530800',
        text: '普洱市',
        center: '100.966011,22.825229',

        children: [
          {
            value: '530825',
            text: '镇沅彝族哈尼族拉祜族自治县',
            center: '101.108733,24.00445',
          },
          {
            value: '530822',
            text: '墨江哈尼族自治县',
            center: '101.692461,23.431894',
          },
          {
            value: '530824',
            text: '景谷傣族彝族自治县',
            center: '100.702807,23.496987',
          },
          {
            value: '530821',
            text: '宁洱哈尼族彝族自治县',
            center: '101.045743,23.048809',
          },
          {
            value: '530828',
            text: '澜沧拉祜族自治县',
            center: '99.932045,22.555799',
          },
          {
            value: '530802',
            text: '思茅区',
            center: '100.977069,22.786769',
          },
          {
            value: '530829',
            text: '西盟佤族自治县',
            center: '99.59016,22.644237',
          },
          {
            value: '530826',
            text: '江城哈尼族彝族自治县',
            center: '101.862344,22.585858',
          },
          {
            value: '530823',
            text: '景东彝族自治县',
            center: '100.833877,24.446731',
          },
          {
            value: '530827',
            text: '孟连傣族拉祜族佤族自治县',
            center: '99.584225,22.329053',
          },
        ],
      },
      {
        value: '533400',
        text: '迪庆藏族自治州',
        center: '99.70211,27.819149',

        children: [
          {
            value: '533422',
            text: '德钦县',
            center: '98.917851,28.464213',
          },
          {
            value: '533401',
            text: '香格里拉市',
            center: '99.743582,27.842185',
          },
          {
            value: '533423',
            text: '维西傈僳族自治县',
            center: '99.300937,27.163808',
          },
        ],
      },
      {
        value: '532300',
        text: '楚雄彝族自治州',
        center: '101.528304,25.045678',

        children: [
          {
            value: '532326',
            text: '大姚县',
            center: '101.336576,25.729551',
          },
          {
            value: '532328',
            text: '元谋县',
            center: '101.87434,25.704499',
          },
          {
            value: '532325',
            text: '姚安县',
            center: '101.241632,25.504287',
          },
          {
            value: '532323',
            text: '牟定县',
            center: '101.546898,25.312939',
          },
          {
            value: '532302',
            text: '禄丰市',
            center: '102.079082,25.151061',
          },
          {
            value: '532301',
            text: '楚雄市',
            center: '101.546242,25.032945',
          },
          {
            value: '532322',
            text: '双柏县',
            center: '101.642369,24.688814',
          },
          {
            value: '532329',
            text: '武定县',
            center: '102.403949,25.530731',
          },
          {
            value: '532327',
            text: '永仁县',
            center: '101.666795,26.049522',
          },
          {
            value: '532324',
            text: '南华县',
            center: '101.283236,25.200163',
          },
        ],
      },
      {
        value: '532600',
        text: '文山壮族苗族自治州',
        center: '104.21567,23.400983',

        children: [
          {
            value: '532626',
            text: '丘北县',
            center: '104.166713,24.05064',
          },
          {
            value: '532622',
            text: '砚山县',
            center: '104.336905,23.605075',
          },
          {
            value: '532627',
            text: '广南县',
            center: '105.055075,24.046378',
          },
          {
            value: '532624',
            text: '麻栗坡县',
            center: '104.702732,23.125837',
          },
          {
            value: '532601',
            text: '文山市',
            center: '104.233237,23.38683',
          },
          {
            value: '532623',
            text: '西畴县',
            center: '104.671802,23.437707',
          },
          {
            value: '532625',
            text: '马关县',
            center: '104.394524,23.013108',
          },
          {
            value: '532628',
            text: '富宁县',
            center: '105.630921,23.625072',
          },
        ],
      },
      {
        value: '530100',
        text: '昆明市',
        center: '102.833669,24.88149',

        children: [
          {
            value: '530113',
            text: '东川区',
            center: '103.187825,26.082997',
          },
          {
            value: '530129',
            text: '寻甸回族彝族自治县',
            center: '103.256559,25.558163',
          },
          {
            value: '530102',
            text: '五华区',
            center: '102.707262,25.043635',
          },
          {
            value: '530125',
            text: '宜良县',
            center: '103.141674,24.91983',
          },
          {
            value: '530115',
            text: '晋宁区',
            center: '102.595325,24.669077',
          },
          {
            value: '530181',
            text: '安宁市',
            center: '102.47865,24.919831',
          },
          {
            value: '530112',
            text: '西山区',
            center: '102.664426,25.038039',
          },
          {
            value: '530124',
            text: '富民县',
            center: '102.497722,25.221924',
          },
          {
            value: '530127',
            text: '嵩明县',
            center: '103.043384,25.327273',
          },
          {
            value: '530111',
            text: '官渡区',
            center: '102.748888,24.950285',
          },
          {
            value: '530114',
            text: '呈贡区',
            center: '102.822104,24.885738',
          },
          {
            value: '530128',
            text: '禄劝彝族苗族自治县',
            center: '102.471993,25.551768',
          },
          {
            value: '530103',
            text: '盘龙区',
            center: '102.751643,25.116512',
          },
          {
            value: '530126',
            text: '石林彝族自治县',
            center: '103.290536,24.771761',
          },
        ],
      },
      {
        value: '530900',
        text: '临沧市',
        center: '100.088837,23.884175',

        children: [
          {
            value: '530921',
            text: '凤庆县',
            center: '99.92873,24.580559',
          },
          {
            value: '530922',
            text: '云县',
            center: '100.1303,24.444461',
          },
          {
            value: '530926',
            text: '耿马傣族佤族自治县',
            center: '99.397126,23.538092',
          },
          {
            value: '530902',
            text: '临翔区',
            center: '100.082073,23.895298',
          },
          {
            value: '530927',
            text: '沧源佤族自治县',
            center: '99.245894,23.146758',
          },
          {
            value: '530925',
            text: '双江拉祜族佤族布朗族傣族自治县',
            center: '99.828225,23.472719',
          },
          {
            value: '530924',
            text: '镇康县',
            center: '98.825389,23.762886',
          },
          {
            value: '530923',
            text: '永德县',
            center: '99.258702,24.018463',
          },
        ],
      },
      {
        value: '533100',
        text: '德宏傣族景颇族自治州',
        center: '98.585621,24.433146',

        children: [
          {
            value: '533122',
            text: '梁河县',
            center: '98.296584,24.804275',
          },
          {
            value: '533103',
            text: '芒市',
            center: '98.58809,24.433766',
          },
          {
            value: '533123',
            text: '盈江县',
            center: '97.943474,24.691325',
          },
          {
            value: '533124',
            text: '陇川县',
            center: '97.793359,24.182347',
          },
          {
            value: '533102',
            text: '瑞丽市',
            center: '97.855423,24.018377',
          },
        ],
      },
      {
        value: '530500',
        text: '保山市',
        center: '99.161489,25.112018',

        children: [
          {
            value: '530581',
            text: '腾冲市',
            center: '98.490276,25.020283',
          },
          {
            value: '530502',
            text: '隆阳区',
            center: '99.165638,25.121137',
          },
          {
            value: '530521',
            text: '施甸县',
            center: '99.18919,24.723084',
          },
          {
            value: '530523',
            text: '龙陵县',
            center: '98.68941,24.586703',
          },
          {
            value: '530524',
            text: '昌宁县',
            center: '99.605105,24.827739',
          },
        ],
      },
      {
        value: '530700',
        text: '丽江市',
        center: '100.225936,26.855165',

        children: [
          {
            value: '530724',
            text: '宁蒗彝族自治县',
            center: '100.851083,27.282207',
          },
          {
            value: '530722',
            text: '永胜县',
            center: '100.750907,26.684215',
          },
          {
            value: '530702',
            text: '古城区',
            center: '100.22583,26.876468',
          },
          {
            value: '530721',
            text: '玉龙纳西族自治县',
            center: '100.236967,26.821494',
          },
          {
            value: '530723',
            text: '华坪县',
            center: '101.265373,26.629598',
          },
        ],
      },
    ],
  },
  {
    value: '110000',
    text: '北京市',
    center: '116.407387,39.904179',

    children: [
      {
        value: '110100',
        text: '北京城区',
        center: '116.405285,39.904989',

        children: [
          {
            value: '110116',
            text: '怀柔区',
            center: '116.631974,40.317003',
          },
          {
            value: '110109',
            text: '门头沟区',
            center: '116.101668,39.940842',
          },
          {
            value: '110117',
            text: '平谷区',
            center: '117.121589,40.140805',
          },
          {
            value: '110118',
            text: '密云区',
            center: '116.843351,40.377058',
          },
          {
            value: '110107',
            text: '石景山区',
            center: '116.223015,39.906304',
          },
          {
            value: '110102',
            text: '西城区',
            center: '116.36585,39.9126',
          },
          {
            value: '110108',
            text: '海淀区',
            center: '116.2977,39.959893',
          },
          {
            value: '110113',
            text: '顺义区',
            center: '116.661474,40.149891',
          },
          {
            value: '110114',
            text: '昌平区',
            center: '116.231034,40.220952',
          },
          {
            value: '110119',
            text: '延庆区',
            center: '115.974609,40.457033',
          },
          {
            value: '110111',
            text: '房山区',
            center: '116.143426,39.748889',
          },
          {
            value: '110105',
            text: '朝阳区',
            center: '116.443136,39.921444',
          },
          {
            value: '110106',
            text: '丰台区',
            center: '116.286726,39.858538',
          },
          {
            value: '110112',
            text: '通州区',
            center: '116.72923,39.916403',
          },
          {
            value: '110101',
            text: '东城区',
            center: '116.416334,39.928359',
          },
          {
            value: '110115',
            text: '大兴区',
            center: '116.341483,39.726917',
          },
        ],
      },
    ],
  },
];
